import { Region } from '../types';

export const CHINA_REGIONS: Region[] = [
  {
    "code": "000000",
    "name": "全国",
    "center": [
      104.1954,
      35.8617
    ],
    "children": [
      {
        "code": "000100",
        "name": "全域",
        "center": [
          104.1954,
          35.8617
        ],
        "children": [
          {
            "code": "000101",
            "name": "全国全域范围",
            "center": [
              104.1954,
              35.8617
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "110000",
    "name": "北京市",
    "center": [
      116.4074,
      39.9042
    ],
    "children": [
      {
        "code": "110100",
        "name": "全市范围",
        "center": [
          116.4074,
          39.9042
        ],
        "children": [
          { "code": "110100_ALL", "name": "全市全域", "center": [116.4074, 39.9042] },
          { "code": "110101", "name": "东城区", "center": [116.4188, 39.9165] },
          { "code": "110102", "name": "西城区", "center": [116.3668, 39.9118] },
          { "code": "110105", "name": "朝阳区", "center": [116.4864, 39.9214] },
          { "code": "110106", "name": "丰台区", "center": [116.2863, 39.8585] },
          { "code": "110107", "name": "石景山区", "center": [116.223, 39.9056] },
          { "code": "110108", "name": "海淀区", "center": [116.2981, 39.9593] },
          { "code": "110109", "name": "门头沟区", "center": [116.1013, 39.9404] },
          { "code": "110111", "name": "房山区", "center": [116.1425, 39.7478] },
          { "code": "110112", "name": "通州区", "center": [116.6586, 39.9025] },
          { "code": "110113", "name": "顺义区", "center": [116.6541, 40.1302] },
          { "code": "110114", "name": "昌平区", "center": [116.2312, 40.2207] },
          { "code": "110115", "name": "大兴区", "center": [116.3414, 39.7267] },
          { "code": "110116", "name": "怀柔区", "center": [116.6316, 40.316] },
          { "code": "110117", "name": "平谷区", "center": [117.1123, 40.1407] },
          { "code": "110118", "name": "密云区", "center": [116.843, 40.3762] },
          { "code": "110119", "name": "延庆区", "center": [115.975, 40.4567] }
        ]
      },
      {
        "code": "110100_SHI",
        "name": "市辖区",
        "center": [116.4074, 39.9042],
        "children": [
          { "code": "110100_SALL", "name": "全市全域", "center": [116.4074, 39.9042] },
          { "code": "110101_S", "name": "东城区", "center": [116.4188, 39.9165] },
          { "code": "110102_S", "name": "西城区", "center": [116.3668, 39.9118] },
          { "code": "110105_S", "name": "朝阳区", "center": [116.4864, 39.9214] },
          { "code": "110106_S", "name": "丰台区", "center": [116.2863, 39.8585] },
          { "code": "110107_S", "name": "石景山区", "center": [116.223, 39.9056] },
          { "code": "110108_S", "name": "海淀区", "center": [116.2981, 39.9593] },
          { "code": "110109_S", "name": "门头沟区", "center": [116.1013, 39.9404] },
          { "code": "110111_S", "name": "房山区", "center": [116.1425, 39.7478] },
          { "code": "110112_S", "name": "通州区", "center": [116.6586, 39.9025] },
          { "code": "110113_S", "name": "顺义区", "center": [116.6541, 40.1302] },
          { "code": "110114_S", "name": "昌平区", "center": [116.2312, 40.2207] },
          { "code": "110115_S", "name": "大兴区", "center": [116.3414, 39.7267] },
          { "code": "110116_S", "name": "怀柔区", "center": [116.6316, 40.316] },
          { "code": "110117_S", "name": "平谷区", "center": [117.1123, 40.1407] },
          { "code": "110118_S", "name": "密云区", "center": [116.843, 40.3762] },
          { "code": "110119_S", "name": "延庆区", "center": [115.975, 40.4567] }
        ]
      },
      {
        "code": "110100_CORE",
        "name": "城六区 (中心城区)",
        "center": [116.4074, 39.9042],
        "children": [
          { "code": "110100_CALL", "name": "城六区全域", "center": [116.4074, 39.9042] },
          { "code": "110101_C", "name": "东城区", "center": [116.4188, 39.9165] },
          { "code": "110102_C", "name": "西城区", "center": [116.3668, 39.9118] },
          { "code": "110105_C", "name": "朝阳区", "center": [116.4864, 39.9214] },
          { "code": "110106_C", "name": "丰台区", "center": [116.2863, 39.8585] },
          { "code": "110107_C", "name": "石景山区", "center": [116.223, 39.9056] },
          { "code": "110108_C", "name": "海淀区", "center": [116.2981, 39.9593] }
        ]
      },
      {
        "code": "110100_SUB",
        "name": "环城及远郊区",
        "center": [116.6586, 39.9025],
        "children": [
          { "code": "110100_SUBALL", "name": "远郊区全域", "center": [116.6586, 39.9025] },
          { "code": "110109_SUB", "name": "门头沟区", "center": [116.1013, 39.9404] },
          { "code": "110111_SUB", "name": "房山区", "center": [116.1425, 39.7478] },
          { "code": "110112_SUB", "name": "通州区", "center": [116.6586, 39.9025] },
          { "code": "110113_SUB", "name": "顺义区", "center": [116.6541, 40.1302] },
          { "code": "110114_SUB", "name": "昌平区", "center": [116.2312, 40.2207] },
          { "code": "110115_SUB", "name": "大兴区", "center": [116.3414, 39.7267] },
          { "code": "110116_SUB", "name": "怀柔区", "center": [116.6316, 40.316] },
          { "code": "110117_SUB", "name": "平谷区", "center": [117.1123, 40.1407] },
          { "code": "110118_SUB", "name": "密云区", "center": [116.843, 40.3762] },
          { "code": "110119_SUB", "name": "延庆区", "center": [115.975, 40.4567] }
        ]
      },
      {
        "code": "110101_D", "name": "东城区", "center": [116.4188, 39.9165],
        "children": [
          { "code": "110101_0", "name": "东城区全域", "center": [116.4188, 39.9165] },
          { "code": "110101_1", "name": "王府井/东单", "center": [116.4121, 39.9135] },
          { "code": "110101_2", "name": "前门/崇文门", "center": [116.4023, 39.8988] },
          { "code": "110101_3", "name": "东直门/雍和宫", "center": [116.4351, 39.9412] }
        ]
      },
      {
        "code": "110102_D", "name": "西城区", "center": [116.3668, 39.9118],
        "children": [
          { "code": "110102_0", "name": "西城区全域", "center": [116.3668, 39.9118] },
          { "code": "110102_1", "name": "金融街/复兴门", "center": [116.3582, 39.9085] },
          { "code": "110102_2", "name": "西单/宣武门", "center": [116.3751, 39.9072] },
          { "code": "110102_3", "name": "什刹海/鼓楼", "center": [116.3881, 39.9405] }
        ]
      },
      {
        "code": "110105_D", "name": "朝阳区", "center": [116.4864, 39.9214],
        "children": [
          { "code": "110105_0", "name": "朝阳区全域", "center": [116.4864, 39.9214] },
          { "code": "110105_1", "name": "国贸/CBD", "center": [116.4601, 39.9082] },
          { "code": "110105_2", "name": "三里屯/工体", "center": [116.4552, 39.9361] },
          { "code": "110105_3", "name": "望京/酒仙桥", "center": [116.4712, 39.9982] },
          { "code": "110105_4", "name": "亚运村/奥运村", "center": [116.4011, 39.9912] }
        ]
      },
      {
        "code": "110106_D", "name": "丰台区", "center": [116.2863, 39.8585],
        "children": [
          { "code": "110106_0", "name": "丰台区全域", "center": [116.2863, 39.8585] },
          { "code": "110106_1", "name": "丽泽商务区", "center": [116.3452, 39.8681] },
          { "code": "110106_2", "name": "方庄/蒲黄榆", "center": [116.4351, 39.8652] },
          { "code": "110106_3", "name": "丰台科技园", "center": [116.2912, 39.8311] }
        ]
      },
      {
        "code": "110107_D", "name": "石景山区", "center": [116.223, 39.9056],
        "children": [
          { "code": "110107_0", "name": "石景山区全域", "center": [116.223, 39.9056] },
          { "code": "110107_1", "name": "八角/古城", "center": [116.1912, 39.9081] },
          { "code": "110107_2", "name": "苹果园/金顶街", "center": [116.1751, 39.9281] }
        ]
      },
      {
        "code": "110108_D", "name": "海淀区", "center": [116.2981, 39.9593],
        "children": [
          { "code": "110108_0", "name": "海淀区全域", "center": [116.2981, 39.9593] },
          { "code": "110108_1", "name": "中关村/苏州街", "center": [116.3112, 39.9821] },
          { "code": "110108_2", "name": "五道口/清华", "center": [116.3381, 39.9912] },
          { "code": "110108_3", "name": "上地/中关村软件园", "center": [116.3012, 40.0381] },
          { "code": "110108_4", "name": "公主坟/万寿路", "center": [116.3081, 39.9081] }
        ]
      },
      {
        "code": "110109_D", "name": "门头沟区", "center": [116.1013, 39.9404],
        "children": [{ "code": "110109_0", "name": "门头沟区全域", "center": [116.1013, 39.9404] }]
      },
      {
        "code": "110111_D", "name": "房山区", "center": [116.1425, 39.7478],
        "children": [{ "code": "110111_0", "name": "房山区全域", "center": [116.1425, 39.7478] }]
      },
      {
        "code": "110112_D", "name": "通州区", "center": [116.6586, 39.9025],
        "children": [{ "code": "110112_0", "name": "通州区全域", "center": [116.6586, 39.9025] }]
      },
      {
        "code": "110113_D", "name": "顺义区", "center": [116.6541, 40.1302],
        "children": [{ "code": "110113_0", "name": "顺义区全域", "center": [116.6541, 40.1302] }]
      },
      {
        "code": "110114_D", "name": "昌平区", "center": [116.2312, 40.2207],
        "children": [{ "code": "110114_0", "name": "昌平区全域", "center": [116.2312, 40.2207] }]
      },
      {
        "code": "110115_D", "name": "大兴区", "center": [116.3414, 39.7267],
        "children": [{ "code": "110115_0", "name": "大兴区全域", "center": [116.3414, 39.7267] }]
      },
      {
        "code": "110116_D", "name": "怀柔区", "center": [116.6316, 40.316],
        "children": [{ "code": "110116_0", "name": "怀柔区全域", "center": [116.6316, 40.316] }]
      },
      {
        "code": "110117_D", "name": "平谷区", "center": [117.1123, 40.1407],
        "children": [{ "code": "110117_0", "name": "平谷区全域", "center": [117.1123, 40.1407] }]
      },
      {
        "code": "110118_D", "name": "密云区", "center": [116.843, 40.3762],
        "children": [{ "code": "110118_0", "name": "密云区全域", "center": [116.843, 40.3762] }]
      },
      {
        "code": "110119_D", "name": "延庆区", "center": [115.975, 40.4567],
        "children": [{ "code": "110119_0", "name": "延庆区全域", "center": [115.975, 40.4567] }]
      }
    ]
  },
  {
    "code": "120000",
    "name": "天津市",
    "center": [
      117.201,
      39.0842
    ],
    "children": [
      {
        "code": "120100",
        "name": "全市范围",
        "center": [
          117.201,
          39.0842
        ],
        "children": [
          { "code": "120100_ALL", "name": "全市全域", "center": [117.201, 39.0842] },
          { "code": "120101", "name": "和平区", "center": [117.2146, 39.1172] },
          { "code": "120102", "name": "河东区", "center": [117.2257, 39.1228] },
          { "code": "120103", "name": "河西区", "center": [117.2175, 39.0838] },
          { "code": "120104", "name": "南开区", "center": [117.1507, 39.1382] },
          { "code": "120105", "name": "河北区", "center": [117.196, 39.1482] },
          { "code": "120106", "name": "红桥区", "center": [117.1517, 39.1671] },
          { "code": "120110", "name": "东丽区", "center": [117.3138, 39.0869] },
          { "code": "120111", "name": "西青区", "center": [117.0089, 39.1412] },
          { "code": "120112", "name": "津南区", "center": [117.3854, 38.9912] },
          { "code": "120113", "name": "北辰区", "center": [117.1347, 39.2201] },
          { "code": "120114", "name": "武清区", "center": [117.0583, 39.3848] },
          { "code": "120115", "name": "宝坻区", "center": [117.3101, 39.7176] },
          { "code": "120116", "name": "滨海新区", "center": [117.6541, 39.0302] },
          { "code": "120117", "name": "宁河区", "center": [117.8253, 39.3304] },
          { "code": "120118", "name": "静海区", "center": [116.9254, 38.9463] },
          { "code": "120119", "name": "蓟州区", "center": [117.4078, 40.0456] }
        ]
      },
      {
        "code": "120100_SHI",
        "name": "市辖区",
        "center": [117.201, 39.0842],
        "children": [
          { "code": "120100_SALL", "name": "全市全域", "center": [117.201, 39.0842] },
          { "code": "120101_S", "name": "和平区", "center": [117.2146, 39.1172] },
          { "code": "120102_S", "name": "河东区", "center": [117.2257, 39.1228] },
          { "code": "120103_S", "name": "河西区", "center": [117.2175, 39.0838] },
          { "code": "120104_S", "name": "南开区", "center": [117.1507, 39.1382] },
          { "code": "120105_S", "name": "河北区", "center": [117.196, 39.1482] },
          { "code": "120106_S", "name": "红桥区", "center": [117.1517, 39.1671] },
          { "code": "120110_S", "name": "东丽区", "center": [117.3138, 39.0869] },
          { "code": "120111_S", "name": "西青区", "center": [117.0089, 39.1412] },
          { "code": "120112_S", "name": "津南区", "center": [117.3854, 38.9912] },
          { "code": "120113_S", "name": "北辰区", "center": [117.1347, 39.2201] },
          { "code": "120114_S", "name": "武清区", "center": [117.0583, 39.3848] },
          { "code": "120115_S", "name": "宝坻区", "center": [117.3101, 39.7176] },
          { "code": "120116_S", "name": "滨海新区", "center": [117.6541, 39.0302] },
          { "code": "120117_S", "name": "宁河区", "center": [117.8253, 39.3304] },
          { "code": "120118_S", "name": "静海区", "center": [116.9254, 38.9463] },
          { "code": "120119_S", "name": "蓟州区", "center": [117.4078, 40.0456] }
        ]
      },
      {
        "code": "120100_CORE",
        "name": "中心城区",
        "center": [117.201, 39.0842],
        "children": [
          { "code": "120100_CALL", "name": "中心城区全域", "center": [117.201, 39.0842] },
          { "code": "120101_C", "name": "和平区", "center": [117.2146, 39.1172] },
          { "code": "120102_C", "name": "河东区", "center": [117.2257, 39.1228] },
          { "code": "120103_C", "name": "河西区", "center": [117.2175, 39.0838] },
          { "code": "120104_C", "name": "南开区", "center": [117.1507, 39.1382] },
          { "code": "120105_C", "name": "河北区", "center": [117.196, 39.1482] },
          { "code": "120106_C", "name": "红桥区", "center": [117.1517, 39.1671] }
        ]
      },
      {
        "code": "120100_BH",
        "name": "滨海新区及环城",
        "center": [117.6541, 39.0302],
        "children": [
          { "code": "120100_BHALL", "name": "环城及滨海全域", "center": [117.6541, 39.0302] },
          { "code": "120110_B", "name": "东丽区", "center": [117.3138, 39.0869] },
          { "code": "120111_B", "name": "西青区", "center": [117.0089, 39.1412] },
          { "code": "120112_B", "name": "津南区", "center": [117.3854, 38.9912] },
          { "code": "120113_B", "name": "北辰区", "center": [117.1347, 39.2201] },
          { "code": "120116_B", "name": "滨海新区", "center": [117.6541, 39.0302] }
        ]
      },
      {
        "code": "120100_SUB",
        "name": "远郊县区",
        "center": [117.0583, 39.3848],
        "children": [
          { "code": "120100_SUBALL", "name": "远郊全域", "center": [117.0583, 39.3848] },
          { "code": "120114_SUB", "name": "武清区", "center": [117.0583, 39.3848] },
          { "code": "120115_SUB", "name": "宝坻区", "center": [117.3101, 39.7176] },
          { "code": "120117_SUB", "name": "宁河区", "center": [117.8253, 39.3304] },
          { "code": "120118_SUB", "name": "静海区", "center": [116.9254, 38.9463] },
          { "code": "120119_SUB", "name": "蓟州区", "center": [117.4078, 40.0456] }
        ]
      },
      {
        "code": "120101_D", "name": "和平区", "center": [117.2146, 39.1172],
        "children": [
          { "code": "120101_0", "name": "和平区全域", "center": [117.2146, 39.1172] },
          { "code": "120101_1", "name": "滨江道/小白楼", "center": [117.2152, 39.1181] },
          { "code": "120101_2", "name": "五大道/劝业场", "center": [117.2081, 39.1112] }
        ]
      },
      {
        "code": "120102_D", "name": "河东区", "center": [117.2257, 39.1228],
        "children": [{ "code": "120102_0", "name": "河东区全域", "center": [117.2257, 39.1228] }]
      },
      {
        "code": "120103_D", "name": "河西区", "center": [117.2175, 39.0838],
        "children": [
          { "code": "120103_0", "name": "河西区全域", "center": [117.2175, 39.0838] },
          { "code": "120103_1", "name": "友谊路/文化中心", "center": [117.2112, 39.0851] }
        ]
      },
      {
        "code": "120104_D", "name": "南开区", "center": [117.1507, 39.1382],
        "children": [
          { "code": "120104_0", "name": "南开区全域", "center": [117.1507, 39.1382] },
          { "code": "120104_1", "name": "鞍山西道/高新区", "center": [117.1581, 39.1281] },
          { "code": "120104_2", "name": "古文化街/鼓楼", "center": [117.1812, 39.1451] }
        ]
      },
      {
        "code": "120105_D", "name": "河北区", "center": [117.196, 39.1482],
        "children": [{ "code": "120105_0", "name": "河北区全域", "center": [117.196, 39.1482] }]
      },
      {
        "code": "120106_D", "name": "红桥区", "center": [117.1517, 39.1671],
        "children": [{ "code": "120106_0", "name": "红桥区全域", "center": [117.1517, 39.1671] }]
      },
      {
        "code": "120110_D", "name": "东丽区", "center": [117.3138, 39.0869],
        "children": [{ "code": "120110_0", "name": "东丽区全域", "center": [117.3138, 39.0869] }]
      },
      {
        "code": "120111_D", "name": "西青区", "center": [117.0089, 39.1412],
        "children": [{ "code": "120111_0", "name": "西青区全域", "center": [117.0089, 39.1412] }]
      },
      {
        "code": "120112_D", "name": "津南区", "center": [117.3854, 38.9912],
        "children": [{ "code": "120112_0", "name": "津南区全域", "center": [117.3854, 38.9912] }]
      },
      {
        "code": "120113_D", "name": "北辰区", "center": [117.1347, 39.2201],
        "children": [{ "code": "120113_0", "name": "北辰区全域", "center": [117.1347, 39.2201] }]
      },
      {
        "code": "120114_D", "name": "武清区", "center": [117.0583, 39.3848],
        "children": [{ "code": "120114_0", "name": "武清区全域", "center": [117.0583, 39.3848] }]
      },
      {
        "code": "120115_D", "name": "宝坻区", "center": [117.3101, 39.7176],
        "children": [{ "code": "120115_0", "name": "宝坻区全域", "center": [117.3101, 39.7176] }]
      },
      {
        "code": "120116_D", "name": "滨海新区", "center": [117.6541, 39.0302],
        "children": [
          { "code": "120116_0", "name": "滨海新区全域", "center": [117.6541, 39.0302] },
          { "code": "120116_1", "name": "塘沽/天津开发区(TEDA)", "center": [117.6812, 39.0212] }
        ]
      },
      {
        "code": "120117_D", "name": "宁河区", "center": [117.8253, 39.3304],
        "children": [{ "code": "120117_0", "name": "宁河区全域", "center": [117.8253, 39.3304] }]
      },
      {
        "code": "120118_D", "name": "静海区", "center": [116.9254, 38.9463],
        "children": [{ "code": "120118_0", "name": "静海区全域", "center": [116.9254, 38.9463] }]
      },
      {
        "code": "120119_D", "name": "蓟州区", "center": [117.4078, 40.0456],
        "children": [{ "code": "120119_0", "name": "蓟州区全域", "center": [117.4078, 40.0456] }]
      }
    ]
  },
  {
    "code": "310000",
    "name": "上海市",
    "center": [
      121.4737,
      31.2304
    ],
    "children": [
      {
        "code": "310100",
        "name": "全市范围",
        "center": [
          121.4737,
          31.2304
        ],
        "children": [
          { "code": "310100_ALL", "name": "全市全域", "center": [121.4737, 31.2304] },
          { "code": "310101", "name": "黄浦区", "center": [121.4844, 31.2317] },
          { "code": "310104", "name": "徐汇区", "center": [121.4365, 31.1883] },
          { "code": "310105", "name": "长宁区", "center": [121.4222, 31.2181] },
          { "code": "310106", "name": "静安区", "center": [121.4481, 31.229] },
          { "code": "310107", "name": "普陀区", "center": [121.397, 31.2493] },
          { "code": "310109", "name": "虹口区", "center": [121.4816, 31.2778] },
          { "code": "310110", "name": "杨浦区", "center": [121.526, 31.2595] },
          { "code": "310112", "name": "闵行区", "center": [121.3817, 31.1128] },
          { "code": "310113", "name": "宝山区", "center": [121.4897, 31.4045] },
          { "code": "310114", "name": "嘉定区", "center": [121.2655, 31.3747] },
          { "code": "310115", "name": "浦东新区", "center": [121.5447, 31.2224] },
          { "code": "310116", "name": "金山区", "center": [121.3416, 30.7417] },
          { "code": "310117", "name": "松江区", "center": [121.228, 31.0322] },
          { "code": "310118", "name": "青浦区", "center": [121.1242, 31.1502] },
          { "code": "310120", "name": "奉贤区", "center": [121.4741, 30.9179] },
          { "code": "310151", "name": "崇明区", "center": [121.3975, 31.6269] }
        ]
      },
      {
        "code": "310100_SHI",
        "name": "市辖区",
        "center": [121.4737, 31.2304],
        "children": [
          { "code": "310100_SALL", "name": "全市全域", "center": [121.4737, 31.2304] },
          { "code": "310101_S", "name": "黄浦区", "center": [121.4844, 31.2317] },
          { "code": "310104_S", "name": "徐汇区", "center": [121.4365, 31.1883] },
          { "code": "310105_S", "name": "长宁区", "center": [121.4222, 31.2181] },
          { "code": "310106_S", "name": "静安区", "center": [121.4481, 31.229] },
          { "code": "310107_S", "name": "普陀区", "center": [121.397, 31.2493] },
          { "code": "310109_S", "name": "虹口区", "center": [121.4816, 31.2778] },
          { "code": "310110_S", "name": "杨浦区", "center": [121.526, 31.2595] },
          { "code": "310112_S", "name": "闵行区", "center": [121.3817, 31.1128] },
          { "code": "310113_S", "name": "宝山区", "center": [121.4897, 31.4045] },
          { "code": "310114_S", "name": "嘉定区", "center": [121.2655, 31.3747] },
          { "code": "310115_S", "name": "浦东新区", "center": [121.5447, 31.2224] },
          { "code": "310116_S", "name": "金山区", "center": [121.3416, 30.7417] },
          { "code": "310117_S", "name": "松江区", "center": [121.228, 31.0322] },
          { "code": "310118_S", "name": "青浦区", "center": [121.1242, 31.1502] },
          { "code": "310120_S", "name": "奉贤区", "center": [121.4741, 30.9179] },
          { "code": "310151_S", "name": "崇明区", "center": [121.3975, 31.6269] }
        ]
      },
      {
        "code": "310100_CORE",
        "name": "中心城区 (核心区)",
        "center": [121.4737, 31.2304],
        "children": [
          { "code": "310100_CALL", "name": "中心城区全域", "center": [121.4737, 31.2304] },
          { "code": "310101_C", "name": "黄浦区", "center": [121.4844, 31.2317] },
          { "code": "310104_C", "name": "徐汇区", "center": [121.4365, 31.1883] },
          { "code": "310105_C", "name": "长宁区", "center": [121.4222, 31.2181] },
          { "code": "310106_C", "name": "静安区", "center": [121.4481, 31.229] },
          { "code": "310107_C", "name": "普陀区", "center": [121.397, 31.2493] },
          { "code": "310109_C", "name": "虹口区", "center": [121.4816, 31.2778] },
          { "code": "310110_C", "name": "杨浦区", "center": [121.526, 31.2595] }
        ]
      },
      {
        "code": "310100_SUB",
        "name": "郊区与近郊",
        "center": [121.5447, 31.2224],
        "children": [
          { "code": "310100_SUBALL", "name": "郊区全域", "center": [121.5447, 31.2224] },
          { "code": "310115_SUB", "name": "浦东新区", "center": [121.5447, 31.2224] },
          { "code": "310112_SUB", "name": "闵行区", "center": [121.3817, 31.1128] },
          { "code": "310113_SUB", "name": "宝山区", "center": [121.4897, 31.4045] },
          { "code": "310114_SUB", "name": "嘉定区", "center": [121.2655, 31.3747] },
          { "code": "310116_SUB", "name": "金山区", "center": [121.3416, 30.7417] },
          { "code": "310117_SUB", "name": "松江区", "center": [121.228, 31.0322] },
          { "code": "310118_SUB", "name": "青浦区", "center": [121.1242, 31.1502] },
          { "code": "310120_SUB", "name": "奉贤区", "center": [121.4741, 30.9179] },
          { "code": "310151_SUB", "name": "崇明区", "center": [121.3975, 31.6269] }
        ]
      },
      {
        "code": "310101_D", "name": "黄浦区", "center": [121.4844, 31.2317],
        "children": [
          { "code": "310101_0", "name": "黄浦区全域", "center": [121.4844, 31.2317] },
          { "code": "310101_1", "name": "南京东路/人民广场", "center": [121.4752, 31.2351] },
          { "code": "310101_2", "name": "外滩/豫园", "center": [121.4892, 31.2382] },
          { "code": "310101_3", "name": "淮海中路/新天地", "center": [121.4716, 31.2208] },
          { "code": "310101_4", "name": "打浦桥/日月光", "center": [121.4678, 31.2056] }
        ]
      },
      {
        "code": "310104_D", "name": "徐汇区", "center": [121.4365, 31.1883],
        "children": [
          { "code": "310104_0", "name": "徐汇区全域", "center": [121.4365, 31.1883] },
          { "code": "310104_1", "name": "徐家汇", "center": [121.4368, 31.1925] },
          { "code": "310104_2", "name": "衡山路/复兴路", "center": [121.4452, 31.2081] },
          { "code": "310104_3", "name": "漕河泾/万体馆", "center": [121.3982, 31.1685] },
          { "code": "310104_4", "name": "西岸滨江/龙华", "center": [121.4589, 31.1764] }
        ]
      },
      {
        "code": "310105_D", "name": "长宁区", "center": [121.4222, 31.2181],
        "children": [
          { "code": "310105_0", "name": "长宁区全域", "center": [121.4222, 31.2181] },
          { "code": "310105_1", "name": "中山公园", "center": [121.4151, 31.2181] },
          { "code": "310105_2", "name": "虹桥/古北", "center": [121.3852, 31.1981] }
        ]
      },
      {
        "code": "310106_D", "name": "静安区", "center": [121.4481, 31.229],
        "children": [
          { "code": "310106_0", "name": "静安区全域", "center": [121.4481, 31.229] },
          { "code": "310106_1", "name": "静安寺/南京西路", "center": [121.4451, 31.2251] },
          { "code": "310106_2", "name": "大宁/新客站", "center": [121.4552, 31.2581] }
        ]
      },
      {
        "code": "310107_D", "name": "普陀区", "center": [121.397, 31.2493],
        "children": [
          { "code": "310107_0", "name": "普陀区全域", "center": [121.397, 31.2493] },
          { "code": "310107_1", "name": "真如/长风", "center": [121.3912, 31.2381] },
          { "code": "310107_2", "name": "武宁/曹杨", "center": [121.4112, 31.2381] }
        ]
      },
      {
        "code": "310109_D", "name": "虹口区", "center": [121.4816, 31.2778],
        "children": [
          { "code": "310109_0", "name": "虹口区全域", "center": [121.4816, 31.2778] },
          { "code": "310109_1", "name": "四川北路/北外滩", "center": [121.4881, 31.2512] }
        ]
      },
      {
        "code": "310110_D", "name": "杨浦区", "center": [121.526, 31.2595],
        "children": [
          { "code": "310110_0", "name": "杨浦区全域", "center": [121.526, 31.2595] },
          { "code": "310110_1", "name": "五角场/创智天地", "center": [121.5112, 31.2981] }
        ]
      },
      {
        "code": "310112_D", "name": "闵行区", "center": [121.3817, 31.1128],
        "children": [
          { "code": "310112_0", "name": "闵行区全域", "center": [121.3817, 31.1128] },
          { "code": "310112_1", "name": "莘庄/七宝", "center": [121.3781, 31.1121] },
          { "code": "310112_2", "name": "虹桥枢纽/华漕", "center": [121.3181, 31.1981] }
        ]
      },
      {
        "code": "310113_D", "name": "宝山区", "center": [121.4897, 31.4045],
        "children": [{ "code": "310113_0", "name": "宝山区全域", "center": [121.4897, 31.4045] }]
      },
      {
        "code": "310114_D", "name": "嘉定区", "center": [121.2655, 31.3747],
        "children": [{ "code": "310114_0", "name": "嘉定区全域", "center": [121.2655, 31.3747] }]
      },
      {
        "code": "310115_D", "name": "浦东新区", "center": [121.5447, 31.2224],
        "children": [
          { "code": "310115_0", "name": "浦东新区全域", "center": [121.5447, 31.2224] },
          { "code": "310115_1", "name": "陆家嘴/八佰伴", "center": [121.5081, 31.2381] },
          { "code": "310115_2", "name": "张江高科", "center": [121.5912, 31.2012] },
          { "code": "310115_3", "name": "金桥/外高桥", "center": [121.6012, 31.2612] },
          { "code": "310115_4", "name": "川沙/迪士尼", "center": [121.6912, 31.1212] }
        ]
      },
      {
        "code": "310116_D", "name": "金山区", "center": [121.3416, 30.7417],
        "children": [{ "code": "310116_0", "name": "金山区全域", "center": [121.3416, 30.7417] }]
      },
      {
        "code": "310117_D", "name": "松江区", "center": [121.228, 31.0322],
        "children": [{ "code": "310117_0", "name": "松江区全域", "center": [121.228, 31.0322] }]
      },
      {
        "code": "310118_D", "name": "青浦区", "center": [121.1242, 31.1502],
        "children": [{ "code": "310118_0", "name": "青浦区全域", "center": [121.1242, 31.1502] }]
      },
      {
        "code": "310120_D", "name": "奉贤区", "center": [121.4741, 30.9179],
        "children": [{ "code": "310120_0", "name": "奉贤区全域", "center": [121.4741, 30.9179] }]
      },
      {
        "code": "310151_D", "name": "崇明区", "center": [121.3975, 31.6269],
        "children": [{ "code": "310151_0", "name": "崇明区全域", "center": [121.3975, 31.6269] }]
      }
    ]
  },
  {
    "code": "500000",
    "name": "重庆市",
    "center": [
      106.5516,
      29.563
    ],
    "children": [
      {
        "code": "500100",
        "name": "全市范围",
        "center": [
          106.5516,
          29.563
        ],
        "children": [
          { "code": "500100_ALL", "name": "全市全域", "center": [106.5516, 29.563] },
          { "code": "500101", "name": "万州区", "center": [108.3802, 30.8078] },
          { "code": "500102", "name": "涪陵区", "center": [107.39, 29.7029] },
          { "code": "500103", "name": "渝中区", "center": [106.569, 29.5528] },
          { "code": "500104", "name": "大渡口区", "center": [106.4826, 29.4845] },
          { "code": "500105", "name": "江北区", "center": [106.5743, 29.6066] },
          { "code": "500106", "name": "沙坪坝区", "center": [106.457, 29.5411] },
          { "code": "500107", "name": "九龙坡区", "center": [106.511, 29.502] },
          { "code": "500108", "name": "南岸区", "center": [106.5635, 29.5238] },
          { "code": "500109", "name": "北碚区", "center": [106.4375, 29.8254] },
          { "code": "500110", "name": "綦江区", "center": [106.6514, 29.028] },
          { "code": "500111", "name": "大足区", "center": [105.7153, 29.7004] },
          { "code": "500112", "name": "渝北区", "center": [106.6307, 29.718] },
          { "code": "500113", "name": "巴南区", "center": [106.5401, 29.381] },
          { "code": "500114", "name": "黔江区", "center": [108.7709, 29.5332] },
          { "code": "500115", "name": "长寿区", "center": [107.0817, 29.8337] },
          { "code": "500116", "name": "江津区", "center": [106.2591, 29.2901] },
          { "code": "500117", "name": "合川区", "center": [106.2763, 29.9723] },
          { "code": "500118", "name": "永川区", "center": [105.927, 29.3559] },
          { "code": "500119", "name": "南川区", "center": [107.0989, 29.1578] },
          { "code": "500120", "name": "璧山区", "center": [106.2311, 29.5936] },
          { "code": "500151", "name": "铜梁区", "center": [105.8421, 29.8447] },
          { "code": "500152", "name": "潼南区", "center": [105.8401, 30.1912] },
          { "code": "500153", "name": "荣昌区", "center": [105.5944, 29.4048] },
          { "code": "500154", "name": "开州区", "center": [108.4133, 31.1607] },
          { "code": "500155", "name": "梁平区", "center": [107.8001, 30.6721] },
          { "code": "500156", "name": "武隆区", "center": [107.76, 29.3258] }
        ]
      },
      {
        "code": "500100_SHI",
        "name": "市辖区",
        "center": [106.5516, 29.563],
        "children": [
          { "code": "500100_SALL", "name": "全市全域", "center": [106.5516, 29.563] },
          { "code": "500101_S", "name": "万州区", "center": [108.3802, 30.8078] },
          { "code": "500102_S", "name": "涪陵区", "center": [107.39, 29.7029] },
          { "code": "500103_S", "name": "渝中区", "center": [106.569, 29.5528] },
          { "code": "500104_S", "name": "大渡口区", "center": [106.4826, 29.4845] },
          { "code": "500105_S", "name": "江北区", "center": [106.5743, 29.6066] },
          { "code": "500106_S", "name": "沙坪坝区", "center": [106.457, 29.5411] },
          { "code": "500107_S", "name": "九龙坡区", "center": [106.511, 29.502] },
          { "code": "500108_S", "name": "南岸区", "center": [106.5635, 29.5238] },
          { "code": "500109_S", "name": "北碚区", "center": [106.4375, 29.8254] },
          { "code": "500112_S", "name": "渝北区", "center": [106.6307, 29.718] },
          { "code": "500113_S", "name": "巴南区", "center": [106.5401, 29.381] }
        ]
      },
      {
        "code": "500100_CORE",
        "name": "主城九区 (核心区)",
        "center": [106.5516, 29.563],
        "children": [
          { "code": "500100_CALL", "name": "主城区全域", "center": [106.5516, 29.563] },
          { "code": "500103_C", "name": "渝中区", "center": [106.569, 29.5528] },
          { "code": "500105_C", "name": "江北区", "center": [106.5743, 29.6066] },
          { "code": "500108_C", "name": "南岸区", "center": [106.5635, 29.5238] },
          { "code": "500107_C", "name": "九龙坡区", "center": [106.511, 29.502] },
          { "code": "500106_C", "name": "沙坪坝区", "center": [106.457, 29.5411] },
          { "code": "500104_C", "name": "大渡口区", "center": [106.4826, 29.4845] },
          { "code": "500109_C", "name": "北碚区", "center": [106.4375, 29.8254] },
          { "code": "500112_C", "name": "渝北区", "center": [106.6307, 29.718] },
          { "code": "500113_C", "name": "巴南区", "center": [106.5401, 29.381] }
        ]
      },
      {
        "code": "500100_NE",
        "name": "渝东北三峡库区",
        "center": [108.3802, 30.8078],
        "children": [
          { "code": "500100_NEALL", "name": "库区全域", "center": [108.3802, 30.8078] },
          { "code": "500101_N", "name": "万州区", "center": [108.3802, 30.8078] },
          { "code": "500154_N", "name": "开州区", "center": [108.4133, 31.1607] },
          { "code": "500155_N", "name": "梁平区", "center": [107.8001, 30.6721] }
        ]
      },
      {
        "code": "500100_SE",
        "name": "渝东南武陵山区",
        "center": [108.7709, 29.5332],
        "children": [
          { "code": "500100_SEALL", "name": "渝东南全域", "center": [108.7709, 29.5332] },
          { "code": "500114_E", "name": "黔江区", "center": [108.7709, 29.5332] },
          { "code": "500156_E", "name": "武隆区", "center": [107.76, 29.3258] }
        ]
      },
      {
        "code": "500103_D", "name": "渝中区", "center": [106.569, 29.5528],
        "children": [
          { "code": "500103_0", "name": "渝中区全域", "center": [106.569, 29.5528] },
          { "code": "500103_1", "name": "解放碑/洪崖洞", "center": [106.5781, 29.5581] },
          { "code": "500103_2", "name": "大坪/时代天街", "center": [106.5181, 29.5421] }
        ]
      },
      {
        "code": "500105_D", "name": "江北区", "center": [106.5743, 29.6066],
        "children": [
          { "code": "500105_0", "name": "江北区全域", "center": [106.5743, 29.6066] },
          { "code": "500105_1", "name": "观音桥商圈", "center": [106.5312, 29.5781] },
          { "code": "500105_2", "name": "江北嘴CBD", "center": [106.5812, 29.5712] }
        ]
      },
      {
        "code": "500108_D", "name": "南岸区", "center": [106.5635, 29.5238],
        "children": [
          { "code": "500108_0", "name": "南岸区全域", "center": [106.5635, 29.5238] },
          { "code": "500108_1", "name": "南坪商圈", "center": [106.5681, 29.5281] },
          { "code": "500108_2", "name": "弹子石/老街", "center": [106.5912, 29.5581] }
        ]
      },
      {
        "code": "500107_D", "name": "九龙坡区", "center": [106.511, 29.502],
        "children": [
          { "code": "500107_0", "name": "九龙坡区全域", "center": [106.511, 29.502] },
          { "code": "500107_1", "name": "杨家坪/万象城", "center": [106.5181, 29.5081] }
        ]
      },
      {
        "code": "500106_D", "name": "沙坪坝区", "center": [106.457, 29.5411],
        "children": [
          { "code": "500106_0", "name": "沙坪坝区全域", "center": [106.457, 29.5411] },
          { "code": "500106_1", "name": "三峡广场/大学城", "center": [106.4581, 29.5481] }
        ]
      },
      {
        "code": "500112_D", "name": "渝北区", "center": [106.6307, 29.718],
        "children": [
          { "code": "500112_0", "name": "渝北区全域", "center": [106.6307, 29.718] },
          { "code": "500112_1", "name": "新牌坊/照母山", "center": [106.5281, 29.6181] },
          { "code": "500112_2", "name": "两路/江北机场", "center": [106.6381, 29.7181] }
        ]
      },
      {
        "code": "500101_D", "name": "万州区", "center": [108.3802, 30.8078],
        "children": [{ "code": "500101_0", "name": "万州区全域", "center": [108.3802, 30.8078] }]
      },
      {
        "code": "500102_D", "name": "涪陵区", "center": [107.39, 29.7029],
        "children": [{ "code": "500102_0", "name": "涪陵区全域", "center": [107.39, 29.7029] }]
      },
      {
        "code": "500104_D", "name": "大渡口区", "center": [106.4826, 29.4845],
        "children": [{ "code": "500104_0", "name": "大渡口区全域", "center": [106.4826, 29.4845] }]
      },
      {
        "code": "500109_D", "name": "北碚区", "center": [106.4375, 29.8254],
        "children": [{ "code": "500109_0", "name": "北碚区全域", "center": [106.4375, 29.8254] }]
      },
      {
        "code": "500110_D", "name": "綦江区", "center": [106.6514, 29.028],
        "children": [{ "code": "500110_0", "name": "綦江区全域", "center": [106.6514, 29.028] }]
      },
      {
        "code": "500111_D", "name": "大足区", "center": [105.7153, 29.7004],
        "children": [{ "code": "500111_0", "name": "大足区全域", "center": [105.7153, 29.7004] }]
      },
      {
        "code": "500113_D", "name": "巴南区", "center": [106.5401, 29.381],
        "children": [{ "code": "500113_0", "name": "巴南区全域", "center": [106.5401, 29.381] }]
      },
      {
        "code": "500114_D", "name": "黔江区", "center": [108.7709, 29.5332],
        "children": [{ "code": "500114_0", "name": "黔江区全域", "center": [108.7709, 29.5332] }]
      },
      {
        "code": "500115_D", "name": "长寿区", "center": [107.0817, 29.8337],
        "children": [{ "code": "500115_0", "name": "长寿区全域", "center": [107.0817, 29.8337] }]
      },
      {
        "code": "500116_D", "name": "江津区", "center": [106.2591, 29.2901],
        "children": [{ "code": "500116_0", "name": "江津区全域", "center": [106.2591, 29.2901] }]
      },
      {
        "code": "500117_D", "name": "合川区", "center": [106.2763, 29.9723],
        "children": [{ "code": "500117_0", "name": "合川区全域", "center": [106.2763, 29.9723] }]
      },
      {
        "code": "500118_D", "name": "永川区", "center": [105.927, 29.3559],
        "children": [{ "code": "500118_0", "name": "永川区全域", "center": [105.927, 29.3559] }]
      },
      {
        "code": "500119_D", "name": "南川区", "center": [107.0989, 29.1578],
        "children": [{ "code": "500119_0", "name": "南川区全域", "center": [107.0989, 29.1578] }]
      },
      {
        "code": "500120_D", "name": "璧山区", "center": [106.2311, 29.5936],
        "children": [{ "code": "500120_0", "name": "璧山区全域", "center": [106.2311, 29.5936] }]
      },
      {
        "code": "500151_D", "name": "铜梁区", "center": [105.8421, 29.8447],
        "children": [{ "code": "500151_0", "name": "铜梁区全域", "center": [105.8421, 29.8447] }]
      },
      {
        "code": "500152_D", "name": "潼南区", "center": [105.8401, 30.1912],
        "children": [{ "code": "500152_0", "name": "潼南区全域", "center": [105.8401, 30.1912] }]
      },
      {
        "code": "500153_D", "name": "荣昌区", "center": [105.5944, 29.4048],
        "children": [{ "code": "500153_0", "name": "荣昌区全域", "center": [105.5944, 29.4048] }]
      },
      {
        "code": "500154_D", "name": "开州区", "center": [108.4133, 31.1607],
        "children": [{ "code": "500154_0", "name": "开州区全域", "center": [108.4133, 31.1607] }]
      },
      {
        "code": "500155_D", "name": "梁平区", "center": [107.8001, 30.6721],
        "children": [{ "code": "500155_0", "name": "梁平区全域", "center": [107.8001, 30.6721] }]
      },
      {
        "code": "500156_D", "name": "武隆区", "center": [107.76, 29.3258],
        "children": [{ "code": "500156_0", "name": "武隆区全域", "center": [107.76, 29.3258] }]
      }
    ]
  },
  {
    "code": "130000",
    "name": "河北省",
    "center": [
      114.5025,
      38.0455
    ],
    "children": [
      {
        "code": "130000_ALL",
        "name": "全省范围",
        "center": [
          114.5025,
          38.0455
        ],
        "children": [
          {
            "code": "130000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              114.5025,
              38.0455
            ]
          }
        ]
      },
      {
        "code": "130100",
        "name": "石家庄市",
        "center": [
          114.5025,
          38.0455
        ],
        "children": [
          {
            "code": "130100_ALL",
            "name": "全区全域",
            "center": [
              114.5025,
              38.0455
            ]
          },
          {
            "code": "130100_1",
            "name": "长安区",
            "center": [
              114.5025,
              38.0455
            ]
          },
          {
            "code": "130100_2",
            "name": "桥西区",
            "center": [
              114.5025,
              38.0455
            ]
          },
          {
            "code": "130100_3",
            "name": "新华区",
            "center": [
              114.5025,
              38.0455
            ]
          },
          {
            "code": "130100_4",
            "name": "裕华区",
            "center": [
              114.5025,
              38.0455
            ]
          },
          {
            "code": "130100_5",
            "name": "井陉矿区",
            "center": [
              114.5025,
              38.0455
            ]
          },
          {
            "code": "130100_6",
            "name": "藁城区",
            "center": [
              114.5025,
              38.0455
            ]
          },
          {
            "code": "130100_7",
            "name": "鹿泉区",
            "center": [
              114.5025,
              38.0455
            ]
          },
          {
            "code": "130100_8",
            "name": "栾城区",
            "center": [
              114.5025,
              38.0455
            ]
          },
          {
            "code": "130100_9",
            "name": "井陉县",
            "center": [
              114.5025,
              38.0455
            ]
          },
          {
            "code": "130100_10",
            "name": "正定县",
            "center": [
              114.5025,
              38.0455
            ]
          },
          {
            "code": "130100_11",
            "name": "行唐县",
            "center": [
              114.5025,
              38.0455
            ]
          },
          {
            "code": "130100_12",
            "name": "灵寿县",
            "center": [
              114.5025,
              38.0455
            ]
          },
          {
            "code": "130100_13",
            "name": "高邑县",
            "center": [
              114.5025,
              38.0455
            ]
          },
          {
            "code": "130100_14",
            "name": "深泽县",
            "center": [
              114.5025,
              38.0455
            ]
          },
          {
            "code": "130100_15",
            "name": "赞皇县",
            "center": [
              114.5025,
              38.0455
            ]
          },
          {
            "code": "130100_16",
            "name": "无极县",
            "center": [
              114.5025,
              38.0455
            ]
          },
          {
            "code": "130100_17",
            "name": "平山县",
            "center": [
              114.5025,
              38.0455
            ]
          },
          {
            "code": "130100_18",
            "name": "元氏县",
            "center": [
              114.5025,
              38.0455
            ]
          },
          {
            "code": "130100_19",
            "name": "赵县",
            "center": [
              114.5025,
              38.0455
            ]
          },
          {
            "code": "130100_20",
            "name": "晋州市",
            "center": [
              114.5025,
              38.0455
            ]
          },
          {
            "code": "130100_21",
            "name": "新乐市",
            "center": [
              114.5025,
              38.0455
            ]
          }
        ]
      },
      {
        "code": "130200",
        "name": "唐山市",
        "center": [
          118.1802,
          39.6309
        ],
        "children": [
          {
            "code": "130200_ALL",
            "name": "全区全域",
            "center": [
              118.1802,
              39.6309
            ]
          },
          {
            "code": "130200_1",
            "name": "路南区",
            "center": [
              118.1802,
              39.6309
            ]
          },
          {
            "code": "130200_2",
            "name": "路北区",
            "center": [
              118.1802,
              39.6309
            ]
          },
          {
            "code": "130200_3",
            "name": "古冶区",
            "center": [
              118.1802,
              39.6309
            ]
          },
          {
            "code": "130200_4",
            "name": "开平区",
            "center": [
              118.1802,
              39.6309
            ]
          },
          {
            "code": "130200_5",
            "name": "丰南区",
            "center": [
              118.1802,
              39.6309
            ]
          },
          {
            "code": "130200_6",
            "name": "丰润区",
            "center": [
              118.1802,
              39.6309
            ]
          },
          {
            "code": "130200_7",
            "name": "曹妃甸区",
            "center": [
              118.1802,
              39.6309
            ]
          },
          {
            "code": "130200_8",
            "name": "滦州县",
            "center": [
              118.1802,
              39.6309
            ]
          },
          {
            "code": "130200_9",
            "name": "滦南县",
            "center": [
              118.1802,
              39.6309
            ]
          },
          {
            "code": "130200_10",
            "name": "乐亭县",
            "center": [
              118.1802,
              39.6309
            ]
          },
          {
            "code": "130200_11",
            "name": "迁西县",
            "center": [
              118.1802,
              39.6309
            ]
          },
          {
            "code": "130200_12",
            "name": "玉田县",
            "center": [
              118.1802,
              39.6309
            ]
          },
          {
            "code": "130200_13",
            "name": "遵化市",
            "center": [
              118.1802,
              39.6309
            ]
          },
          {
            "code": "130200_14",
            "name": "迁安市",
            "center": [
              118.1802,
              39.6309
            ]
          }
        ]
      },
      {
        "code": "130300",
        "name": "秦皇岛市",
        "center": [
          119.5865,
          39.9425
        ],
        "children": [
          {
            "code": "130300_ALL",
            "name": "全区全域",
            "center": [
              119.5865,
              39.9425
            ]
          },
          {
            "code": "130300_1",
            "name": "海港区",
            "center": [
              119.5865,
              39.9425
            ]
          },
          {
            "code": "130300_2",
            "name": "山海关区",
            "center": [
              119.5865,
              39.9425
            ]
          },
          {
            "code": "130300_3",
            "name": "北戴河区",
            "center": [
              119.5865,
              39.9425
            ]
          },
          {
            "code": "130300_4",
            "name": "抚宁区",
            "center": [
              119.5865,
              39.9425
            ]
          },
          {
            "code": "130300_5",
            "name": "青龙县",
            "center": [
              119.5865,
              39.9425
            ]
          },
          {
            "code": "130300_6",
            "name": "昌黎县",
            "center": [
              119.5865,
              39.9425
            ]
          },
          {
            "code": "130300_7",
            "name": "卢龙县",
            "center": [
              119.5865,
              39.9425
            ]
          }
        ]
      },
      {
        "code": "130400",
        "name": "邯郸市",
        "center": [
          114.4906,
          36.6123
        ],
        "children": [
          {
            "code": "130400_ALL",
            "name": "全区全域",
            "center": [
              114.4906,
              36.6123
            ]
          },
          {
            "code": "130400_1",
            "name": "邯山区",
            "center": [
              114.4906,
              36.6123
            ]
          },
          {
            "code": "130400_2",
            "name": "丛台区",
            "center": [
              114.4906,
              36.6123
            ]
          },
          {
            "code": "130400_3",
            "name": "复兴区",
            "center": [
              114.4906,
              36.6123
            ]
          },
          {
            "code": "130400_4",
            "name": "峰峰矿区",
            "center": [
              114.4906,
              36.6123
            ]
          },
          {
            "code": "130400_5",
            "name": "肥乡区",
            "center": [
              114.4906,
              36.6123
            ]
          },
          {
            "code": "130400_6",
            "name": "永年区",
            "center": [
              114.4906,
              36.6123
            ]
          },
          {
            "code": "130400_7",
            "name": "临漳县",
            "center": [
              114.4906,
              36.6123
            ]
          },
          {
            "code": "130400_8",
            "name": "成安县",
            "center": [
              114.4906,
              36.6123
            ]
          },
          {
            "code": "130400_9",
            "name": "大名县",
            "center": [
              114.4906,
              36.6123
            ]
          },
          {
            "code": "130400_10",
            "name": "涉县",
            "center": [
              114.4906,
              36.6123
            ]
          },
          {
            "code": "130400_11",
            "name": "磁县",
            "center": [
              114.4906,
              36.6123
            ]
          },
          {
            "code": "130400_12",
            "name": "邱县",
            "center": [
              114.4906,
              36.6123
            ]
          },
          {
            "code": "130400_13",
            "name": "鸡泽县",
            "center": [
              114.4906,
              36.6123
            ]
          },
          {
            "code": "130400_14",
            "name": "广平县",
            "center": [
              114.4906,
              36.6123
            ]
          },
          {
            "code": "130400_15",
            "name": "馆陶县",
            "center": [
              114.4906,
              36.6123
            ]
          },
          {
            "code": "130400_16",
            "name": "魏县",
            "center": [
              114.4906,
              36.6123
            ]
          },
          {
            "code": "130400_17",
            "name": "武安市",
            "center": [
              114.4906,
              36.6123
            ]
          }
        ]
      },
      {
        "code": "130500",
        "name": "邢台市",
        "center": [
          114.5088,
          37.0682
        ],
        "children": [
          {
            "code": "130500_ALL",
            "name": "全区全域",
            "center": [
              114.5088,
              37.0682
            ]
          },
          {
            "code": "130500_1",
            "name": "襄都区",
            "center": [
              114.5088,
              37.0682
            ]
          },
          {
            "code": "130500_2",
            "name": "信都区",
            "center": [
              114.5088,
              37.0682
            ]
          },
          {
            "code": "130500_3",
            "name": "任泽区",
            "center": [
              114.5088,
              37.0682
            ]
          },
          {
            "code": "130500_4",
            "name": "南和区",
            "center": [
              114.5088,
              37.0682
            ]
          },
          {
            "code": "130500_5",
            "name": "内丘县",
            "center": [
              114.5088,
              37.0682
            ]
          },
          {
            "code": "130500_6",
            "name": "临城县",
            "center": [
              114.5088,
              37.0682
            ]
          },
          {
            "code": "130500_7",
            "name": "隆尧县",
            "center": [
              114.5088,
              37.0682
            ]
          },
          {
            "code": "130500_8",
            "name": "柏乡县",
            "center": [
              114.5088,
              37.0682
            ]
          },
          {
            "code": "130500_9",
            "name": "宁晋县",
            "center": [
              114.5088,
              37.0682
            ]
          },
          {
            "code": "130500_10",
            "name": "巨鹿县",
            "center": [
              114.5088,
              37.0682
            ]
          },
          {
            "code": "130500_11",
            "name": "新河县",
            "center": [
              114.5088,
              37.0682
            ]
          },
          {
            "code": "130500_12",
            "name": "广宗县",
            "center": [
              114.5088,
              37.0682
            ]
          },
          {
            "code": "130500_13",
            "name": "平乡县",
            "center": [
              114.5088,
              37.0682
            ]
          },
          {
            "code": "130500_14",
            "name": "威县",
            "center": [
              114.5088,
              37.0682
            ]
          },
          {
            "code": "130500_15",
            "name": "清河县",
            "center": [
              114.5088,
              37.0682
            ]
          },
          {
            "code": "130500_16",
            "name": "临西县",
            "center": [
              114.5088,
              37.0682
            ]
          },
          {
            "code": "130500_17",
            "name": "南宫市",
            "center": [
              114.5088,
              37.0682
            ]
          },
          {
            "code": "130500_18",
            "name": "沙河市",
            "center": [
              114.5088,
              37.0682
            ]
          }
        ]
      },
      {
        "code": "130600",
        "name": "保定市",
        "center": [
          115.4821,
          38.8677
        ],
        "children": [
          {
            "code": "130600_ALL",
            "name": "全区全域",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_1",
            "name": "竞秀区",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_2",
            "name": "莲池区",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_3",
            "name": "满城区",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_4",
            "name": "清苑区",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_5",
            "name": "徐水区",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_6",
            "name": "涞水县",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_7",
            "name": "阜平县",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_8",
            "name": "定兴县",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_9",
            "name": "唐县",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_10",
            "name": "高阳县",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_11",
            "name": "容城县",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_12",
            "name": "涞源县",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_13",
            "name": "望都县",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_14",
            "name": "安新县",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_15",
            "name": "易县",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_16",
            "name": "曲阳县",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_17",
            "name": "蠡县",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_18",
            "name": "顺平县",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_19",
            "name": "博野县",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_20",
            "name": "雄县",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_21",
            "name": "涿州市",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_22",
            "name": "定州市",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_23",
            "name": "安国市",
            "center": [
              115.4821,
              38.8677
            ]
          },
          {
            "code": "130600_24",
            "name": "高碑店市",
            "center": [
              115.4821,
              38.8677
            ]
          }
        ]
      },
      {
        "code": "130700",
        "name": "张家口市",
        "center": [
          114.8841,
          40.8119
        ],
        "children": [
          {
            "code": "130700_ALL",
            "name": "全区全域",
            "center": [
              114.8841,
              40.8119
            ]
          },
          {
            "code": "130700_1",
            "name": "桥东区",
            "center": [
              114.8841,
              40.8119
            ]
          },
          {
            "code": "130700_2",
            "name": "桥西区",
            "center": [
              114.8841,
              40.8119
            ]
          },
          {
            "code": "130700_3",
            "name": "宣化区",
            "center": [
              114.8841,
              40.8119
            ]
          },
          {
            "code": "130700_4",
            "name": "下花园区",
            "center": [
              114.8841,
              40.8119
            ]
          },
          {
            "code": "130700_5",
            "name": "万全区",
            "center": [
              114.8841,
              40.8119
            ]
          },
          {
            "code": "130700_6",
            "name": "崇礼区",
            "center": [
              114.8841,
              40.8119
            ]
          },
          {
            "code": "130700_7",
            "name": "张北县",
            "center": [
              114.8841,
              40.8119
            ]
          },
          {
            "code": "130700_8",
            "name": "康保县",
            "center": [
              114.8841,
              40.8119
            ]
          },
          {
            "code": "130700_9",
            "name": "沽源县",
            "center": [
              114.8841,
              40.8119
            ]
          },
          {
            "code": "130700_10",
            "name": "尚义县",
            "center": [
              114.8841,
              40.8119
            ]
          },
          {
            "code": "130700_11",
            "name": "蔚县",
            "center": [
              114.8841,
              40.8119
            ]
          },
          {
            "code": "130700_12",
            "name": "阳原县",
            "center": [
              114.8841,
              40.8119
            ]
          },
          {
            "code": "130700_13",
            "name": "怀安县",
            "center": [
              114.8841,
              40.8119
            ]
          },
          {
            "code": "130700_14",
            "name": "怀来县",
            "center": [
              114.8841,
              40.8119
            ]
          },
          {
            "code": "130700_15",
            "name": "涿鹿县",
            "center": [
              114.8841,
              40.8119
            ]
          },
          {
            "code": "130700_16",
            "name": "赤城县",
            "center": [
              114.8841,
              40.8119
            ]
          }
        ]
      },
      {
        "code": "130800",
        "name": "承德市",
        "center": [
          117.9392,
          40.9762
        ],
        "children": [
          {
            "code": "130800_ALL",
            "name": "全区全域",
            "center": [
              117.9392,
              40.9762
            ]
          },
          {
            "code": "130800_1",
            "name": "双桥区",
            "center": [
              117.9392,
              40.9762
            ]
          },
          {
            "code": "130800_2",
            "name": "双滦区",
            "center": [
              117.9392,
              40.9762
            ]
          },
          {
            "code": "130800_3",
            "name": "鹰手营子矿区",
            "center": [
              117.9392,
              40.9762
            ]
          },
          {
            "code": "130800_4",
            "name": "承德县",
            "center": [
              117.9392,
              40.9762
            ]
          },
          {
            "code": "130800_5",
            "name": "兴隆县",
            "center": [
              117.9392,
              40.9762
            ]
          },
          {
            "code": "130800_6",
            "name": "平泉市",
            "center": [
              117.9392,
              40.9762
            ]
          },
          {
            "code": "130800_7",
            "name": "滦平县",
            "center": [
              117.9392,
              40.9762
            ]
          },
          {
            "code": "130800_8",
            "name": "隆化县",
            "center": [
              117.9392,
              40.9762
            ]
          },
          {
            "code": "130800_9",
            "name": "丰宁县",
            "center": [
              117.9392,
              40.9762
            ]
          },
          {
            "code": "130800_10",
            "name": "宽城县",
            "center": [
              117.9392,
              40.9762
            ]
          },
          {
            "code": "130800_11",
            "name": "围场县",
            "center": [
              117.9392,
              40.9762
            ]
          }
        ]
      },
      {
        "code": "130900",
        "name": "沧州市",
        "center": [
          116.8575,
          38.3106
        ],
        "children": [
          {
            "code": "130900_ALL",
            "name": "全区全域",
            "center": [
              116.8575,
              38.3106
            ]
          },
          {
            "code": "130900_1",
            "name": "运河区",
            "center": [
              116.8575,
              38.3106
            ]
          },
          {
            "code": "130900_2",
            "name": "新华区",
            "center": [
              116.8575,
              38.3106
            ]
          },
          {
            "code": "130900_3",
            "name": "沧县",
            "center": [
              116.8575,
              38.3106
            ]
          },
          {
            "code": "130900_4",
            "name": "青县",
            "center": [
              116.8575,
              38.3106
            ]
          },
          {
            "code": "130900_5",
            "name": "东光县",
            "center": [
              116.8575,
              38.3106
            ]
          },
          {
            "code": "130900_6",
            "name": "海兴县",
            "center": [
              116.8575,
              38.3106
            ]
          },
          {
            "code": "130900_7",
            "name": "盐山县",
            "center": [
              116.8575,
              38.3106
            ]
          },
          {
            "code": "130900_8",
            "name": "肃宁县",
            "center": [
              116.8575,
              38.3106
            ]
          },
          {
            "code": "130900_9",
            "name": "南皮县",
            "center": [
              116.8575,
              38.3106
            ]
          },
          {
            "code": "130900_10",
            "name": "吴桥县",
            "center": [
              116.8575,
              38.3106
            ]
          },
          {
            "code": "130900_11",
            "name": "献县",
            "center": [
              116.8575,
              38.3106
            ]
          },
          {
            "code": "130900_12",
            "name": "孟村县",
            "center": [
              116.8575,
              38.3106
            ]
          },
          {
            "code": "130900_13",
            "name": "泊头市",
            "center": [
              116.8575,
              38.3106
            ]
          },
          {
            "code": "130900_14",
            "name": "任丘市",
            "center": [
              116.8575,
              38.3106
            ]
          },
          {
            "code": "130900_15",
            "name": "黄骅市",
            "center": [
              116.8575,
              38.3106
            ]
          },
          {
            "code": "130900_16",
            "name": "河间市",
            "center": [
              116.8575,
              38.3106
            ]
          }
        ]
      },
      {
        "code": "131000",
        "name": "廊坊市",
        "center": [
          116.7042,
          39.5239
        ],
        "children": [
          {
            "code": "131000_ALL",
            "name": "全区全域",
            "center": [
              116.7042,
              39.5239
            ]
          },
          {
            "code": "131000_1",
            "name": "安次区",
            "center": [
              116.7042,
              39.5239
            ]
          },
          {
            "code": "131000_2",
            "name": "广阳区",
            "center": [
              116.7042,
              39.5239
            ]
          },
          {
            "code": "131000_3",
            "name": "固安县",
            "center": [
              116.7042,
              39.5239
            ]
          },
          {
            "code": "131000_4",
            "name": "永清县",
            "center": [
              116.7042,
              39.5239
            ]
          },
          {
            "code": "131000_5",
            "name": "香河县",
            "center": [
              116.7042,
              39.5239
            ]
          },
          {
            "code": "131000_6",
            "name": "大厂县",
            "center": [
              116.7042,
              39.5239
            ]
          },
          {
            "code": "131000_7",
            "name": "文安县",
            "center": [
              116.7042,
              39.5239
            ]
          },
          {
            "code": "131000_8",
            "name": "大城县",
            "center": [
              116.7042,
              39.5239
            ]
          },
          {
            "code": "131000_9",
            "name": "三河市",
            "center": [
              116.7042,
              39.5239
            ]
          },
          {
            "code": "131000_10",
            "name": "霸州市",
            "center": [
              116.7042,
              39.5239
            ]
          }
        ]
      },
      {
        "code": "131100",
        "name": "衡水市",
        "center": [
          115.6659,
          37.7351
        ],
        "children": [
          {
            "code": "131100_ALL",
            "name": "全区全域",
            "center": [
              115.6659,
              37.7351
            ]
          },
          {
            "code": "131100_1",
            "name": "桃城区",
            "center": [
              115.6659,
              37.7351
            ]
          },
          {
            "code": "131100_2",
            "name": "冀州区",
            "center": [
              115.6659,
              37.7351
            ]
          },
          {
            "code": "131100_3",
            "name": "枣强县",
            "center": [
              115.6659,
              37.7351
            ]
          },
          {
            "code": "131100_4",
            "name": "武邑县",
            "center": [
              115.6659,
              37.7351
            ]
          },
          {
            "code": "131100_5",
            "name": "武强县",
            "center": [
              115.6659,
              37.7351
            ]
          },
          {
            "code": "131100_6",
            "name": "饶阳县",
            "center": [
              115.6659,
              37.7351
            ]
          },
          {
            "code": "131100_7",
            "name": "安平县",
            "center": [
              115.6659,
              37.7351
            ]
          },
          {
            "code": "131100_8",
            "name": "故城县",
            "center": [
              115.6659,
              37.7351
            ]
          },
          {
            "code": "131100_9",
            "name": "景县",
            "center": [
              115.6659,
              37.7351
            ]
          },
          {
            "code": "131100_10",
            "name": "阜城县",
            "center": [
              115.6659,
              37.7351
            ]
          },
          {
            "code": "131100_11",
            "name": "深州市",
            "center": [
              115.6659,
              37.7351
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "140000",
    "name": "山西省",
    "center": [
      112.5489,
      37.8706
    ],
    "children": [
      {
        "code": "140000_ALL",
        "name": "全省范围",
        "center": [
          112.5489,
          37.8706
        ],
        "children": [
          {
            "code": "140000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              112.5489,
              37.8706
            ]
          }
        ]
      },
      {
        "code": "140100",
        "name": "太原市",
        "center": [
          112.5489,
          37.8706
        ],
        "children": [
          {
            "code": "140100_ALL",
            "name": "全区全域",
            "center": [
              112.5489,
              37.8706
            ]
          },
          {
            "code": "140100_1",
            "name": "小店区",
            "center": [
              112.5489,
              37.8706
            ]
          },
          {
            "code": "140100_2",
            "name": "迎泽区",
            "center": [
              112.5489,
              37.8706
            ]
          },
          {
            "code": "140100_3",
            "name": "杏花岭区",
            "center": [
              112.5489,
              37.8706
            ]
          },
          {
            "code": "140100_4",
            "name": "尖草坪区",
            "center": [
              112.5489,
              37.8706
            ]
          },
          {
            "code": "140100_5",
            "name": "万柏林区",
            "center": [
              112.5489,
              37.8706
            ]
          },
          {
            "code": "140100_6",
            "name": "晋源区",
            "center": [
              112.5489,
              37.8706
            ]
          },
          {
            "code": "140100_7",
            "name": "清徐县",
            "center": [
              112.5489,
              37.8706
            ]
          },
          {
            "code": "140100_8",
            "name": "阳曲县",
            "center": [
              112.5489,
              37.8706
            ]
          },
          {
            "code": "140100_9",
            "name": "娄烦县",
            "center": [
              112.5489,
              37.8706
            ]
          },
          {
            "code": "140100_10",
            "name": "古交市",
            "center": [
              112.5489,
              37.8706
            ]
          }
        ]
      },
      {
        "code": "140200",
        "name": "大同市",
        "center": [
          113.2953,
          40.0903
        ],
        "children": [
          {
            "code": "140200_ALL",
            "name": "全区全域",
            "center": [
              113.2953,
              40.0903
            ]
          },
          {
            "code": "140200_1",
            "name": "新荣区",
            "center": [
              113.2953,
              40.0903
            ]
          },
          {
            "code": "140200_2",
            "name": "平城区",
            "center": [
              113.2953,
              40.0903
            ]
          },
          {
            "code": "140200_3",
            "name": "云冈区",
            "center": [
              113.2953,
              40.0903
            ]
          },
          {
            "code": "140200_4",
            "name": "云州区",
            "center": [
              113.2953,
              40.0903
            ]
          },
          {
            "code": "140200_5",
            "name": "阳高县",
            "center": [
              113.2953,
              40.0903
            ]
          },
          {
            "code": "140200_6",
            "name": "天镇县",
            "center": [
              113.2953,
              40.0903
            ]
          },
          {
            "code": "140200_7",
            "name": "广灵县",
            "center": [
              113.2953,
              40.0903
            ]
          },
          {
            "code": "140200_8",
            "name": "灵丘县",
            "center": [
              113.2953,
              40.0903
            ]
          },
          {
            "code": "140200_9",
            "name": "浑源县",
            "center": [
              113.2953,
              40.0903
            ]
          },
          {
            "code": "140200_10",
            "name": "左云县",
            "center": [
              113.2953,
              40.0903
            ]
          }
        ]
      },
      {
        "code": "140300",
        "name": "阳泉市",
        "center": [
          113.5833,
          37.8611
        ],
        "children": [
          {
            "code": "140300_ALL",
            "name": "全区全域",
            "center": [
              113.5833,
              37.8611
            ]
          },
          {
            "code": "140300_1",
            "name": "城区",
            "center": [
              113.5833,
              37.8611
            ]
          },
          {
            "code": "140300_2",
            "name": "矿区",
            "center": [
              113.5833,
              37.8611
            ]
          },
          {
            "code": "140300_3",
            "name": "郊区",
            "center": [
              113.5833,
              37.8611
            ]
          },
          {
            "code": "140300_4",
            "name": "平定县",
            "center": [
              113.5833,
              37.8611
            ]
          },
          {
            "code": "140300_5",
            "name": "盂县",
            "center": [
              113.5833,
              37.8611
            ]
          }
        ]
      },
      {
        "code": "140400",
        "name": "长治市",
        "center": [
          113.1136,
          36.1911
        ],
        "children": [
          {
            "code": "140400_ALL",
            "name": "全区全域",
            "center": [
              113.1136,
              36.1911
            ]
          },
          {
            "code": "140400_1",
            "name": "潞州区",
            "center": [
              113.1136,
              36.1911
            ]
          },
          {
            "code": "140400_2",
            "name": "上党区",
            "center": [
              113.1136,
              36.1911
            ]
          },
          {
            "code": "140400_3",
            "name": "屯留区",
            "center": [
              113.1136,
              36.1911
            ]
          },
          {
            "code": "140400_4",
            "name": "潞城区",
            "center": [
              113.1136,
              36.1911
            ]
          },
          {
            "code": "140400_5",
            "name": "襄垣县",
            "center": [
              113.1136,
              36.1911
            ]
          },
          {
            "code": "140400_6",
            "name": "平顺县",
            "center": [
              113.1136,
              36.1911
            ]
          },
          {
            "code": "140400_7",
            "name": "黎城县",
            "center": [
              113.1136,
              36.1911
            ]
          },
          {
            "code": "140400_8",
            "name": "壶关县",
            "center": [
              113.1136,
              36.1911
            ]
          },
          {
            "code": "140400_9",
            "name": "长子县",
            "center": [
              113.1136,
              36.1911
            ]
          },
          {
            "code": "140400_10",
            "name": "武乡县",
            "center": [
              113.1136,
              36.1911
            ]
          },
          {
            "code": "140400_11",
            "name": "沁县",
            "center": [
              113.1136,
              36.1911
            ]
          },
          {
            "code": "140400_12",
            "name": "沁源县",
            "center": [
              113.1136,
              36.1911
            ]
          }
        ]
      },
      {
        "code": "140500",
        "name": "晋城市",
        "center": [
          112.8513,
          35.4976
        ],
        "children": [
          {
            "code": "140500_ALL",
            "name": "全区全域",
            "center": [
              112.8513,
              35.4976
            ]
          },
          {
            "code": "140500_1",
            "name": "城区",
            "center": [
              112.8513,
              35.4976
            ]
          },
          {
            "code": "140500_2",
            "name": "沁水县",
            "center": [
              112.8513,
              35.4976
            ]
          },
          {
            "code": "140500_3",
            "name": "阳城县",
            "center": [
              112.8513,
              35.4976
            ]
          },
          {
            "code": "140500_4",
            "name": "陵川县",
            "center": [
              112.8513,
              35.4976
            ]
          },
          {
            "code": "140500_5",
            "name": "泽州县",
            "center": [
              112.8513,
              35.4976
            ]
          },
          {
            "code": "140500_6",
            "name": "高平市",
            "center": [
              112.8513,
              35.4976
            ]
          }
        ]
      },
      {
        "code": "140600",
        "name": "朔州市",
        "center": [
          112.4334,
          39.3312
        ],
        "children": [
          {
            "code": "140600_ALL",
            "name": "全区全域",
            "center": [
              112.4334,
              39.3312
            ]
          },
          {
            "code": "140600_1",
            "name": "朔城区",
            "center": [
              112.4334,
              39.3312
            ]
          },
          {
            "code": "140600_2",
            "name": "平鲁区",
            "center": [
              112.4334,
              39.3312
            ]
          },
          {
            "code": "140600_3",
            "name": "山阴县",
            "center": [
              112.4334,
              39.3312
            ]
          },
          {
            "code": "140600_4",
            "name": "应县",
            "center": [
              112.4334,
              39.3312
            ]
          },
          {
            "code": "140600_5",
            "name": "右玉县",
            "center": [
              112.4334,
              39.3312
            ]
          },
          {
            "code": "140600_6",
            "name": "怀仁市",
            "center": [
              112.4334,
              39.3312
            ]
          }
        ]
      },
      {
        "code": "140700",
        "name": "晋中市",
        "center": [
          112.7364,
          37.687
        ],
        "children": [
          {
            "code": "140700_ALL",
            "name": "全区全域",
            "center": [
              112.7364,
              37.687
            ]
          },
          {
            "code": "140700_1",
            "name": "榆次区",
            "center": [
              112.7364,
              37.687
            ]
          },
          {
            "code": "140700_2",
            "name": "太谷区",
            "center": [
              112.7364,
              37.687
            ]
          },
          {
            "code": "140700_3",
            "name": "祁县",
            "center": [
              112.7364,
              37.687
            ]
          },
          {
            "code": "140700_4",
            "name": "平遥县",
            "center": [
              112.7364,
              37.687
            ]
          },
          {
            "code": "140700_5",
            "name": "灵石县",
            "center": [
              112.7364,
              37.687
            ]
          },
          {
            "code": "140700_6",
            "name": "寿阳县",
            "center": [
              112.7364,
              37.687
            ]
          },
          {
            "code": "140700_7",
            "name": "昔阳县",
            "center": [
              112.7364,
              37.687
            ]
          },
          {
            "code": "140700_8",
            "name": "和顺县",
            "center": [
              112.7364,
              37.687
            ]
          },
          {
            "code": "140700_9",
            "name": "左权县",
            "center": [
              112.7364,
              37.687
            ]
          },
          {
            "code": "140700_10",
            "name": "榆社县",
            "center": [
              112.7364,
              37.687
            ]
          },
          {
            "code": "140700_11",
            "name": "介休市",
            "center": [
              112.7364,
              37.687
            ]
          }
        ]
      },
      {
        "code": "140800",
        "name": "运城市",
        "center": [
          111.004,
          35.0228
        ],
        "children": [
          {
            "code": "140800_ALL",
            "name": "全区全域",
            "center": [
              111.004,
              35.0228
            ]
          },
          {
            "code": "140800_1",
            "name": "盐湖区",
            "center": [
              111.004,
              35.0228
            ]
          },
          {
            "code": "140800_2",
            "name": "临猗县",
            "center": [
              111.004,
              35.0228
            ]
          },
          {
            "code": "140800_3",
            "name": "万荣县",
            "center": [
              111.004,
              35.0228
            ]
          },
          {
            "code": "140800_4",
            "name": "闻喜县",
            "center": [
              111.004,
              35.0228
            ]
          },
          {
            "code": "140800_5",
            "name": "稷山县",
            "center": [
              111.004,
              35.0228
            ]
          },
          {
            "code": "140800_6",
            "name": "新绛县",
            "center": [
              111.004,
              35.0228
            ]
          },
          {
            "code": "140800_7",
            "name": "绛县",
            "center": [
              111.004,
              35.0228
            ]
          },
          {
            "code": "140800_8",
            "name": "垣曲县",
            "center": [
              111.004,
              35.0228
            ]
          },
          {
            "code": "140800_9",
            "name": "夏县",
            "center": [
              111.004,
              35.0228
            ]
          },
          {
            "code": "140800_10",
            "name": "平陆县",
            "center": [
              111.004,
              35.0228
            ]
          },
          {
            "code": "140800_11",
            "name": "芮城县",
            "center": [
              111.004,
              35.0228
            ]
          },
          {
            "code": "140800_12",
            "name": "永济市",
            "center": [
              111.004,
              35.0228
            ]
          },
          {
            "code": "140800_13",
            "name": "河津市",
            "center": [
              111.004,
              35.0228
            ]
          }
        ]
      },
      {
        "code": "140900",
        "name": "忻州市",
        "center": [
          112.7335,
          38.4167
        ],
        "children": [
          {
            "code": "140900_ALL",
            "name": "全区全域",
            "center": [
              112.7335,
              38.4167
            ]
          },
          {
            "code": "140900_1",
            "name": "忻府区",
            "center": [
              112.7335,
              38.4167
            ]
          },
          {
            "code": "140900_2",
            "name": "定襄县",
            "center": [
              112.7335,
              38.4167
            ]
          },
          {
            "code": "140900_3",
            "name": "五台县",
            "center": [
              112.7335,
              38.4167
            ]
          },
          {
            "code": "140900_4",
            "name": "代县",
            "center": [
              112.7335,
              38.4167
            ]
          },
          {
            "code": "140900_5",
            "name": "繁峙县",
            "center": [
              112.7335,
              38.4167
            ]
          },
          {
            "code": "140900_6",
            "name": "宁武县",
            "center": [
              112.7335,
              38.4167
            ]
          },
          {
            "code": "140900_7",
            "name": "静乐县",
            "center": [
              112.7335,
              38.4167
            ]
          },
          {
            "code": "140900_8",
            "name": "神池县",
            "center": [
              112.7335,
              38.4167
            ]
          },
          {
            "code": "140900_9",
            "name": "五寨县",
            "center": [
              112.7335,
              38.4167
            ]
          },
          {
            "code": "140900_10",
            "name": "岢岚县",
            "center": [
              112.7335,
              38.4167
            ]
          },
          {
            "code": "140900_11",
            "name": "河曲县",
            "center": [
              112.7335,
              38.4167
            ]
          },
          {
            "code": "140900_12",
            "name": "保德县",
            "center": [
              112.7335,
              38.4167
            ]
          },
          {
            "code": "140900_13",
            "name": "偏关县",
            "center": [
              112.7335,
              38.4167
            ]
          },
          {
            "code": "140900_14",
            "name": "原平市",
            "center": [
              112.7335,
              38.4167
            ]
          }
        ]
      },
      {
        "code": "141000",
        "name": "临汾市",
        "center": [
          111.5179,
          36.0841
        ],
        "children": [
          {
            "code": "141000_ALL",
            "name": "全区全域",
            "center": [
              111.5179,
              36.0841
            ]
          },
          {
            "code": "141000_1",
            "name": "尧都区",
            "center": [
              111.5179,
              36.0841
            ]
          },
          {
            "code": "141000_2",
            "name": "曲沃县",
            "center": [
              111.5179,
              36.0841
            ]
          },
          {
            "code": "141000_3",
            "name": "翼城县",
            "center": [
              111.5179,
              36.0841
            ]
          },
          {
            "code": "141000_4",
            "name": "襄汾县",
            "center": [
              111.5179,
              36.0841
            ]
          },
          {
            "code": "141000_5",
            "name": "洪洞县",
            "center": [
              111.5179,
              36.0841
            ]
          },
          {
            "code": "141000_6",
            "name": "古县",
            "center": [
              111.5179,
              36.0841
            ]
          },
          {
            "code": "141000_7",
            "name": "安泽县",
            "center": [
              111.5179,
              36.0841
            ]
          },
          {
            "code": "141000_8",
            "name": "浮山县",
            "center": [
              111.5179,
              36.0841
            ]
          },
          {
            "code": "141000_9",
            "name": "吉县",
            "center": [
              111.5179,
              36.0841
            ]
          },
          {
            "code": "141000_10",
            "name": "乡宁县",
            "center": [
              111.5179,
              36.0841
            ]
          },
          {
            "code": "141000_11",
            "name": "大宁县",
            "center": [
              111.5179,
              36.0841
            ]
          },
          {
            "code": "141000_12",
            "name": "隰县",
            "center": [
              111.5179,
              36.0841
            ]
          },
          {
            "code": "141000_13",
            "name": "永和县",
            "center": [
              111.5179,
              36.0841
            ]
          },
          {
            "code": "141000_14",
            "name": "蒲县",
            "center": [
              111.5179,
              36.0841
            ]
          },
          {
            "code": "141000_15",
            "name": "汾西县",
            "center": [
              111.5179,
              36.0841
            ]
          },
          {
            "code": "141000_16",
            "name": "侯马市",
            "center": [
              111.5179,
              36.0841
            ]
          },
          {
            "code": "141000_17",
            "name": "霍州市",
            "center": [
              111.5179,
              36.0841
            ]
          }
        ]
      },
      {
        "code": "141100",
        "name": "吕梁市",
        "center": [
          111.1343,
          37.5273
        ],
        "children": [
          {
            "code": "141100_ALL",
            "name": "全区全域",
            "center": [
              111.1343,
              37.5273
            ]
          },
          {
            "code": "141100_1",
            "name": "离石区",
            "center": [
              111.1343,
              37.5273
            ]
          },
          {
            "code": "141100_2",
            "name": "文水县",
            "center": [
              111.1343,
              37.5273
            ]
          },
          {
            "code": "141100_3",
            "name": "交城县",
            "center": [
              111.1343,
              37.5273
            ]
          },
          {
            "code": "141100_4",
            "name": "兴县",
            "center": [
              111.1343,
              37.5273
            ]
          },
          {
            "code": "141100_5",
            "name": "临县",
            "center": [
              111.1343,
              37.5273
            ]
          },
          {
            "code": "141100_6",
            "name": "柳林县",
            "center": [
              111.1343,
              37.5273
            ]
          },
          {
            "code": "141100_7",
            "name": "石楼县",
            "center": [
              111.1343,
              37.5273
            ]
          },
          {
            "code": "141100_8",
            "name": "岚县",
            "center": [
              111.1343,
              37.5273
            ]
          },
          {
            "code": "141100_9",
            "name": "方山县",
            "center": [
              111.1343,
              37.5273
            ]
          },
          {
            "code": "141100_10",
            "name": "中阳县",
            "center": [
              111.1343,
              37.5273
            ]
          },
          {
            "code": "141100_11",
            "name": "交口县",
            "center": [
              111.1343,
              37.5273
            ]
          },
          {
            "code": "141100_12",
            "name": "孝义市",
            "center": [
              111.1343,
              37.5273
            ]
          },
          {
            "code": "141100_13",
            "name": "汾阳市",
            "center": [
              111.1343,
              37.5273
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "150000",
    "name": "内蒙古自治区",
    "center": [
      111.6708,
      40.8183
    ],
    "children": [
      {
        "code": "150000_ALL",
        "name": "全省范围",
        "center": [
          111.6708,
          40.8183
        ],
        "children": [
          {
            "code": "150000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              111.6708,
              40.8183
            ]
          }
        ]
      },
      {
        "code": "150100",
        "name": "呼和浩特市",
        "center": [
          111.6708,
          40.8183
        ],
        "children": [
          {
            "code": "150100_ALL",
            "name": "全区全域",
            "center": [
              111.6708,
              40.8183
            ]
          },
          {
            "code": "150100_1",
            "name": "新城区",
            "center": [
              111.6708,
              40.8183
            ]
          },
          {
            "code": "150100_2",
            "name": "回民区",
            "center": [
              111.6708,
              40.8183
            ]
          },
          {
            "code": "150100_3",
            "name": "玉泉区",
            "center": [
              111.6708,
              40.8183
            ]
          },
          {
            "code": "150100_4",
            "name": "赛罕区",
            "center": [
              111.6708,
              40.8183
            ]
          },
          {
            "code": "150100_5",
            "name": "土默特左旗",
            "center": [
              111.6708,
              40.8183
            ]
          },
          {
            "code": "150100_6",
            "name": "托克托县",
            "center": [
              111.6708,
              40.8183
            ]
          },
          {
            "code": "150100_7",
            "name": "和林格尔县",
            "center": [
              111.6708,
              40.8183
            ]
          },
          {
            "code": "150100_8",
            "name": "清水河县",
            "center": [
              111.6708,
              40.8183
            ]
          },
          {
            "code": "150100_9",
            "name": "武川县",
            "center": [
              111.6708,
              40.8183
            ]
          }
        ]
      },
      {
        "code": "150200",
        "name": "包头市",
        "center": [
          109.8404,
          40.6582
        ],
        "children": [
          {
            "code": "150200_ALL",
            "name": "全区全域",
            "center": [
              109.8404,
              40.6582
            ]
          },
          {
            "code": "150200_1",
            "name": "东河区",
            "center": [
              109.8404,
              40.6582
            ]
          },
          {
            "code": "150200_2",
            "name": "昆都仑区",
            "center": [
              109.8404,
              40.6582
            ]
          },
          {
            "code": "150200_3",
            "name": "青山区",
            "center": [
              109.8404,
              40.6582
            ]
          },
          {
            "code": "150200_4",
            "name": "石拐区",
            "center": [
              109.8404,
              40.6582
            ]
          },
          {
            "code": "150200_5",
            "name": "白云鄂博矿区",
            "center": [
              109.8404,
              40.6582
            ]
          },
          {
            "code": "150200_6",
            "name": "九原区",
            "center": [
              109.8404,
              40.6582
            ]
          },
          {
            "code": "150200_7",
            "name": "土默特右旗",
            "center": [
              109.8404,
              40.6582
            ]
          },
          {
            "code": "150200_8",
            "name": "固阳县",
            "center": [
              109.8404,
              40.6582
            ]
          },
          {
            "code": "150200_9",
            "name": "达尔罕茂明安联合旗",
            "center": [
              109.8404,
              40.6582
            ]
          }
        ]
      },
      {
        "code": "150300",
        "name": "乌海市",
        "center": [
          106.8256,
          39.6737
        ],
        "children": [
          {
            "code": "150300_ALL",
            "name": "全区全域",
            "center": [
              106.8256,
              39.6737
            ]
          },
          {
            "code": "150300_1",
            "name": "海勃湾区",
            "center": [
              106.8256,
              39.6737
            ]
          },
          {
            "code": "150300_2",
            "name": "海南区",
            "center": [
              106.8256,
              39.6737
            ]
          },
          {
            "code": "150300_3",
            "name": "乌达区",
            "center": [
              106.8256,
              39.6737
            ]
          }
        ]
      },
      {
        "code": "150400",
        "name": "赤峰市",
        "center": [
          118.9568,
          42.2753
        ],
        "children": [
          {
            "code": "150400_ALL",
            "name": "全区全域",
            "center": [
              118.9568,
              42.2753
            ]
          },
          {
            "code": "150400_1",
            "name": "红山区",
            "center": [
              118.9568,
              42.2753
            ]
          },
          {
            "code": "150400_2",
            "name": "元宝山区",
            "center": [
              118.9568,
              42.2753
            ]
          },
          {
            "code": "150400_3",
            "name": "松山区",
            "center": [
              118.9568,
              42.2753
            ]
          },
          {
            "code": "150400_4",
            "name": "阿鲁科尔沁旗",
            "center": [
              118.9568,
              42.2753
            ]
          },
          {
            "code": "150400_5",
            "name": "巴林左旗",
            "center": [
              118.9568,
              42.2753
            ]
          },
          {
            "code": "150400_6",
            "name": "巴林右旗",
            "center": [
              118.9568,
              42.2753
            ]
          },
          {
            "code": "150400_7",
            "name": "林西县",
            "center": [
              118.9568,
              42.2753
            ]
          },
          {
            "code": "150400_8",
            "name": "克什克腾旗",
            "center": [
              118.9568,
              42.2753
            ]
          },
          {
            "code": "150400_9",
            "name": "翁牛特旗",
            "center": [
              118.9568,
              42.2753
            ]
          },
          {
            "code": "150400_10",
            "name": "喀喇沁旗",
            "center": [
              118.9568,
              42.2753
            ]
          },
          {
            "code": "150400_11",
            "name": "宁城县",
            "center": [
              118.9568,
              42.2753
            ]
          },
          {
            "code": "150400_12",
            "name": "敖汉旗",
            "center": [
              118.9568,
              42.2753
            ]
          }
        ]
      },
      {
        "code": "150500",
        "name": "通辽市",
        "center": [
          122.2631,
          43.6174
        ],
        "children": [
          {
            "code": "150500_ALL",
            "name": "全区全域",
            "center": [
              122.2631,
              43.6174
            ]
          },
          {
            "code": "150500_1",
            "name": "科尔沁区",
            "center": [
              122.2631,
              43.6174
            ]
          },
          {
            "code": "150500_2",
            "name": "科尔沁左翼中旗",
            "center": [
              122.2631,
              43.6174
            ]
          },
          {
            "code": "150500_3",
            "name": "科尔沁左翼后旗",
            "center": [
              122.2631,
              43.6174
            ]
          },
          {
            "code": "150500_4",
            "name": "开鲁县",
            "center": [
              122.2631,
              43.6174
            ]
          },
          {
            "code": "150500_5",
            "name": "库伦旗",
            "center": [
              122.2631,
              43.6174
            ]
          },
          {
            "code": "150500_6",
            "name": "奈曼旗",
            "center": [
              122.2631,
              43.6174
            ]
          },
          {
            "code": "150500_7",
            "name": "扎鲁特旗",
            "center": [
              122.2631,
              43.6174
            ]
          },
          {
            "code": "150500_8",
            "name": "霍林郭勒市",
            "center": [
              122.2631,
              43.6174
            ]
          }
        ]
      },
      {
        "code": "150600",
        "name": "鄂尔多斯市",
        "center": [
          109.9813,
          39.8172
        ],
        "children": [
          {
            "code": "150600_ALL",
            "name": "全区全域",
            "center": [
              109.9813,
              39.8172
            ]
          },
          {
            "code": "150600_1",
            "name": "东胜区",
            "center": [
              109.9813,
              39.8172
            ]
          },
          {
            "code": "150600_2",
            "name": "康巴什区",
            "center": [
              109.9813,
              39.8172
            ]
          },
          {
            "code": "150600_3",
            "name": "达拉特旗",
            "center": [
              109.9813,
              39.8172
            ]
          },
          {
            "code": "150600_4",
            "name": "准格尔旗",
            "center": [
              109.9813,
              39.8172
            ]
          },
          {
            "code": "150600_5",
            "name": "鄂托克前旗",
            "center": [
              109.9813,
              39.8172
            ]
          },
          {
            "code": "150600_6",
            "name": "鄂托克旗",
            "center": [
              109.9813,
              39.8172
            ]
          },
          {
            "code": "150600_7",
            "name": "杭锦旗",
            "center": [
              109.9813,
              39.8172
            ]
          },
          {
            "code": "150600_8",
            "name": "乌审旗",
            "center": [
              109.9813,
              39.8172
            ]
          },
          {
            "code": "150600_9",
            "name": "伊金霍洛旗",
            "center": [
              109.9813,
              39.8172
            ]
          }
        ]
      },
      {
        "code": "150700",
        "name": "呼伦贝尔市",
        "center": [
          119.7658,
          49.2116
        ],
        "children": [
          {
            "code": "150700_ALL",
            "name": "全区全域",
            "center": [
              119.7658,
              49.2116
            ]
          },
          {
            "code": "150700_1",
            "name": "海拉尔区",
            "center": [
              119.7658,
              49.2116
            ]
          },
          {
            "code": "150700_2",
            "name": "扎赉诺尔区",
            "center": [
              119.7658,
              49.2116
            ]
          },
          {
            "code": "150700_3",
            "name": "阿荣旗",
            "center": [
              119.7658,
              49.2116
            ]
          },
          {
            "code": "150700_4",
            "name": "莫力达瓦达斡尔族自治旗",
            "center": [
              119.7658,
              49.2116
            ]
          },
          {
            "code": "150700_5",
            "name": "鄂伦春自治旗",
            "center": [
              119.7658,
              49.2116
            ]
          },
          {
            "code": "150700_6",
            "name": "鄂温克族自治旗",
            "center": [
              119.7658,
              49.2116
            ]
          },
          {
            "code": "150700_7",
            "name": "陈巴尔虎旗",
            "center": [
              119.7658,
              49.2116
            ]
          },
          {
            "code": "150700_8",
            "name": "新巴尔虎左旗",
            "center": [
              119.7658,
              49.2116
            ]
          },
          {
            "code": "150700_9",
            "name": "新巴尔虎右旗",
            "center": [
              119.7658,
              49.2116
            ]
          },
          {
            "code": "150700_10",
            "name": "满洲里市",
            "center": [
              119.7658,
              49.2116
            ]
          },
          {
            "code": "150700_11",
            "name": "牙克石市",
            "center": [
              119.7658,
              49.2116
            ]
          },
          {
            "code": "150700_12",
            "name": "扎兰屯市",
            "center": [
              119.7658,
              49.2116
            ]
          },
          {
            "code": "150700_13",
            "name": "额尔古纳市",
            "center": [
              119.7658,
              49.2116
            ]
          },
          {
            "code": "150700_14",
            "name": "根河市",
            "center": [
              119.7658,
              49.2116
            ]
          }
        ]
      },
      {
        "code": "150800",
        "name": "巴彦淖尔市",
        "center": [
          107.4169,
          40.7574
        ],
        "children": [
          {
            "code": "150800_ALL",
            "name": "全区全域",
            "center": [
              107.4169,
              40.7574
            ]
          },
          {
            "code": "150800_1",
            "name": "临河区",
            "center": [
              107.4169,
              40.7574
            ]
          },
          {
            "code": "150800_2",
            "name": "五原县",
            "center": [
              107.4169,
              40.7574
            ]
          },
          {
            "code": "150800_3",
            "name": "磴口县",
            "center": [
              107.4169,
              40.7574
            ]
          },
          {
            "code": "150800_4",
            "name": "乌拉特前旗",
            "center": [
              107.4169,
              40.7574
            ]
          },
          {
            "code": "150800_5",
            "name": "乌拉特中旗",
            "center": [
              107.4169,
              40.7574
            ]
          },
          {
            "code": "150800_6",
            "name": "乌拉特后旗",
            "center": [
              107.4169,
              40.7574
            ]
          },
          {
            "code": "150800_7",
            "name": "杭锦后旗",
            "center": [
              107.4169,
              40.7574
            ]
          }
        ]
      },
      {
        "code": "150900",
        "name": "乌兰察布市",
        "center": [
          113.1145,
          41.0341
        ],
        "children": [
          {
            "code": "150900_ALL",
            "name": "全区全域",
            "center": [
              113.1145,
              41.0341
            ]
          },
          {
            "code": "150900_1",
            "name": "集宁区",
            "center": [
              113.1145,
              41.0341
            ]
          },
          {
            "code": "150900_2",
            "name": "卓资县",
            "center": [
              113.1145,
              41.0341
            ]
          },
          {
            "code": "150900_3",
            "name": "化德县",
            "center": [
              113.1145,
              41.0341
            ]
          },
          {
            "code": "150900_4",
            "name": "商都县",
            "center": [
              113.1145,
              41.0341
            ]
          },
          {
            "code": "150900_5",
            "name": "兴和县",
            "center": [
              113.1145,
              41.0341
            ]
          },
          {
            "code": "150900_6",
            "name": "凉城县",
            "center": [
              113.1145,
              41.0341
            ]
          },
          {
            "code": "150900_7",
            "name": "察哈尔右翼前旗",
            "center": [
              113.1145,
              41.0341
            ]
          },
          {
            "code": "150900_8",
            "name": "察哈尔右翼中旗",
            "center": [
              113.1145,
              41.0341
            ]
          },
          {
            "code": "150900_9",
            "name": "察哈尔右翼后旗",
            "center": [
              113.1145,
              41.0341
            ]
          },
          {
            "code": "150900_10",
            "name": "四子王旗",
            "center": [
              113.1145,
              41.0341
            ]
          },
          {
            "code": "150900_11",
            "name": "丰镇市",
            "center": [
              113.1145,
              41.0341
            ]
          }
        ]
      },
      {
        "code": "151000",
        "name": "兴安盟",
        "center": [
          122.0703,
          46.0763
        ],
        "children": [
          {
            "code": "151000_ALL",
            "name": "全区全域",
            "center": [
              122.0703,
              46.0763
            ]
          },
          {
            "code": "151000_1",
            "name": "乌兰浩特市",
            "center": [
              122.0703,
              46.0763
            ]
          },
          {
            "code": "151000_2",
            "name": "阿尔山市",
            "center": [
              122.0703,
              46.0763
            ]
          },
          {
            "code": "151000_3",
            "name": "科尔沁右翼前旗",
            "center": [
              122.0703,
              46.0763
            ]
          },
          {
            "code": "151000_4",
            "name": "科尔沁右翼中旗",
            "center": [
              122.0703,
              46.0763
            ]
          },
          {
            "code": "151000_5",
            "name": "扎赉特旗",
            "center": [
              122.0703,
              46.0763
            ]
          },
          {
            "code": "151000_6",
            "name": "突泉县",
            "center": [
              122.0703,
              46.0763
            ]
          }
        ]
      },
      {
        "code": "151100",
        "name": "锡林郭勒盟",
        "center": [
          116.0904,
          43.9334
        ],
        "children": [
          {
            "code": "151100_ALL",
            "name": "全区全域",
            "center": [
              116.0904,
              43.9334
            ]
          },
          {
            "code": "151100_1",
            "name": "二连浩特市",
            "center": [
              116.0904,
              43.9334
            ]
          },
          {
            "code": "151100_2",
            "name": "锡林浩特市",
            "center": [
              116.0904,
              43.9334
            ]
          },
          {
            "code": "151100_3",
            "name": "阿巴嘎旗",
            "center": [
              116.0904,
              43.9334
            ]
          },
          {
            "code": "151100_4",
            "name": "苏尼特左旗",
            "center": [
              116.0904,
              43.9334
            ]
          },
          {
            "code": "151100_5",
            "name": "苏尼特右旗",
            "center": [
              116.0904,
              43.9334
            ]
          },
          {
            "code": "151100_6",
            "name": "东乌珠穆沁旗",
            "center": [
              116.0904,
              43.9334
            ]
          },
          {
            "code": "151100_7",
            "name": "西乌珠穆沁旗",
            "center": [
              116.0904,
              43.9334
            ]
          },
          {
            "code": "151100_8",
            "name": "太仆寺旗",
            "center": [
              116.0904,
              43.9334
            ]
          },
          {
            "code": "151100_9",
            "name": "镶黄旗",
            "center": [
              116.0904,
              43.9334
            ]
          },
          {
            "code": "151100_10",
            "name": "正镶白旗",
            "center": [
              116.0904,
              43.9334
            ]
          },
          {
            "code": "151100_11",
            "name": "正蓝旗",
            "center": [
              116.0904,
              43.9334
            ]
          },
          {
            "code": "151100_12",
            "name": "多伦县",
            "center": [
              116.0904,
              43.9334
            ]
          }
        ]
      },
      {
        "code": "151200",
        "name": "阿拉善盟",
        "center": [
          105.7063,
          38.8448
        ],
        "children": [
          {
            "code": "151200_ALL",
            "name": "全区全域",
            "center": [
              105.7063,
              38.8448
            ]
          },
          {
            "code": "151200_1",
            "name": "阿拉善左旗",
            "center": [
              105.7063,
              38.8448
            ]
          },
          {
            "code": "151200_2",
            "name": "阿拉善右旗",
            "center": [
              105.7063,
              38.8448
            ]
          },
          {
            "code": "151200_3",
            "name": "额济纳旗",
            "center": [
              105.7063,
              38.8448
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "210000",
    "name": "辽宁省",
    "center": [
      123.4291,
      41.7968
    ],
    "children": [
      {
        "code": "210000_ALL",
        "name": "全省范围",
        "center": [
          123.4291,
          41.7968
        ],
        "children": [
          {
            "code": "210000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              123.4291,
              41.7968
            ]
          }
        ]
      },
      {
        "code": "210100",
        "name": "沈阳市",
        "center": [
          123.4291,
          41.7968
        ],
        "children": [
          {
            "code": "210100_ALL",
            "name": "全区全域",
            "center": [
              123.4291,
              41.7968
            ]
          },
          {
            "code": "210100_1",
            "name": "和平区",
            "center": [
              123.4291,
              41.7968
            ]
          },
          {
            "code": "210100_2",
            "name": "沈河区",
            "center": [
              123.4291,
              41.7968
            ]
          },
          {
            "code": "210100_3",
            "name": "大东区",
            "center": [
              123.4291,
              41.7968
            ]
          },
          {
            "code": "210100_4",
            "name": "皇姑区",
            "center": [
              123.4291,
              41.7968
            ]
          },
          {
            "code": "210100_5",
            "name": "铁西区",
            "center": [
              123.4291,
              41.7968
            ]
          },
          {
            "code": "210100_6",
            "name": "浑南区",
            "center": [
              123.4291,
              41.7968
            ]
          },
          {
            "code": "210100_7",
            "name": "沈北新区",
            "center": [
              123.4291,
              41.7968
            ]
          },
          {
            "code": "210100_8",
            "name": "于洪区",
            "center": [
              123.4291,
              41.7968
            ]
          },
          {
            "code": "210100_9",
            "name": "辽中区",
            "center": [
              123.4291,
              41.7968
            ]
          },
          {
            "code": "210100_10",
            "name": "康平县",
            "center": [
              123.4291,
              41.7968
            ]
          },
          {
            "code": "210100_11",
            "name": "法库县",
            "center": [
              123.4291,
              41.7968
            ]
          },
          {
            "code": "210100_12",
            "name": "新民市",
            "center": [
              123.4291,
              41.7968
            ]
          }
        ]
      },
      {
        "code": "210200",
        "name": "大连市",
        "center": [
          121.6147,
          38.914
        ],
        "children": [
          {
            "code": "210200_ALL",
            "name": "全区全域",
            "center": [
              121.6147,
              38.914
            ]
          },
          {
            "code": "210200_1",
            "name": "中山区",
            "center": [
              121.6147,
              38.914
            ]
          },
          {
            "code": "210200_2",
            "name": "西岗区",
            "center": [
              121.6147,
              38.914
            ]
          },
          {
            "code": "210200_3",
            "name": "沙河口区",
            "center": [
              121.6147,
              38.914
            ]
          },
          {
            "code": "210200_4",
            "name": "甘井子区",
            "center": [
              121.6147,
              38.914
            ]
          },
          {
            "code": "210200_5",
            "name": "旅顺口区",
            "center": [
              121.6147,
              38.914
            ]
          },
          {
            "code": "210200_6",
            "name": "金州区",
            "center": [
              121.6147,
              38.914
            ]
          },
          {
            "code": "210200_7",
            "name": "普兰店区",
            "center": [
              121.6147,
              38.914
            ]
          },
          {
            "code": "210200_8",
            "name": "长海县",
            "center": [
              121.6147,
              38.914
            ]
          },
          {
            "code": "210200_9",
            "name": "瓦房店市",
            "center": [
              121.6147,
              38.914
            ]
          },
          {
            "code": "210200_10",
            "name": "庄河市",
            "center": [
              121.6147,
              38.914
            ]
          }
        ]
      },
      {
        "code": "210300",
        "name": "鞍山市",
        "center": [
          122.9944,
          41.1085
        ],
        "children": [
          {
            "code": "210300_ALL",
            "name": "全区全域",
            "center": [
              122.9944,
              41.1085
            ]
          },
          {
            "code": "210300_1",
            "name": "铁东区",
            "center": [
              122.9944,
              41.1085
            ]
          },
          {
            "code": "210300_2",
            "name": "铁西区",
            "center": [
              122.9944,
              41.1085
            ]
          },
          {
            "code": "210300_3",
            "name": "立山区",
            "center": [
              122.9944,
              41.1085
            ]
          },
          {
            "code": "210300_4",
            "name": "千山区",
            "center": [
              122.9944,
              41.1085
            ]
          },
          {
            "code": "210300_5",
            "name": "台安县",
            "center": [
              122.9944,
              41.1085
            ]
          },
          {
            "code": "210300_6",
            "name": "岫岩满族自治县",
            "center": [
              122.9944,
              41.1085
            ]
          },
          {
            "code": "210300_7",
            "name": "海城市",
            "center": [
              122.9944,
              41.1085
            ]
          }
        ]
      },
      {
        "code": "210400",
        "name": "抚顺市",
        "center": [
          123.9211,
          41.8759
        ],
        "children": [
          {
            "code": "210400_ALL",
            "name": "全区全域",
            "center": [
              123.9211,
              41.8759
            ]
          },
          {
            "code": "210400_1",
            "name": "新抚区",
            "center": [
              123.9211,
              41.8759
            ]
          },
          {
            "code": "210400_2",
            "name": "东洲区",
            "center": [
              123.9211,
              41.8759
            ]
          },
          {
            "code": "210400_3",
            "name": "望花区",
            "center": [
              123.9211,
              41.8759
            ]
          },
          {
            "code": "210400_4",
            "name": "顺城区",
            "center": [
              123.9211,
              41.8759
            ]
          },
          {
            "code": "210400_5",
            "name": "抚顺县",
            "center": [
              123.9211,
              41.8759
            ]
          },
          {
            "code": "210400_6",
            "name": "新宾满族自治县",
            "center": [
              123.9211,
              41.8759
            ]
          },
          {
            "code": "210400_7",
            "name": "清原满族自治县",
            "center": [
              123.9211,
              41.8759
            ]
          }
        ]
      },
      {
        "code": "210500",
        "name": "本溪市",
        "center": [
          123.7705,
          41.2979
        ],
        "children": [
          {
            "code": "210500_ALL",
            "name": "全区全域",
            "center": [
              123.7705,
              41.2979
            ]
          },
          {
            "code": "210500_1",
            "name": "平山区",
            "center": [
              123.7705,
              41.2979
            ]
          },
          {
            "code": "210500_2",
            "name": "溪湖区",
            "center": [
              123.7705,
              41.2979
            ]
          },
          {
            "code": "210500_3",
            "name": "明山区",
            "center": [
              123.7705,
              41.2979
            ]
          },
          {
            "code": "210500_4",
            "name": "南芬区",
            "center": [
              123.7705,
              41.2979
            ]
          },
          {
            "code": "210500_5",
            "name": "本溪满族自治县",
            "center": [
              123.7705,
              41.2979
            ]
          },
          {
            "code": "210500_6",
            "name": "桓仁满族自治县",
            "center": [
              123.7705,
              41.2979
            ]
          }
        ]
      },
      {
        "code": "210600",
        "name": "丹东市",
        "center": [
          124.3831,
          40.1248
        ],
        "children": [
          {
            "code": "210600_ALL",
            "name": "全区全域",
            "center": [
              124.3831,
              40.1248
            ]
          },
          {
            "code": "210600_1",
            "name": "元宝区",
            "center": [
              124.3831,
              40.1248
            ]
          },
          {
            "code": "210600_2",
            "name": "振兴区",
            "center": [
              124.3831,
              40.1248
            ]
          },
          {
            "code": "210600_3",
            "name": "振安区",
            "center": [
              124.3831,
              40.1248
            ]
          },
          {
            "code": "210600_4",
            "name": "宽甸满族自治县",
            "center": [
              124.3831,
              40.1248
            ]
          },
          {
            "code": "210600_5",
            "name": "东港市",
            "center": [
              124.3831,
              40.1248
            ]
          },
          {
            "code": "210600_6",
            "name": "凤城市",
            "center": [
              124.3831,
              40.1248
            ]
          }
        ]
      },
      {
        "code": "210700",
        "name": "锦州市",
        "center": [
          121.127,
          41.0951
        ],
        "children": [
          {
            "code": "210700_ALL",
            "name": "全区全域",
            "center": [
              121.127,
              41.0951
            ]
          },
          {
            "code": "210700_1",
            "name": "古塔区",
            "center": [
              121.127,
              41.0951
            ]
          },
          {
            "code": "210700_2",
            "name": "凌河区",
            "center": [
              121.127,
              41.0951
            ]
          },
          {
            "code": "210700_3",
            "name": "太和区",
            "center": [
              121.127,
              41.0951
            ]
          },
          {
            "code": "210700_4",
            "name": "黑山县",
            "center": [
              121.127,
              41.0951
            ]
          },
          {
            "code": "210700_5",
            "name": "义县",
            "center": [
              121.127,
              41.0951
            ]
          },
          {
            "code": "210700_6",
            "name": "凌海市",
            "center": [
              121.127,
              41.0951
            ]
          },
          {
            "code": "210700_7",
            "name": "北镇市",
            "center": [
              121.127,
              41.0951
            ]
          }
        ]
      },
      {
        "code": "210800",
        "name": "营口市",
        "center": [
          122.2354,
          40.667
        ],
        "children": [
          {
            "code": "210800_ALL",
            "name": "全区全域",
            "center": [
              122.2354,
              40.667
            ]
          },
          {
            "code": "210800_1",
            "name": "站前区",
            "center": [
              122.2354,
              40.667
            ]
          },
          {
            "code": "210800_2",
            "name": "西市区",
            "center": [
              122.2354,
              40.667
            ]
          },
          {
            "code": "210800_3",
            "name": "鲅鱼圈区",
            "center": [
              122.2354,
              40.667
            ]
          },
          {
            "code": "210800_4",
            "name": "老边区",
            "center": [
              122.2354,
              40.667
            ]
          },
          {
            "code": "210800_5",
            "name": "盖州市",
            "center": [
              122.2354,
              40.667
            ]
          },
          {
            "code": "210800_6",
            "name": "大石桥市",
            "center": [
              122.2354,
              40.667
            ]
          }
        ]
      },
      {
        "code": "210900",
        "name": "阜新市",
        "center": [
          121.6702,
          42.0216
        ],
        "children": [
          {
            "code": "210900_ALL",
            "name": "全区全域",
            "center": [
              121.6702,
              42.0216
            ]
          },
          {
            "code": "210900_1",
            "name": "海州区",
            "center": [
              121.6702,
              42.0216
            ]
          },
          {
            "code": "210900_2",
            "name": "新邱区",
            "center": [
              121.6702,
              42.0216
            ]
          },
          {
            "code": "210900_3",
            "name": "太平区",
            "center": [
              121.6702,
              42.0216
            ]
          },
          {
            "code": "210900_4",
            "name": "清河门区",
            "center": [
              121.6702,
              42.0216
            ]
          },
          {
            "code": "210900_5",
            "name": "细河区",
            "center": [
              121.6702,
              42.0216
            ]
          },
          {
            "code": "210900_6",
            "name": "阜新蒙古族自治县",
            "center": [
              121.6702,
              42.0216
            ]
          },
          {
            "code": "210900_7",
            "name": "彰武县",
            "center": [
              121.6702,
              42.0216
            ]
          }
        ]
      },
      {
        "code": "211000",
        "name": "辽阳市",
        "center": [
          123.1815,
          41.2694
        ],
        "children": [
          {
            "code": "211000_ALL",
            "name": "全区全域",
            "center": [
              123.1815,
              41.2694
            ]
          },
          {
            "code": "211000_1",
            "name": "白塔区",
            "center": [
              123.1815,
              41.2694
            ]
          },
          {
            "code": "211000_2",
            "name": "文圣区",
            "center": [
              123.1815,
              41.2694
            ]
          },
          {
            "code": "211000_3",
            "name": "宏伟区",
            "center": [
              123.1815,
              41.2694
            ]
          },
          {
            "code": "211000_4",
            "name": "弓长岭区",
            "center": [
              123.1815,
              41.2694
            ]
          },
          {
            "code": "211000_5",
            "name": "太子河区",
            "center": [
              123.1815,
              41.2694
            ]
          },
          {
            "code": "211000_6",
            "name": "辽阳县",
            "center": [
              123.1815,
              41.2694
            ]
          },
          {
            "code": "211000_7",
            "name": "灯塔市",
            "center": [
              123.1815,
              41.2694
            ]
          }
        ]
      },
      {
        "code": "211100",
        "name": "盘锦市",
        "center": [
          122.0696,
          41.1245
        ],
        "children": [
          {
            "code": "211100_ALL",
            "name": "全区全域",
            "center": [
              122.0696,
              41.1245
            ]
          },
          {
            "code": "211100_1",
            "name": "双台子区",
            "center": [
              122.0696,
              41.1245
            ]
          },
          {
            "code": "211100_2",
            "name": "兴隆台区",
            "center": [
              122.0696,
              41.1245
            ]
          },
          {
            "code": "211100_3",
            "name": "大洼区",
            "center": [
              122.0696,
              41.1245
            ]
          },
          {
            "code": "211100_4",
            "name": "盘山县",
            "center": [
              122.0696,
              41.1245
            ]
          }
        ]
      },
      {
        "code": "211200",
        "name": "铁岭市",
        "center": [
          123.8443,
          42.2905
        ],
        "children": [
          {
            "code": "211200_ALL",
            "name": "全区全域",
            "center": [
              123.8443,
              42.2905
            ]
          },
          {
            "code": "211200_1",
            "name": "银州区",
            "center": [
              123.8443,
              42.2905
            ]
          },
          {
            "code": "211200_2",
            "name": "清河区",
            "center": [
              123.8443,
              42.2905
            ]
          },
          {
            "code": "211200_3",
            "name": "铁岭县",
            "center": [
              123.8443,
              42.2905
            ]
          },
          {
            "code": "211200_4",
            "name": "西丰县",
            "center": [
              123.8443,
              42.2905
            ]
          },
          {
            "code": "211200_5",
            "name": "昌图县",
            "center": [
              123.8443,
              42.2905
            ]
          },
          {
            "code": "211200_6",
            "name": "调兵山市",
            "center": [
              123.8443,
              42.2905
            ]
          },
          {
            "code": "211200_7",
            "name": "开原市",
            "center": [
              123.8443,
              42.2905
            ]
          }
        ]
      },
      {
        "code": "211300",
        "name": "朝阳市",
        "center": [
          120.4512,
          41.5768
        ],
        "children": [
          {
            "code": "211300_ALL",
            "name": "全区全域",
            "center": [
              120.4512,
              41.5768
            ]
          },
          {
            "code": "211300_1",
            "name": "双塔区",
            "center": [
              120.4512,
              41.5768
            ]
          },
          {
            "code": "211300_2",
            "name": "龙城区",
            "center": [
              120.4512,
              41.5768
            ]
          },
          {
            "code": "211300_3",
            "name": "朝阳县",
            "center": [
              120.4512,
              41.5768
            ]
          },
          {
            "code": "211300_4",
            "name": "建平县",
            "center": [
              120.4512,
              41.5768
            ]
          },
          {
            "code": "211300_5",
            "name": "喀喇沁左翼蒙古族自治县",
            "center": [
              120.4512,
              41.5768
            ]
          },
          {
            "code": "211300_6",
            "name": "北票市",
            "center": [
              120.4512,
              41.5768
            ]
          },
          {
            "code": "211300_7",
            "name": "凌源市",
            "center": [
              120.4512,
              41.5768
            ]
          }
        ]
      },
      {
        "code": "211400",
        "name": "葫芦岛市",
        "center": [
          120.8369,
          40.7111
        ],
        "children": [
          {
            "code": "211400_ALL",
            "name": "全区全域",
            "center": [
              120.8369,
              40.7111
            ]
          },
          {
            "code": "211400_1",
            "name": "连山区",
            "center": [
              120.8369,
              40.7111
            ]
          },
          {
            "code": "211400_2",
            "name": "龙港区",
            "center": [
              120.8369,
              40.7111
            ]
          },
          {
            "code": "211400_3",
            "name": "南票区",
            "center": [
              120.8369,
              40.7111
            ]
          },
          {
            "code": "211400_4",
            "name": "绥中县",
            "center": [
              120.8369,
              40.7111
            ]
          },
          {
            "code": "211400_5",
            "name": "建昌县",
            "center": [
              120.8369,
              40.7111
            ]
          },
          {
            "code": "211400_6",
            "name": "兴城市",
            "center": [
              120.8369,
              40.7111
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "220000",
    "name": "吉林省",
    "center": [
      125.3245,
      43.8868
    ],
    "children": [
      {
        "code": "220000_ALL",
        "name": "全省范围",
        "center": [
          125.3245,
          43.8868
        ],
        "children": [
          {
            "code": "220000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              125.3245,
              43.8868
            ]
          }
        ]
      },
      {
        "code": "220100",
        "name": "长春市",
        "center": [
          125.3245,
          43.8868
        ],
        "children": [
          {
            "code": "220100_ALL",
            "name": "全区全域",
            "center": [
              125.3245,
              43.8868
            ]
          },
          {
            "code": "220100_1",
            "name": "南关区",
            "center": [
              125.3245,
              43.8868
            ]
          },
          {
            "code": "220100_2",
            "name": "宽城区",
            "center": [
              125.3245,
              43.8868
            ]
          },
          {
            "code": "220100_3",
            "name": "朝阳区",
            "center": [
              125.3245,
              43.8868
            ]
          },
          {
            "code": "220100_4",
            "name": "二道区",
            "center": [
              125.3245,
              43.8868
            ]
          },
          {
            "code": "220100_5",
            "name": "绿园区",
            "center": [
              125.3245,
              43.8868
            ]
          },
          {
            "code": "220100_6",
            "name": "双阳区",
            "center": [
              125.3245,
              43.8868
            ]
          },
          {
            "code": "220100_7",
            "name": "九台区",
            "center": [
              125.3245,
              43.8868
            ]
          },
          {
            "code": "220100_8",
            "name": "农安县",
            "center": [
              125.3245,
              43.8868
            ]
          },
          {
            "code": "220100_9",
            "name": "榆树市",
            "center": [
              125.3245,
              43.8868
            ]
          },
          {
            "code": "220100_10",
            "name": "德惠市",
            "center": [
              125.3245,
              43.8868
            ]
          }
        ]
      },
      {
        "code": "220200",
        "name": "吉林市",
        "center": [
          126.55,
          43.8379
        ],
        "children": [
          {
            "code": "220200_ALL",
            "name": "全区全域",
            "center": [
              126.55,
              43.8379
            ]
          },
          {
            "code": "220200_1",
            "name": "昌邑区",
            "center": [
              126.55,
              43.8379
            ]
          },
          {
            "code": "220200_2",
            "name": "龙潭区",
            "center": [
              126.55,
              43.8379
            ]
          },
          {
            "code": "220200_3",
            "name": "船营区",
            "center": [
              126.55,
              43.8379
            ]
          },
          {
            "code": "220200_4",
            "name": "丰满区",
            "center": [
              126.55,
              43.8379
            ]
          },
          {
            "code": "220200_5",
            "name": "永吉县",
            "center": [
              126.55,
              43.8379
            ]
          },
          {
            "code": "220200_6",
            "name": "蛟河市",
            "center": [
              126.55,
              43.8379
            ]
          },
          {
            "code": "220200_7",
            "name": "桦甸市",
            "center": [
              126.55,
              43.8379
            ]
          },
          {
            "code": "220200_8",
            "name": "舒兰市",
            "center": [
              126.55,
              43.8379
            ]
          },
          {
            "code": "220200_9",
            "name": "磐石市",
            "center": [
              126.55,
              43.8379
            ]
          }
        ]
      },
      {
        "code": "220300",
        "name": "四平市",
        "center": [
          124.3708,
          43.1703
        ],
        "children": [
          {
            "code": "220300_ALL",
            "name": "全区全域",
            "center": [
              124.3708,
              43.1703
            ]
          },
          {
            "code": "220300_1",
            "name": "铁西区",
            "center": [
              124.3708,
              43.1703
            ]
          },
          {
            "code": "220300_2",
            "name": "铁东区",
            "center": [
              124.3708,
              43.1703
            ]
          },
          {
            "code": "220300_3",
            "name": "梨树县",
            "center": [
              124.3708,
              43.1703
            ]
          },
          {
            "code": "220300_4",
            "name": "伊通满族自治县",
            "center": [
              124.3708,
              43.1703
            ]
          },
          {
            "code": "220300_5",
            "name": "双辽市",
            "center": [
              124.3708,
              43.1703
            ]
          }
        ]
      },
      {
        "code": "220400",
        "name": "辽源市",
        "center": [
          125.1453,
          42.9026
        ],
        "children": [
          {
            "code": "220400_ALL",
            "name": "全区全域",
            "center": [
              125.1453,
              42.9026
            ]
          },
          {
            "code": "220400_1",
            "name": "龙山区",
            "center": [
              125.1453,
              42.9026
            ]
          },
          {
            "code": "220400_2",
            "name": "西安区",
            "center": [
              125.1453,
              42.9026
            ]
          },
          {
            "code": "220400_3",
            "name": "东丰县",
            "center": [
              125.1453,
              42.9026
            ]
          },
          {
            "code": "220400_4",
            "name": "东辽县",
            "center": [
              125.1453,
              42.9026
            ]
          }
        ]
      },
      {
        "code": "220500",
        "name": "通化市",
        "center": [
          125.9365,
          41.7212
        ],
        "children": [
          {
            "code": "220500_ALL",
            "name": "全区全域",
            "center": [
              125.9365,
              41.7212
            ]
          },
          {
            "code": "220500_1",
            "name": "东昌区",
            "center": [
              125.9365,
              41.7212
            ]
          },
          {
            "code": "220500_2",
            "name": "二道江区",
            "center": [
              125.9365,
              41.7212
            ]
          },
          {
            "code": "220500_3",
            "name": "通化县",
            "center": [
              125.9365,
              41.7212
            ]
          },
          {
            "code": "220500_4",
            "name": "辉南县",
            "center": [
              125.9365,
              41.7212
            ]
          },
          {
            "code": "220500_5",
            "name": "柳河县",
            "center": [
              125.9365,
              41.7212
            ]
          },
          {
            "code": "220500_6",
            "name": "梅河口市",
            "center": [
              125.9365,
              41.7212
            ]
          },
          {
            "code": "220500_7",
            "name": "集安市",
            "center": [
              125.9365,
              41.7212
            ]
          }
        ]
      },
      {
        "code": "220600",
        "name": "白山市",
        "center": [
          126.4278,
          41.9425
        ],
        "children": [
          {
            "code": "220600_ALL",
            "name": "全区全域",
            "center": [
              126.4278,
              41.9425
            ]
          },
          {
            "code": "220600_1",
            "name": "浑江区",
            "center": [
              126.4278,
              41.9425
            ]
          },
          {
            "code": "220600_2",
            "name": "江源区",
            "center": [
              126.4278,
              41.9425
            ]
          },
          {
            "code": "220600_3",
            "name": "抚松县",
            "center": [
              126.4278,
              41.9425
            ]
          },
          {
            "code": "220600_4",
            "name": "靖宇县",
            "center": [
              126.4278,
              41.9425
            ]
          },
          {
            "code": "220600_5",
            "name": "长白朝鲜族自治县",
            "center": [
              126.4278,
              41.9425
            ]
          },
          {
            "code": "220600_6",
            "name": "临江市",
            "center": [
              126.4278,
              41.9425
            ]
          }
        ]
      },
      {
        "code": "220700",
        "name": "松原市",
        "center": [
          124.8236,
          45.1182
        ],
        "children": [
          {
            "code": "220700_ALL",
            "name": "全区全域",
            "center": [
              124.8236,
              45.1182
            ]
          },
          {
            "code": "220700_1",
            "name": "宁江区",
            "center": [
              124.8236,
              45.1182
            ]
          },
          {
            "code": "220700_2",
            "name": "前郭尔罗斯蒙古族自治县",
            "center": [
              124.8236,
              45.1182
            ]
          },
          {
            "code": "220700_3",
            "name": "长岭县",
            "center": [
              124.8236,
              45.1182
            ]
          },
          {
            "code": "220700_4",
            "name": "乾安县",
            "center": [
              124.8236,
              45.1182
            ]
          },
          {
            "code": "220700_5",
            "name": "扶余市",
            "center": [
              124.8236,
              45.1182
            ]
          }
        ]
      },
      {
        "code": "220800",
        "name": "白城市",
        "center": [
          122.8412,
          45.6191
        ],
        "children": [
          {
            "code": "220800_ALL",
            "name": "全区全域",
            "center": [
              122.8412,
              45.6191
            ]
          },
          {
            "code": "220800_1",
            "name": "洮北区",
            "center": [
              122.8412,
              45.6191
            ]
          },
          {
            "code": "220800_2",
            "name": "镇赉县",
            "center": [
              122.8412,
              45.6191
            ]
          },
          {
            "code": "220800_3",
            "name": "通榆县",
            "center": [
              122.8412,
              45.6191
            ]
          },
          {
            "code": "220800_4",
            "name": "洮南市",
            "center": [
              122.8412,
              45.6191
            ]
          },
          {
            "code": "220800_5",
            "name": "大安市",
            "center": [
              122.8412,
              45.6191
            ]
          }
        ]
      },
      {
        "code": "220900",
        "name": "延边朝鲜族自治州",
        "center": [
          129.5132,
          42.9048
        ],
        "children": [
          {
            "code": "220900_ALL",
            "name": "全区全域",
            "center": [
              129.5132,
              42.9048
            ]
          },
          {
            "code": "220900_1",
            "name": "延吉市",
            "center": [
              129.5132,
              42.9048
            ]
          },
          {
            "code": "220900_2",
            "name": "图们市",
            "center": [
              129.5132,
              42.9048
            ]
          },
          {
            "code": "220900_3",
            "name": "敦化市",
            "center": [
              129.5132,
              42.9048
            ]
          },
          {
            "code": "220900_4",
            "name": "珲春市",
            "center": [
              129.5132,
              42.9048
            ]
          },
          {
            "code": "220900_5",
            "name": "龙井市",
            "center": [
              129.5132,
              42.9048
            ]
          },
          {
            "code": "220900_6",
            "name": "和龙市",
            "center": [
              129.5132,
              42.9048
            ]
          },
          {
            "code": "220900_7",
            "name": "汪清县",
            "center": [
              129.5132,
              42.9048
            ]
          },
          {
            "code": "220900_8",
            "name": "安图县",
            "center": [
              129.5132,
              42.9048
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "230000",
    "name": "黑龙江省",
    "center": [
      126.6424,
      45.7569
    ],
    "children": [
      {
        "code": "230000_ALL",
        "name": "全省范围",
        "center": [
          126.6424,
          45.7569
        ],
        "children": [
          {
            "code": "230000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              126.6424,
              45.7569
            ]
          }
        ]
      },
      {
        "code": "230100",
        "name": "哈尔滨市",
        "center": [
          126.6424,
          45.7569
        ],
        "children": [
          {
            "code": "230100_ALL",
            "name": "全区全域",
            "center": [
              126.6424,
              45.7569
            ]
          },
          {
            "code": "230100_1",
            "name": "道里区",
            "center": [
              126.6424,
              45.7569
            ]
          },
          {
            "code": "230100_2",
            "name": "南岗区",
            "center": [
              126.6424,
              45.7569
            ]
          },
          {
            "code": "230100_3",
            "name": "道外区",
            "center": [
              126.6424,
              45.7569
            ]
          },
          {
            "code": "230100_4",
            "name": "平房区",
            "center": [
              126.6424,
              45.7569
            ]
          },
          {
            "code": "230100_5",
            "name": "松北区",
            "center": [
              126.6424,
              45.7569
            ]
          },
          {
            "code": "230100_6",
            "name": "香坊区",
            "center": [
              126.6424,
              45.7569
            ]
          },
          {
            "code": "230100_7",
            "name": "呼兰区",
            "center": [
              126.6424,
              45.7569
            ]
          },
          {
            "code": "230100_8",
            "name": "阿城区",
            "center": [
              126.6424,
              45.7569
            ]
          },
          {
            "code": "230100_9",
            "name": "双城区",
            "center": [
              126.6424,
              45.7569
            ]
          },
          {
            "code": "230100_10",
            "name": "依兰县",
            "center": [
              126.6424,
              45.7569
            ]
          },
          {
            "code": "230100_11",
            "name": "方正县",
            "center": [
              126.6424,
              45.7569
            ]
          },
          {
            "code": "230100_12",
            "name": "宾县",
            "center": [
              126.6424,
              45.7569
            ]
          },
          {
            "code": "230100_13",
            "name": "巴彦县",
            "center": [
              126.6424,
              45.7569
            ]
          },
          {
            "code": "230100_14",
            "name": "木兰县",
            "center": [
              126.6424,
              45.7569
            ]
          },
          {
            "code": "230100_15",
            "name": "通河县",
            "center": [
              126.6424,
              45.7569
            ]
          },
          {
            "code": "230100_16",
            "name": "延寿县",
            "center": [
              126.6424,
              45.7569
            ]
          },
          {
            "code": "230100_17",
            "name": "尚志市",
            "center": [
              126.6424,
              45.7569
            ]
          },
          {
            "code": "230100_18",
            "name": "五常市",
            "center": [
              126.6424,
              45.7569
            ]
          }
        ]
      },
      {
        "code": "230200",
        "name": "齐齐哈尔市",
        "center": [
          123.9579,
          47.3421
        ],
        "children": [
          {
            "code": "230200_ALL",
            "name": "全区全域",
            "center": [
              123.9579,
              47.3421
            ]
          },
          {
            "code": "230200_1",
            "name": "龙沙区",
            "center": [
              123.9579,
              47.3421
            ]
          },
          {
            "code": "230200_2",
            "name": "建华区",
            "center": [
              123.9579,
              47.3421
            ]
          },
          {
            "code": "230200_3",
            "name": "铁锋区",
            "center": [
              123.9579,
              47.3421
            ]
          },
          {
            "code": "230200_4",
            "name": "昂昂溪区",
            "center": [
              123.9579,
              47.3421
            ]
          },
          {
            "code": "230200_5",
            "name": "富拉尔基区",
            "center": [
              123.9579,
              47.3421
            ]
          },
          {
            "code": "230200_6",
            "name": "碾子山区",
            "center": [
              123.9579,
              47.3421
            ]
          },
          {
            "code": "230200_7",
            "name": "梅里斯达斡尔族区",
            "center": [
              123.9579,
              47.3421
            ]
          },
          {
            "code": "230200_8",
            "name": "龙江县",
            "center": [
              123.9579,
              47.3421
            ]
          },
          {
            "code": "230200_9",
            "name": "依安县",
            "center": [
              123.9579,
              47.3421
            ]
          },
          {
            "code": "230200_10",
            "name": "泰来县",
            "center": [
              123.9579,
              47.3421
            ]
          },
          {
            "code": "230200_11",
            "name": "甘南县",
            "center": [
              123.9579,
              47.3421
            ]
          },
          {
            "code": "230200_12",
            "name": "富裕县",
            "center": [
              123.9579,
              47.3421
            ]
          },
          {
            "code": "230200_13",
            "name": "克山县",
            "center": [
              123.9579,
              47.3421
            ]
          },
          {
            "code": "230200_14",
            "name": "克东县",
            "center": [
              123.9579,
              47.3421
            ]
          },
          {
            "code": "230200_15",
            "name": "拜泉县",
            "center": [
              123.9579,
              47.3421
            ]
          },
          {
            "code": "230200_16",
            "name": "讷河市",
            "center": [
              123.9579,
              47.3421
            ]
          }
        ]
      },
      {
        "code": "230300",
        "name": "鸡西市",
        "center": [
          130.9759,
          45.3
        ],
        "children": [
          {
            "code": "230300_ALL",
            "name": "全区全域",
            "center": [
              130.9759,
              45.3
            ]
          },
          {
            "code": "230300_1",
            "name": "鸡冠区",
            "center": [
              130.9759,
              45.3
            ]
          },
          {
            "code": "230300_2",
            "name": "恒山区",
            "center": [
              130.9759,
              45.3
            ]
          },
          {
            "code": "230300_3",
            "name": "滴道区",
            "center": [
              130.9759,
              45.3
            ]
          },
          {
            "code": "230300_4",
            "name": "梨树区",
            "center": [
              130.9759,
              45.3
            ]
          },
          {
            "code": "230300_5",
            "name": "城子河区",
            "center": [
              130.9759,
              45.3
            ]
          },
          {
            "code": "230300_6",
            "name": "麻山区",
            "center": [
              130.9759,
              45.3
            ]
          },
          {
            "code": "230300_7",
            "name": "鸡东县",
            "center": [
              130.9759,
              45.3
            ]
          },
          {
            "code": "230300_8",
            "name": "密山市",
            "center": [
              130.9759,
              45.3
            ]
          },
          {
            "code": "230300_9",
            "name": "虎林市",
            "center": [
              130.9759,
              45.3
            ]
          }
        ]
      },
      {
        "code": "230400",
        "name": "鹤岗市",
        "center": [
          130.2775,
          47.3499
        ],
        "children": [
          {
            "code": "230400_ALL",
            "name": "全区全域",
            "center": [
              130.2775,
              47.3499
            ]
          },
          {
            "code": "230400_1",
            "name": "向阳区",
            "center": [
              130.2775,
              47.3499
            ]
          },
          {
            "code": "230400_2",
            "name": "工农区",
            "center": [
              130.2775,
              47.3499
            ]
          },
          {
            "code": "230400_3",
            "name": "南山区",
            "center": [
              130.2775,
              47.3499
            ]
          },
          {
            "code": "230400_4",
            "name": "兴安区",
            "center": [
              130.2775,
              47.3499
            ]
          },
          {
            "code": "230400_5",
            "name": "东山区",
            "center": [
              130.2775,
              47.3499
            ]
          },
          {
            "code": "230400_6",
            "name": "兴山区",
            "center": [
              130.2775,
              47.3499
            ]
          },
          {
            "code": "230400_7",
            "name": "萝北县",
            "center": [
              130.2775,
              47.3499
            ]
          },
          {
            "code": "230400_8",
            "name": "绥滨县",
            "center": [
              130.2775,
              47.3499
            ]
          }
        ]
      },
      {
        "code": "230500",
        "name": "双鸭山市",
        "center": [
          131.1576,
          46.6434
        ],
        "children": [
          {
            "code": "230500_ALL",
            "name": "全区全域",
            "center": [
              131.1576,
              46.6434
            ]
          },
          {
            "code": "230500_1",
            "name": "尖山区",
            "center": [
              131.1576,
              46.6434
            ]
          },
          {
            "code": "230500_2",
            "name": "岭东区",
            "center": [
              131.1576,
              46.6434
            ]
          },
          {
            "code": "230500_3",
            "name": "四方台区",
            "center": [
              131.1576,
              46.6434
            ]
          },
          {
            "code": "230500_4",
            "name": "宝山区",
            "center": [
              131.1576,
              46.6434
            ]
          },
          {
            "code": "230500_5",
            "name": "集贤县",
            "center": [
              131.1576,
              46.6434
            ]
          },
          {
            "code": "230500_6",
            "name": "友谊县",
            "center": [
              131.1576,
              46.6434
            ]
          },
          {
            "code": "230500_7",
            "name": "宝清县",
            "center": [
              131.1576,
              46.6434
            ]
          },
          {
            "code": "230500_8",
            "name": "饶河县",
            "center": [
              131.1576,
              46.6434
            ]
          }
        ]
      },
      {
        "code": "230600",
        "name": "大庆市",
        "center": [
          125.1127,
          46.5907
        ],
        "children": [
          {
            "code": "230600_ALL",
            "name": "全区全域",
            "center": [
              125.1127,
              46.5907
            ]
          },
          {
            "code": "230600_1",
            "name": "萨尔图区",
            "center": [
              125.1127,
              46.5907
            ]
          },
          {
            "code": "230600_2",
            "name": "龙凤区",
            "center": [
              125.1127,
              46.5907
            ]
          },
          {
            "code": "230600_3",
            "name": "让胡路区",
            "center": [
              125.1127,
              46.5907
            ]
          },
          {
            "code": "230600_4",
            "name": "红岗区",
            "center": [
              125.1127,
              46.5907
            ]
          },
          {
            "code": "230600_5",
            "name": "大同区",
            "center": [
              125.1127,
              46.5907
            ]
          },
          {
            "code": "230600_6",
            "name": "肇州县",
            "center": [
              125.1127,
              46.5907
            ]
          },
          {
            "code": "230600_7",
            "name": "肇源县",
            "center": [
              125.1127,
              46.5907
            ]
          },
          {
            "code": "230600_8",
            "name": "林甸县",
            "center": [
              125.1127,
              46.5907
            ]
          },
          {
            "code": "230600_9",
            "name": "杜尔伯特蒙古族自治县",
            "center": [
              125.1127,
              46.5907
            ]
          }
        ]
      },
      {
        "code": "230700",
        "name": "伊春市",
        "center": [
          128.8993,
          47.7248
        ],
        "children": [
          {
            "code": "230700_ALL",
            "name": "全区全域",
            "center": [
              128.8993,
              47.7248
            ]
          },
          {
            "code": "230700_1",
            "name": "伊美区",
            "center": [
              128.8993,
              47.7248
            ]
          },
          {
            "code": "230700_2",
            "name": "乌翠区",
            "center": [
              128.8993,
              47.7248
            ]
          },
          {
            "code": "230700_3",
            "name": "友好区",
            "center": [
              128.8993,
              47.7248
            ]
          },
          {
            "code": "230700_4",
            "name": "金林区",
            "center": [
              128.8993,
              47.7248
            ]
          },
          {
            "code": "230700_5",
            "name": "嘉荫县",
            "center": [
              128.8993,
              47.7248
            ]
          },
          {
            "code": "230700_6",
            "name": "汤旺县",
            "center": [
              128.8993,
              47.7248
            ]
          },
          {
            "code": "230700_7",
            "name": "丰林县",
            "center": [
              128.8993,
              47.7248
            ]
          },
          {
            "code": "230700_8",
            "name": "大箐山县",
            "center": [
              128.8993,
              47.7248
            ]
          },
          {
            "code": "230700_9",
            "name": "南岔县",
            "center": [
              128.8993,
              47.7248
            ]
          },
          {
            "code": "230700_10",
            "name": "铁力市",
            "center": [
              128.8993,
              47.7248
            ]
          }
        ]
      },
      {
        "code": "230800",
        "name": "佳木斯市",
        "center": [
          130.3616,
          46.8096
        ],
        "children": [
          {
            "code": "230800_ALL",
            "name": "全区全域",
            "center": [
              130.3616,
              46.8096
            ]
          },
          {
            "code": "230800_1",
            "name": "向阳区",
            "center": [
              130.3616,
              46.8096
            ]
          },
          {
            "code": "230800_2",
            "name": "前进区",
            "center": [
              130.3616,
              46.8096
            ]
          },
          {
            "code": "230800_3",
            "name": "东风区",
            "center": [
              130.3616,
              46.8096
            ]
          },
          {
            "code": "230800_4",
            "name": "郊区",
            "center": [
              130.3616,
              46.8096
            ]
          },
          {
            "code": "230800_5",
            "name": "桦南县",
            "center": [
              130.3616,
              46.8096
            ]
          },
          {
            "code": "230800_6",
            "name": "桦川县",
            "center": [
              130.3616,
              46.8096
            ]
          },
          {
            "code": "230800_7",
            "name": "汤原县",
            "center": [
              130.3616,
              46.8096
            ]
          },
          {
            "code": "230800_8",
            "name": "同江市",
            "center": [
              130.3616,
              46.8096
            ]
          },
          {
            "code": "230800_9",
            "name": "富锦市",
            "center": [
              130.3616,
              46.8096
            ]
          },
          {
            "code": "230800_10",
            "name": "抚远市",
            "center": [
              130.3616,
              46.8096
            ]
          }
        ]
      },
      {
        "code": "230900",
        "name": "七台河市",
        "center": [
          130.8459,
          45.7712
        ],
        "children": [
          {
            "code": "230900_ALL",
            "name": "全区全域",
            "center": [
              130.8459,
              45.7712
            ]
          },
          {
            "code": "230900_1",
            "name": "新兴区",
            "center": [
              130.8459,
              45.7712
            ]
          },
          {
            "code": "230900_2",
            "name": "桃山区",
            "center": [
              130.8459,
              45.7712
            ]
          },
          {
            "code": "230900_3",
            "name": "茄子河区",
            "center": [
              130.8459,
              45.7712
            ]
          },
          {
            "code": "230900_4",
            "name": "勃利县",
            "center": [
              130.8459,
              45.7712
            ]
          }
        ]
      },
      {
        "code": "231000",
        "name": "牡丹江市",
        "center": [
          129.6186,
          44.5829
        ],
        "children": [
          {
            "code": "231000_ALL",
            "name": "全区全域",
            "center": [
              129.6186,
              44.5829
            ]
          },
          {
            "code": "231000_1",
            "name": "东安区",
            "center": [
              129.6186,
              44.5829
            ]
          },
          {
            "code": "231000_2",
            "name": "阳明区",
            "center": [
              129.6186,
              44.5829
            ]
          },
          {
            "code": "231000_3",
            "name": "爱民区",
            "center": [
              129.6186,
              44.5829
            ]
          },
          {
            "code": "231000_4",
            "name": "西安区",
            "center": [
              129.6186,
              44.5829
            ]
          },
          {
            "code": "231000_5",
            "name": "林口县",
            "center": [
              129.6186,
              44.5829
            ]
          },
          {
            "code": "231000_6",
            "name": "绥芬河市",
            "center": [
              129.6186,
              44.5829
            ]
          },
          {
            "code": "231000_7",
            "name": "海林市",
            "center": [
              129.6186,
              44.5829
            ]
          },
          {
            "code": "231000_8",
            "name": "宁安市",
            "center": [
              129.6186,
              44.5829
            ]
          },
          {
            "code": "231000_9",
            "name": "穆棱市",
            "center": [
              129.6186,
              44.5829
            ]
          },
          {
            "code": "231000_10",
            "name": "东宁市",
            "center": [
              129.6186,
              44.5829
            ]
          }
        ]
      },
      {
        "code": "231100",
        "name": "黑河市",
        "center": [
          127.499,
          50.2495
        ],
        "children": [
          {
            "code": "231100_ALL",
            "name": "全区全域",
            "center": [
              127.499,
              50.2495
            ]
          },
          {
            "code": "231100_1",
            "name": "爱辉区",
            "center": [
              127.499,
              50.2495
            ]
          },
          {
            "code": "231100_2",
            "name": "逊克县",
            "center": [
              127.499,
              50.2495
            ]
          },
          {
            "code": "231100_3",
            "name": "孙吴县",
            "center": [
              127.499,
              50.2495
            ]
          },
          {
            "code": "231100_4",
            "name": "北安市",
            "center": [
              127.499,
              50.2495
            ]
          },
          {
            "code": "231100_5",
            "name": "五大连池市",
            "center": [
              127.499,
              50.2495
            ]
          },
          {
            "code": "231100_6",
            "name": "嫩江市",
            "center": [
              127.499,
              50.2495
            ]
          }
        ]
      },
      {
        "code": "231200",
        "name": "绥化市",
        "center": [
          126.9929,
          46.6374
        ],
        "children": [
          {
            "code": "231200_ALL",
            "name": "全区全域",
            "center": [
              126.9929,
              46.6374
            ]
          },
          {
            "code": "231200_1",
            "name": "北林区",
            "center": [
              126.9929,
              46.6374
            ]
          },
          {
            "code": "231200_2",
            "name": "望奎县",
            "center": [
              126.9929,
              46.6374
            ]
          },
          {
            "code": "231200_3",
            "name": "兰西县",
            "center": [
              126.9929,
              46.6374
            ]
          },
          {
            "code": "231200_4",
            "name": "青冈县",
            "center": [
              126.9929,
              46.6374
            ]
          },
          {
            "code": "231200_5",
            "name": "庆安县",
            "center": [
              126.9929,
              46.6374
            ]
          },
          {
            "code": "231200_6",
            "name": "明水县",
            "center": [
              126.9929,
              46.6374
            ]
          },
          {
            "code": "231200_7",
            "name": "绥棱县",
            "center": [
              126.9929,
              46.6374
            ]
          },
          {
            "code": "231200_8",
            "name": "安达市",
            "center": [
              126.9929,
              46.6374
            ]
          },
          {
            "code": "231200_9",
            "name": "肇东市",
            "center": [
              126.9929,
              46.6374
            ]
          },
          {
            "code": "231200_10",
            "name": "海伦市",
            "center": [
              126.9929,
              46.6374
            ]
          }
        ]
      },
      {
        "code": "231300",
        "name": "大兴安岭地区",
        "center": [
          124.1209,
          50.4208
        ],
        "children": [
          {
            "code": "231300_ALL",
            "name": "全区全域",
            "center": [
              124.1209,
              50.4208
            ]
          },
          {
            "code": "231300_1",
            "name": "加格达奇区",
            "center": [
              124.1209,
              50.4208
            ]
          },
          {
            "code": "231300_2",
            "name": "漠河市",
            "center": [
              124.1209,
              50.4208
            ]
          },
          {
            "code": "231300_3",
            "name": "呼玛县",
            "center": [
              124.1209,
              50.4208
            ]
          },
          {
            "code": "231300_4",
            "name": "塔河县",
            "center": [
              124.1209,
              50.4208
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "360000",
    "name": "江西省",
    "center": [
      115.8921,
      28.6764
    ],
    "children": [
      {
        "code": "360000_ALL",
        "name": "全省范围",
        "center": [
          115.8921,
          28.6764
        ],
        "children": [
          {
            "code": "360000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              115.8921,
              28.6764
            ]
          }
        ]
      },
      {
        "code": "360100",
        "name": "南昌市",
        "center": [
          115.8921,
          28.6764
        ],
        "children": [
          {
            "code": "360100_ALL",
            "name": "全区全域",
            "center": [
              115.8921,
              28.6764
            ]
          },
          {
            "code": "360100_1",
            "name": "东湖区",
            "center": [
              115.8921,
              28.6764
            ]
          },
          {
            "code": "360100_2",
            "name": "西湖区",
            "center": [
              115.8921,
              28.6764
            ]
          },
          {
            "code": "360100_3",
            "name": "青云谱区",
            "center": [
              115.8921,
              28.6764
            ]
          },
          {
            "code": "360100_4",
            "name": "青山湖区",
            "center": [
              115.8921,
              28.6764
            ]
          },
          {
            "code": "360100_5",
            "name": "新建区",
            "center": [
              115.8921,
              28.6764
            ]
          },
          {
            "code": "360100_6",
            "name": "红谷滩区",
            "center": [
              115.8921,
              28.6764
            ]
          },
          {
            "code": "360100_7",
            "name": "南昌县",
            "center": [
              115.8921,
              28.6764
            ]
          },
          {
            "code": "360100_8",
            "name": "安义县",
            "center": [
              115.8921,
              28.6764
            ]
          },
          {
            "code": "360100_9",
            "name": "进贤县",
            "center": [
              115.8921,
              28.6764
            ]
          }
        ]
      },
      {
        "code": "360200",
        "name": "景德镇市",
        "center": [
          117.2147,
          29.2926
        ],
        "children": [
          {
            "code": "360200_ALL",
            "name": "全区全域",
            "center": [
              117.2147,
              29.2926
            ]
          },
          {
            "code": "360200_1",
            "name": "昌江区",
            "center": [
              117.2147,
              29.2926
            ]
          },
          {
            "code": "360200_2",
            "name": "珠山区",
            "center": [
              117.2147,
              29.2926
            ]
          },
          {
            "code": "360200_3",
            "name": "浮梁县",
            "center": [
              117.2147,
              29.2926
            ]
          },
          {
            "code": "360200_4",
            "name": "乐平市",
            "center": [
              117.2147,
              29.2926
            ]
          }
        ]
      },
      {
        "code": "360300",
        "name": "萍乡市",
        "center": [
          113.8522,
          27.6229
        ],
        "children": [
          {
            "code": "360300_ALL",
            "name": "全区全域",
            "center": [
              113.8522,
              27.6229
            ]
          },
          {
            "code": "360300_1",
            "name": "安源区",
            "center": [
              113.8522,
              27.6229
            ]
          },
          {
            "code": "360300_2",
            "name": "湘东区",
            "center": [
              113.8522,
              27.6229
            ]
          },
          {
            "code": "360300_3",
            "name": "莲花县",
            "center": [
              113.8522,
              27.6229
            ]
          },
          {
            "code": "360300_4",
            "name": "上栗县",
            "center": [
              113.8522,
              27.6229
            ]
          },
          {
            "code": "360300_5",
            "name": "芦溪县",
            "center": [
              113.8522,
              27.6229
            ]
          }
        ]
      },
      {
        "code": "360400",
        "name": "九江市",
        "center": [
          115.9928,
          29.712
        ],
        "children": [
          {
            "code": "360400_ALL",
            "name": "全区全域",
            "center": [
              115.9928,
              29.712
            ]
          },
          {
            "code": "360400_1",
            "name": "濂溪区",
            "center": [
              115.9928,
              29.712
            ]
          },
          {
            "code": "360400_2",
            "name": "浔阳区",
            "center": [
              115.9928,
              29.712
            ]
          },
          {
            "code": "360400_3",
            "name": "柴桑区",
            "center": [
              115.9928,
              29.712
            ]
          },
          {
            "code": "360400_4",
            "name": "武宁县",
            "center": [
              115.9928,
              29.712
            ]
          },
          {
            "code": "360400_5",
            "name": "修水县",
            "center": [
              115.9928,
              29.712
            ]
          },
          {
            "code": "360400_6",
            "name": "永修县",
            "center": [
              115.9928,
              29.712
            ]
          },
          {
            "code": "360400_7",
            "name": "德安县",
            "center": [
              115.9928,
              29.712
            ]
          },
          {
            "code": "360400_8",
            "name": "都昌县",
            "center": [
              115.9928,
              29.712
            ]
          },
          {
            "code": "360400_9",
            "name": "湖口县",
            "center": [
              115.9928,
              29.712
            ]
          },
          {
            "code": "360400_10",
            "name": "彭泽县",
            "center": [
              115.9928,
              29.712
            ]
          },
          {
            "code": "360400_11",
            "name": "瑞昌市",
            "center": [
              115.9928,
              29.712
            ]
          },
          {
            "code": "360400_12",
            "name": "共青城市",
            "center": [
              115.9928,
              29.712
            ]
          },
          {
            "code": "360400_13",
            "name": "庐山市",
            "center": [
              115.9928,
              29.712
            ]
          }
        ]
      },
      {
        "code": "360500",
        "name": "新余市",
        "center": [
          114.9308,
          27.8108
        ],
        "children": [
          {
            "code": "360500_ALL",
            "name": "全区全域",
            "center": [
              114.9308,
              27.8108
            ]
          },
          {
            "code": "360500_1",
            "name": "渝水区",
            "center": [
              114.9308,
              27.8108
            ]
          },
          {
            "code": "360500_2",
            "name": "分宜县",
            "center": [
              114.9308,
              27.8108
            ]
          }
        ]
      },
      {
        "code": "360600",
        "name": "鹰潭市",
        "center": [
          117.0338,
          28.2742
        ],
        "children": [
          {
            "code": "360600_ALL",
            "name": "全区全域",
            "center": [
              117.0338,
              28.2742
            ]
          },
          {
            "code": "360600_1",
            "name": "月湖区",
            "center": [
              117.0338,
              28.2742
            ]
          },
          {
            "code": "360600_2",
            "name": "余江区",
            "center": [
              117.0338,
              28.2742
            ]
          },
          {
            "code": "360600_3",
            "name": "贵溪市",
            "center": [
              117.0338,
              28.2742
            ]
          }
        ]
      },
      {
        "code": "360700",
        "name": "赣州市",
        "center": [
          114.9348,
          25.8318
        ],
        "children": [
          {
            "code": "360700_ALL",
            "name": "全区全域",
            "center": [
              114.9348,
              25.8318
            ]
          },
          {
            "code": "360700_1",
            "name": "章贡区",
            "center": [
              114.9348,
              25.8318
            ]
          },
          {
            "code": "360700_2",
            "name": "南康区",
            "center": [
              114.9348,
              25.8318
            ]
          },
          {
            "code": "360700_3",
            "name": "赣县区",
            "center": [
              114.9348,
              25.8318
            ]
          },
          {
            "code": "360700_4",
            "name": "信丰县",
            "center": [
              114.9348,
              25.8318
            ]
          },
          {
            "code": "360700_5",
            "name": "大余县",
            "center": [
              114.9348,
              25.8318
            ]
          },
          {
            "code": "360700_6",
            "name": "上犹县",
            "center": [
              114.9348,
              25.8318
            ]
          },
          {
            "code": "360700_7",
            "name": "崇义县",
            "center": [
              114.9348,
              25.8318
            ]
          },
          {
            "code": "360700_8",
            "name": "安远县",
            "center": [
              114.9348,
              25.8318
            ]
          },
          {
            "code": "360700_9",
            "name": "龙南市",
            "center": [
              114.9348,
              25.8318
            ]
          },
          {
            "code": "360700_10",
            "name": "定南县",
            "center": [
              114.9348,
              25.8318
            ]
          },
          {
            "code": "360700_11",
            "name": "全南县",
            "center": [
              114.9348,
              25.8318
            ]
          },
          {
            "code": "360700_12",
            "name": "宁都县",
            "center": [
              114.9348,
              25.8318
            ]
          },
          {
            "code": "360700_13",
            "name": "于都县",
            "center": [
              114.9348,
              25.8318
            ]
          },
          {
            "code": "360700_14",
            "name": "兴国县",
            "center": [
              114.9348,
              25.8318
            ]
          },
          {
            "code": "360700_15",
            "name": "会昌县",
            "center": [
              114.9348,
              25.8318
            ]
          },
          {
            "code": "360700_16",
            "name": "寻乌县",
            "center": [
              114.9348,
              25.8318
            ]
          },
          {
            "code": "360700_17",
            "name": "石城县",
            "center": [
              114.9348,
              25.8318
            ]
          },
          {
            "code": "360700_18",
            "name": "瑞金市",
            "center": [
              114.9348,
              25.8318
            ]
          }
        ]
      },
      {
        "code": "360800",
        "name": "吉安市",
        "center": [
          114.9864,
          27.1117
        ],
        "children": [
          {
            "code": "360800_ALL",
            "name": "全区全域",
            "center": [
              114.9864,
              27.1117
            ]
          },
          {
            "code": "360800_1",
            "name": "吉州区",
            "center": [
              114.9864,
              27.1117
            ]
          },
          {
            "code": "360800_2",
            "name": "青原区",
            "center": [
              114.9864,
              27.1117
            ]
          },
          {
            "code": "360800_3",
            "name": "吉安县",
            "center": [
              114.9864,
              27.1117
            ]
          },
          {
            "code": "360800_4",
            "name": "吉水县",
            "center": [
              114.9864,
              27.1117
            ]
          },
          {
            "code": "360800_5",
            "name": "峡江县",
            "center": [
              114.9864,
              27.1117
            ]
          },
          {
            "code": "360800_6",
            "name": "新干县",
            "center": [
              114.9864,
              27.1117
            ]
          },
          {
            "code": "360800_7",
            "name": "永丰县",
            "center": [
              114.9864,
              27.1117
            ]
          },
          {
            "code": "360800_8",
            "name": "泰和县",
            "center": [
              114.9864,
              27.1117
            ]
          },
          {
            "code": "360800_9",
            "name": "遂川县",
            "center": [
              114.9864,
              27.1117
            ]
          },
          {
            "code": "360800_10",
            "name": "万安县",
            "center": [
              114.9864,
              27.1117
            ]
          },
          {
            "code": "360800_11",
            "name": "安福县",
            "center": [
              114.9864,
              27.1117
            ]
          },
          {
            "code": "360800_12",
            "name": "永新县",
            "center": [
              114.9864,
              27.1117
            ]
          },
          {
            "code": "360800_13",
            "name": "井冈山市",
            "center": [
              114.9864,
              27.1117
            ]
          }
        ]
      },
      {
        "code": "360900",
        "name": "宜春市",
        "center": [
          114.3911,
          27.8043
        ],
        "children": [
          {
            "code": "360900_ALL",
            "name": "全区全域",
            "center": [
              114.3911,
              27.8043
            ]
          },
          {
            "code": "360900_1",
            "name": "袁州区",
            "center": [
              114.3911,
              27.8043
            ]
          },
          {
            "code": "360900_2",
            "name": "奉新县",
            "center": [
              114.3911,
              27.8043
            ]
          },
          {
            "code": "360900_3",
            "name": "万载县",
            "center": [
              114.3911,
              27.8043
            ]
          },
          {
            "code": "360900_4",
            "name": "上高县",
            "center": [
              114.3911,
              27.8043
            ]
          },
          {
            "code": "360900_5",
            "name": "宜丰县",
            "center": [
              114.3911,
              27.8043
            ]
          },
          {
            "code": "360900_6",
            "name": "靖安县",
            "center": [
              114.3911,
              27.8043
            ]
          },
          {
            "code": "360900_7",
            "name": "铜鼓县",
            "center": [
              114.3911,
              27.8043
            ]
          },
          {
            "code": "360900_8",
            "name": "丰城市",
            "center": [
              114.3911,
              27.8043
            ]
          },
          {
            "code": "360900_9",
            "name": "樟树市",
            "center": [
              114.3911,
              27.8043
            ]
          },
          {
            "code": "360900_10",
            "name": "高安市",
            "center": [
              114.3911,
              27.8043
            ]
          }
        ]
      },
      {
        "code": "361000",
        "name": "抚州市",
        "center": [
          116.3584,
          27.9839
        ],
        "children": [
          {
            "code": "361000_ALL",
            "name": "全区全域",
            "center": [
              116.3584,
              27.9839
            ]
          },
          {
            "code": "361000_1",
            "name": "临川区",
            "center": [
              116.3584,
              27.9839
            ]
          },
          {
            "code": "361000_2",
            "name": "东乡区",
            "center": [
              116.3584,
              27.9839
            ]
          },
          {
            "code": "361000_3",
            "name": "南城县",
            "center": [
              116.3584,
              27.9839
            ]
          },
          {
            "code": "361000_4",
            "name": "黎川县",
            "center": [
              116.3584,
              27.9839
            ]
          },
          {
            "code": "361000_5",
            "name": "南丰县",
            "center": [
              116.3584,
              27.9839
            ]
          },
          {
            "code": "361000_6",
            "name": "崇仁县",
            "center": [
              116.3584,
              27.9839
            ]
          },
          {
            "code": "361000_7",
            "name": "乐安县",
            "center": [
              116.3584,
              27.9839
            ]
          },
          {
            "code": "361000_8",
            "name": "宜黄县",
            "center": [
              116.3584,
              27.9839
            ]
          },
          {
            "code": "361000_9",
            "name": "金溪县",
            "center": [
              116.3584,
              27.9839
            ]
          },
          {
            "code": "361000_10",
            "name": "资溪县",
            "center": [
              116.3584,
              27.9839
            ]
          },
          {
            "code": "361000_11",
            "name": "广昌县",
            "center": [
              116.3584,
              27.9839
            ]
          }
        ]
      },
      {
        "code": "361100",
        "name": "上饶市",
        "center": [
          117.9712,
          28.4444
        ],
        "children": [
          {
            "code": "361100_ALL",
            "name": "全区全域",
            "center": [
              117.9712,
              28.4444
            ]
          },
          {
            "code": "361100_1",
            "name": "信州区",
            "center": [
              117.9712,
              28.4444
            ]
          },
          {
            "code": "361100_2",
            "name": "广信区",
            "center": [
              117.9712,
              28.4444
            ]
          },
          {
            "code": "361100_3",
            "name": "广丰区",
            "center": [
              117.9712,
              28.4444
            ]
          },
          {
            "code": "361100_4",
            "name": "玉山县",
            "center": [
              117.9712,
              28.4444
            ]
          },
          {
            "code": "361100_5",
            "name": "铅山县",
            "center": [
              117.9712,
              28.4444
            ]
          },
          {
            "code": "361100_6",
            "name": "横峰县",
            "center": [
              117.9712,
              28.4444
            ]
          },
          {
            "code": "361100_7",
            "name": "弋阳县",
            "center": [
              117.9712,
              28.4444
            ]
          },
          {
            "code": "361100_8",
            "name": "余干县",
            "center": [
              117.9712,
              28.4444
            ]
          },
          {
            "code": "361100_9",
            "name": "鄱阳县",
            "center": [
              117.9712,
              28.4444
            ]
          },
          {
            "code": "361100_10",
            "name": "万年县",
            "center": [
              117.9712,
              28.4444
            ]
          },
          {
            "code": "361100_11",
            "name": "婺源县",
            "center": [
              117.9712,
              28.4444
            ]
          },
          {
            "code": "361100_12",
            "name": "德兴市",
            "center": [
              117.9712,
              28.4444
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "450000",
    "name": "广西壮族自治区",
    "center": [
      108.32,
      22.824
    ],
    "children": [
      {
        "code": "450000_ALL",
        "name": "全省范围",
        "center": [
          108.32,
          22.824
        ],
        "children": [
          {
            "code": "450000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              108.32,
              22.824
            ]
          }
        ]
      },
      {
        "code": "450100",
        "name": "南宁市",
        "center": [
          108.32,
          22.824
        ],
        "children": [
          {
            "code": "450100_ALL",
            "name": "全区全域",
            "center": [
              108.32,
              22.824
            ]
          },
          {
            "code": "450100_1",
            "name": "兴宁区",
            "center": [
              108.32,
              22.824
            ]
          },
          {
            "code": "450100_2",
            "name": "青秀区",
            "center": [
              108.32,
              22.824
            ]
          },
          {
            "code": "450100_3",
            "name": "江南区",
            "center": [
              108.32,
              22.824
            ]
          },
          {
            "code": "450100_4",
            "name": "西乡塘区",
            "center": [
              108.32,
              22.824
            ]
          },
          {
            "code": "450100_5",
            "name": "良庆区",
            "center": [
              108.32,
              22.824
            ]
          },
          {
            "code": "450100_6",
            "name": "邕宁区",
            "center": [
              108.32,
              22.824
            ]
          },
          {
            "code": "450100_7",
            "name": "武鸣区",
            "center": [
              108.32,
              22.824
            ]
          },
          {
            "code": "450100_8",
            "name": "隆安县",
            "center": [
              108.32,
              22.824
            ]
          },
          {
            "code": "450100_9",
            "name": "马山县",
            "center": [
              108.32,
              22.824
            ]
          },
          {
            "code": "450100_10",
            "name": "上林县",
            "center": [
              108.32,
              22.824
            ]
          },
          {
            "code": "450100_11",
            "name": "宾阳县",
            "center": [
              108.32,
              22.824
            ]
          },
          {
            "code": "450100_12",
            "name": "横州市",
            "center": [
              108.32,
              22.824
            ]
          }
        ]
      },
      {
        "code": "450200",
        "name": "柳州市",
        "center": [
          109.4117,
          24.3146
        ],
        "children": [
          {
            "code": "450200_ALL",
            "name": "全区全域",
            "center": [
              109.4117,
              24.3146
            ]
          },
          {
            "code": "450200_1",
            "name": "城中区",
            "center": [
              109.4117,
              24.3146
            ]
          },
          {
            "code": "450200_2",
            "name": "鱼峰区",
            "center": [
              109.4117,
              24.3146
            ]
          },
          {
            "code": "450200_3",
            "name": "柳南区",
            "center": [
              109.4117,
              24.3146
            ]
          },
          {
            "code": "450200_4",
            "name": "柳北区",
            "center": [
              109.4117,
              24.3146
            ]
          },
          {
            "code": "450200_5",
            "name": "柳江区",
            "center": [
              109.4117,
              24.3146
            ]
          },
          {
            "code": "450200_6",
            "name": "柳城县",
            "center": [
              109.4117,
              24.3146
            ]
          },
          {
            "code": "450200_7",
            "name": "鹿寨县",
            "center": [
              109.4117,
              24.3146
            ]
          },
          {
            "code": "450200_8",
            "name": "融安县",
            "center": [
              109.4117,
              24.3146
            ]
          },
          {
            "code": "450200_9",
            "name": "融水苗族自治县",
            "center": [
              109.4117,
              24.3146
            ]
          },
          {
            "code": "450200_10",
            "name": "三江侗族自治县",
            "center": [
              109.4117,
              24.3146
            ]
          }
        ]
      },
      {
        "code": "450300",
        "name": "桂林市",
        "center": [
          110.2991,
          25.2742
        ],
        "children": [
          {
            "code": "450300_ALL",
            "name": "全区全域",
            "center": [
              110.2991,
              25.2742
            ]
          },
          {
            "code": "450300_1",
            "name": "秀峰区",
            "center": [
              110.2991,
              25.2742
            ]
          },
          {
            "code": "450300_2",
            "name": "叠彩区",
            "center": [
              110.2991,
              25.2742
            ]
          },
          {
            "code": "450300_3",
            "name": "象山区",
            "center": [
              110.2991,
              25.2742
            ]
          },
          {
            "code": "450300_4",
            "name": "七星区",
            "center": [
              110.2991,
              25.2742
            ]
          },
          {
            "code": "450300_5",
            "name": "雁山区",
            "center": [
              110.2991,
              25.2742
            ]
          },
          {
            "code": "450300_6",
            "name": "临桂区",
            "center": [
              110.2991,
              25.2742
            ]
          },
          {
            "code": "450300_7",
            "name": "阳朔县",
            "center": [
              110.2991,
              25.2742
            ]
          },
          {
            "code": "450300_8",
            "name": "灵川县",
            "center": [
              110.2991,
              25.2742
            ]
          },
          {
            "code": "450300_9",
            "name": "全州县",
            "center": [
              110.2991,
              25.2742
            ]
          },
          {
            "code": "450300_10",
            "name": "兴安县",
            "center": [
              110.2991,
              25.2742
            ]
          },
          {
            "code": "450300_11",
            "name": "永福县",
            "center": [
              110.2991,
              25.2742
            ]
          },
          {
            "code": "450300_12",
            "name": "灌阳县",
            "center": [
              110.2991,
              25.2742
            ]
          },
          {
            "code": "450300_13",
            "name": "龙胜各族自治县",
            "center": [
              110.2991,
              25.2742
            ]
          },
          {
            "code": "450300_14",
            "name": "资源县",
            "center": [
              110.2991,
              25.2742
            ]
          },
          {
            "code": "450300_15",
            "name": "平乐县",
            "center": [
              110.2991,
              25.2742
            ]
          },
          {
            "code": "450300_16",
            "name": "恭城瑶族自治县",
            "center": [
              110.2991,
              25.2742
            ]
          },
          {
            "code": "450300_17",
            "name": "荔浦市",
            "center": [
              110.2991,
              25.2742
            ]
          }
        ]
      },
      {
        "code": "450400",
        "name": "梧州市",
        "center": [
          111.2976,
          23.4748
        ],
        "children": [
          {
            "code": "450400_ALL",
            "name": "全区全域",
            "center": [
              111.2976,
              23.4748
            ]
          },
          {
            "code": "450400_1",
            "name": "万秀区",
            "center": [
              111.2976,
              23.4748
            ]
          },
          {
            "code": "450400_2",
            "name": "长洲区",
            "center": [
              111.2976,
              23.4748
            ]
          },
          {
            "code": "450400_3",
            "name": "龙圩区",
            "center": [
              111.2976,
              23.4748
            ]
          },
          {
            "code": "450400_4",
            "name": "苍梧县",
            "center": [
              111.2976,
              23.4748
            ]
          },
          {
            "code": "450400_5",
            "name": "藤县",
            "center": [
              111.2976,
              23.4748
            ]
          },
          {
            "code": "450400_6",
            "name": "蒙山县",
            "center": [
              111.2976,
              23.4748
            ]
          },
          {
            "code": "450400_7",
            "name": "岑溪市",
            "center": [
              111.2976,
              23.4748
            ]
          }
        ]
      },
      {
        "code": "450500",
        "name": "北海市",
        "center": [
          109.1193,
          21.4733
        ],
        "children": [
          {
            "code": "450500_ALL",
            "name": "全区全域",
            "center": [
              109.1193,
              21.4733
            ]
          },
          {
            "code": "450500_1",
            "name": "海城区",
            "center": [
              109.1193,
              21.4733
            ]
          },
          {
            "code": "450500_2",
            "name": "银海区",
            "center": [
              109.1193,
              21.4733
            ]
          },
          {
            "code": "450500_3",
            "name": "铁山港区",
            "center": [
              109.1193,
              21.4733
            ]
          },
          {
            "code": "450500_4",
            "name": "合浦县",
            "center": [
              109.1193,
              21.4733
            ]
          }
        ]
      },
      {
        "code": "450600",
        "name": "防城港市",
        "center": [
          108.3455,
          21.6868
        ],
        "children": [
          {
            "code": "450600_ALL",
            "name": "全区全域",
            "center": [
              108.3455,
              21.6868
            ]
          },
          {
            "code": "450600_1",
            "name": "港口区",
            "center": [
              108.3455,
              21.6868
            ]
          },
          {
            "code": "450600_2",
            "name": "防城区",
            "center": [
              108.3455,
              21.6868
            ]
          },
          {
            "code": "450600_3",
            "name": "上思县",
            "center": [
              108.3455,
              21.6868
            ]
          },
          {
            "code": "450600_4",
            "name": "东兴市",
            "center": [
              108.3455,
              21.6868
            ]
          }
        ]
      },
      {
        "code": "450700",
        "name": "钦州市",
        "center": [
          108.6241,
          21.9671
        ],
        "children": [
          {
            "code": "450700_ALL",
            "name": "全区全域",
            "center": [
              108.6241,
              21.9671
            ]
          },
          {
            "code": "450700_1",
            "name": "钦南区",
            "center": [
              108.6241,
              21.9671
            ]
          },
          {
            "code": "450700_2",
            "name": "钦北区",
            "center": [
              108.6241,
              21.9671
            ]
          },
          {
            "code": "450700_3",
            "name": "灵山县",
            "center": [
              108.6241,
              21.9671
            ]
          },
          {
            "code": "450700_4",
            "name": "浦北县",
            "center": [
              108.6241,
              21.9671
            ]
          }
        ]
      },
      {
        "code": "450800",
        "name": "贵港市",
        "center": [
          109.6021,
          23.0936
        ],
        "children": [
          {
            "code": "450800_ALL",
            "name": "全区全域",
            "center": [
              109.6021,
              23.0936
            ]
          },
          {
            "code": "450800_1",
            "name": "港北区",
            "center": [
              109.6021,
              23.0936
            ]
          },
          {
            "code": "450800_2",
            "name": "港南区",
            "center": [
              109.6021,
              23.0936
            ]
          },
          {
            "code": "450800_3",
            "name": "覃塘区",
            "center": [
              109.6021,
              23.0936
            ]
          },
          {
            "code": "450800_4",
            "name": "平南县",
            "center": [
              109.6021,
              23.0936
            ]
          },
          {
            "code": "450800_5",
            "name": "桂平市",
            "center": [
              109.6021,
              23.0936
            ]
          }
        ]
      },
      {
        "code": "450900",
        "name": "玉林市",
        "center": [
          110.1544,
          22.6314
        ],
        "children": [
          {
            "code": "450900_ALL",
            "name": "全区全域",
            "center": [
              110.1544,
              22.6314
            ]
          },
          {
            "code": "450900_1",
            "name": "玉州区",
            "center": [
              110.1544,
              22.6314
            ]
          },
          {
            "code": "450900_2",
            "name": "福绵区",
            "center": [
              110.1544,
              22.6314
            ]
          },
          {
            "code": "450900_3",
            "name": "容县",
            "center": [
              110.1544,
              22.6314
            ]
          },
          {
            "code": "450900_4",
            "name": "陆川县",
            "center": [
              110.1544,
              22.6314
            ]
          },
          {
            "code": "450900_5",
            "name": "博白县",
            "center": [
              110.1544,
              22.6314
            ]
          },
          {
            "code": "450900_6",
            "name": "兴业县",
            "center": [
              110.1544,
              22.6314
            ]
          },
          {
            "code": "450900_7",
            "name": "北流市",
            "center": [
              110.1544,
              22.6314
            ]
          }
        ]
      },
      {
        "code": "451000",
        "name": "百色市",
        "center": [
          106.618,
          23.8982
        ],
        "children": [
          {
            "code": "451000_ALL",
            "name": "全区全域",
            "center": [
              106.618,
              23.8982
            ]
          },
          {
            "code": "451000_1",
            "name": "右江区",
            "center": [
              106.618,
              23.8982
            ]
          },
          {
            "code": "451000_2",
            "name": "田阳区",
            "center": [
              106.618,
              23.8982
            ]
          },
          {
            "code": "451000_3",
            "name": "田东县",
            "center": [
              106.618,
              23.8982
            ]
          },
          {
            "code": "451000_4",
            "name": "平果市",
            "center": [
              106.618,
              23.8982
            ]
          },
          {
            "code": "451000_5",
            "name": "德保县",
            "center": [
              106.618,
              23.8982
            ]
          },
          {
            "code": "451000_6",
            "name": "靖西市",
            "center": [
              106.618,
              23.8982
            ]
          },
          {
            "code": "451000_7",
            "name": "那坡县",
            "center": [
              106.618,
              23.8982
            ]
          },
          {
            "code": "451000_8",
            "name": "凌云县",
            "center": [
              106.618,
              23.8982
            ]
          },
          {
            "code": "451000_9",
            "name": "乐业县",
            "center": [
              106.618,
              23.8982
            ]
          },
          {
            "code": "451000_10",
            "name": "田林县",
            "center": [
              106.618,
              23.8982
            ]
          },
          {
            "code": "451000_11",
            "name": "西林县",
            "center": [
              106.618,
              23.8982
            ]
          },
          {
            "code": "451000_12",
            "name": "隆林各族自治县",
            "center": [
              106.618,
              23.8982
            ]
          }
        ]
      },
      {
        "code": "451100",
        "name": "贺州市",
        "center": [
          111.5521,
          24.4142
        ],
        "children": [
          {
            "code": "451100_ALL",
            "name": "全区全域",
            "center": [
              111.5521,
              24.4142
            ]
          },
          {
            "code": "451100_1",
            "name": "八步区",
            "center": [
              111.5521,
              24.4142
            ]
          },
          {
            "code": "451100_2",
            "name": "平桂区",
            "center": [
              111.5521,
              24.4142
            ]
          },
          {
            "code": "451100_3",
            "name": "昭平县",
            "center": [
              111.5521,
              24.4142
            ]
          },
          {
            "code": "451100_4",
            "name": "钟山县",
            "center": [
              111.5521,
              24.4142
            ]
          },
          {
            "code": "451100_5",
            "name": "富川瑶族自治县",
            "center": [
              111.5521,
              24.4142
            ]
          }
        ]
      },
      {
        "code": "451200",
        "name": "河池市",
        "center": [
          108.0621,
          24.6958
        ],
        "children": [
          {
            "code": "451200_ALL",
            "name": "全区全域",
            "center": [
              108.0621,
              24.6958
            ]
          },
          {
            "code": "451200_1",
            "name": "金城江区",
            "center": [
              108.0621,
              24.6958
            ]
          },
          {
            "code": "451200_2",
            "name": "宜州区",
            "center": [
              108.0621,
              24.6958
            ]
          },
          {
            "code": "451200_3",
            "name": "南丹县",
            "center": [
              108.0621,
              24.6958
            ]
          },
          {
            "code": "451200_4",
            "name": "天峨县",
            "center": [
              108.0621,
              24.6958
            ]
          },
          {
            "code": "451200_5",
            "name": "凤山县",
            "center": [
              108.0621,
              24.6958
            ]
          },
          {
            "code": "451200_6",
            "name": "东兰县",
            "center": [
              108.0621,
              24.6958
            ]
          },
          {
            "code": "451200_7",
            "name": "罗城仫佬族自治县",
            "center": [
              108.0621,
              24.6958
            ]
          },
          {
            "code": "451200_8",
            "name": "环江毛南族自治县",
            "center": [
              108.0621,
              24.6958
            ]
          },
          {
            "code": "451200_9",
            "name": "巴马瑶族自治县",
            "center": [
              108.0621,
              24.6958
            ]
          },
          {
            "code": "451200_10",
            "name": "都安瑶族自治县",
            "center": [
              108.0621,
              24.6958
            ]
          },
          {
            "code": "451200_11",
            "name": "大化瑶族自治县",
            "center": [
              108.0621,
              24.6958
            ]
          }
        ]
      },
      {
        "code": "451300",
        "name": "来宾市",
        "center": [
          109.2297,
          23.7338
        ],
        "children": [
          {
            "code": "451300_ALL",
            "name": "全区全域",
            "center": [
              109.2297,
              23.7338
            ]
          },
          {
            "code": "451300_1",
            "name": "兴宾区",
            "center": [
              109.2297,
              23.7338
            ]
          },
          {
            "code": "451300_2",
            "name": "忻城县",
            "center": [
              109.2297,
              23.7338
            ]
          },
          {
            "code": "451300_3",
            "name": "象州县",
            "center": [
              109.2297,
              23.7338
            ]
          },
          {
            "code": "451300_4",
            "name": "武宣县",
            "center": [
              109.2297,
              23.7338
            ]
          },
          {
            "code": "451300_5",
            "name": "金秀瑶族自治县",
            "center": [
              109.2297,
              23.7338
            ]
          },
          {
            "code": "451300_6",
            "name": "合山市",
            "center": [
              109.2297,
              23.7338
            ]
          }
        ]
      },
      {
        "code": "451400",
        "name": "崇左市",
        "center": [
          107.365,
          22.4041
        ],
        "children": [
          {
            "code": "451400_ALL",
            "name": "全区全域",
            "center": [
              107.365,
              22.4041
            ]
          },
          {
            "code": "451400_1",
            "name": "江州区",
            "center": [
              107.365,
              22.4041
            ]
          },
          {
            "code": "451400_2",
            "name": "扶绥县",
            "center": [
              107.365,
              22.4041
            ]
          },
          {
            "code": "451400_3",
            "name": "宁明县",
            "center": [
              107.365,
              22.4041
            ]
          },
          {
            "code": "451400_4",
            "name": "龙州县",
            "center": [
              107.365,
              22.4041
            ]
          },
          {
            "code": "451400_5",
            "name": "大新县",
            "center": [
              107.365,
              22.4041
            ]
          },
          {
            "code": "451400_6",
            "name": "天等县",
            "center": [
              107.365,
              22.4041
            ]
          },
          {
            "code": "451400_7",
            "name": "凭祥市",
            "center": [
              107.365,
              22.4041
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "460000",
    "name": "海南省",
    "center": [
      110.3312,
      20.0319
    ],
    "children": [
      {
        "code": "460000_ALL",
        "name": "全省范围",
        "center": [
          110.3312,
          20.0319
        ],
        "children": [
          {
            "code": "460000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              110.3312,
              20.0319
            ]
          }
        ]
      },
      {
        "code": "460100",
        "name": "海口市",
        "center": [
          110.3312,
          20.0319
        ],
        "children": [
          {
            "code": "460100_ALL",
            "name": "全区全域",
            "center": [
              110.3312,
              20.0319
            ]
          },
          {
            "code": "460100_1",
            "name": "秀英区",
            "center": [
              110.3312,
              20.0319
            ]
          },
          {
            "code": "460100_2",
            "name": "龙华区",
            "center": [
              110.3312,
              20.0319
            ]
          },
          {
            "code": "460100_3",
            "name": "琼山区",
            "center": [
              110.3312,
              20.0319
            ]
          },
          {
            "code": "460100_4",
            "name": "美兰区",
            "center": [
              110.3312,
              20.0319
            ]
          }
        ]
      },
      {
        "code": "460200",
        "name": "三亚市",
        "center": [
          109.5083,
          18.2479
        ],
        "children": [
          {
            "code": "460200_ALL",
            "name": "全区全域",
            "center": [
              109.5083,
              18.2479
            ]
          },
          {
            "code": "460200_1",
            "name": "海棠区",
            "center": [
              109.5083,
              18.2479
            ]
          },
          {
            "code": "460200_2",
            "name": "吉阳区",
            "center": [
              109.5083,
              18.2479
            ]
          },
          {
            "code": "460200_3",
            "name": "天涯区",
            "center": [
              109.5083,
              18.2479
            ]
          },
          {
            "code": "460200_4",
            "name": "崖州区",
            "center": [
              109.5083,
              18.2479
            ]
          }
        ]
      },
      {
        "code": "460300",
        "name": "三沙市",
        "center": [
          112.3488,
          16.8383
        ],
        "children": [
          {
            "code": "460300_ALL",
            "name": "全区全域",
            "center": [
              112.3488,
              16.8383
            ]
          },
          {
            "code": "460300_1",
            "name": "西沙群岛",
            "center": [
              112.3488,
              16.8383
            ]
          },
          {
            "code": "460300_2",
            "name": "南沙群岛",
            "center": [
              112.3488,
              16.8383
            ]
          },
          {
            "code": "460300_3",
            "name": "中沙群岛",
            "center": [
              112.3488,
              16.8383
            ]
          }
        ]
      },
      {
        "code": "460400",
        "name": "儋州市",
        "center": [
          109.5768,
          19.5175
        ],
        "children": [
          {
            "code": "460400_ALL",
            "name": "全区全域",
            "center": [
              109.5768,
              19.5175
            ]
          },
          {
            "code": "460400_1",
            "name": "那大镇",
            "center": [
              109.5768,
              19.5175
            ]
          },
          {
            "code": "460400_2",
            "name": "白马井镇",
            "center": [
              109.5768,
              19.5175
            ]
          },
          {
            "code": "460400_3",
            "name": "洋浦经济开发区",
            "center": [
              109.5768,
              19.5175
            ]
          }
        ]
      },
      {
        "code": "460500",
        "name": "省直辖县级行政单位",
        "center": [
          110.4668,
          19.2462
        ],
        "children": [
          {
            "code": "460500_ALL",
            "name": "全区全域",
            "center": [
              110.4668,
              19.2462
            ]
          },
          {
            "code": "460500_1",
            "name": "五指山市",
            "center": [
              110.4668,
              19.2462
            ]
          },
          {
            "code": "460500_2",
            "name": "琼海市",
            "center": [
              110.4668,
              19.2462
            ]
          },
          {
            "code": "460500_3",
            "name": "文昌市",
            "center": [
              110.4668,
              19.2462
            ]
          },
          {
            "code": "460500_4",
            "name": "万宁市",
            "center": [
              110.4668,
              19.2462
            ]
          },
          {
            "code": "460500_5",
            "name": "东方市",
            "center": [
              110.4668,
              19.2462
            ]
          },
          {
            "code": "460500_6",
            "name": "定安县",
            "center": [
              110.4668,
              19.2462
            ]
          },
          {
            "code": "460500_7",
            "name": "屯昌县",
            "center": [
              110.4668,
              19.2462
            ]
          },
          {
            "code": "460500_8",
            "name": "澄迈县",
            "center": [
              110.4668,
              19.2462
            ]
          },
          {
            "code": "460500_9",
            "name": "临高县",
            "center": [
              110.4668,
              19.2462
            ]
          },
          {
            "code": "460500_10",
            "name": "白沙县",
            "center": [
              110.4668,
              19.2462
            ]
          },
          {
            "code": "460500_11",
            "name": "昌江县",
            "center": [
              110.4668,
              19.2462
            ]
          },
          {
            "code": "460500_12",
            "name": "乐东县",
            "center": [
              110.4668,
              19.2462
            ]
          },
          {
            "code": "460500_13",
            "name": "陵水县",
            "center": [
              110.4668,
              19.2462
            ]
          },
          {
            "code": "460500_14",
            "name": "保亭县",
            "center": [
              110.4668,
              19.2462
            ]
          },
          {
            "code": "460500_15",
            "name": "琼中县",
            "center": [
              110.4668,
              19.2462
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "520000",
    "name": "贵州省",
    "center": [
      106.7135,
      26.5783
    ],
    "children": [
      {
        "code": "520000_ALL",
        "name": "全省范围",
        "center": [
          106.7135,
          26.5783
        ],
        "children": [
          {
            "code": "520000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              106.7135,
              26.5783
            ]
          }
        ]
      },
      {
        "code": "520100",
        "name": "贵阳市",
        "center": [
          106.7135,
          26.5783
        ],
        "children": [
          {
            "code": "520100_ALL",
            "name": "全区全域",
            "center": [
              106.7135,
              26.5783
            ]
          },
          {
            "code": "520100_1",
            "name": "南明区",
            "center": [
              106.7135,
              26.5783
            ]
          },
          {
            "code": "520100_2",
            "name": "云岩区",
            "center": [
              106.7135,
              26.5783
            ]
          },
          {
            "code": "520100_3",
            "name": "花溪区",
            "center": [
              106.7135,
              26.5783
            ]
          },
          {
            "code": "520100_4",
            "name": "乌当区",
            "center": [
              106.7135,
              26.5783
            ]
          },
          {
            "code": "520100_5",
            "name": "白云区",
            "center": [
              106.7135,
              26.5783
            ]
          },
          {
            "code": "520100_6",
            "name": "观山湖区",
            "center": [
              106.7135,
              26.5783
            ]
          },
          {
            "code": "520100_7",
            "name": "开阳县",
            "center": [
              106.7135,
              26.5783
            ]
          },
          {
            "code": "520100_8",
            "name": "息烽县",
            "center": [
              106.7135,
              26.5783
            ]
          },
          {
            "code": "520100_9",
            "name": "修文县",
            "center": [
              106.7135,
              26.5783
            ]
          },
          {
            "code": "520100_10",
            "name": "清镇市",
            "center": [
              106.7135,
              26.5783
            ]
          }
        ]
      },
      {
        "code": "520200",
        "name": "六盘水市",
        "center": [
          104.8467,
          26.5846
        ],
        "children": [
          {
            "code": "520200_ALL",
            "name": "全区全域",
            "center": [
              104.8467,
              26.5846
            ]
          },
          {
            "code": "520200_1",
            "name": "钟山区",
            "center": [
              104.8467,
              26.5846
            ]
          },
          {
            "code": "520200_2",
            "name": "水城区",
            "center": [
              104.8467,
              26.5846
            ]
          },
          {
            "code": "520200_3",
            "name": "六枝特区",
            "center": [
              104.8467,
              26.5846
            ]
          },
          {
            "code": "520200_4",
            "name": "盘州市",
            "center": [
              104.8467,
              26.5846
            ]
          }
        ]
      },
      {
        "code": "520300",
        "name": "遵义市",
        "center": [
          106.9373,
          27.7066
        ],
        "children": [
          {
            "code": "520300_ALL",
            "name": "全区全域",
            "center": [
              106.9373,
              27.7066
            ]
          },
          {
            "code": "520300_1",
            "name": "红花岗区",
            "center": [
              106.9373,
              27.7066
            ]
          },
          {
            "code": "520300_2",
            "name": "汇川区",
            "center": [
              106.9373,
              27.7066
            ]
          },
          {
            "code": "520300_3",
            "name": "播州区",
            "center": [
              106.9373,
              27.7066
            ]
          },
          {
            "code": "520300_4",
            "name": "桐梓县",
            "center": [
              106.9373,
              27.7066
            ]
          },
          {
            "code": "520300_5",
            "name": "绥阳县",
            "center": [
              106.9373,
              27.7066
            ]
          },
          {
            "code": "520300_6",
            "name": "正安县",
            "center": [
              106.9373,
              27.7066
            ]
          },
          {
            "code": "520300_7",
            "name": "道真仡佬族苗族自治县",
            "center": [
              106.9373,
              27.7066
            ]
          },
          {
            "code": "520300_8",
            "name": "务川仡佬族苗族自治县",
            "center": [
              106.9373,
              27.7066
            ]
          },
          {
            "code": "520300_9",
            "name": "凤冈县",
            "center": [
              106.9373,
              27.7066
            ]
          },
          {
            "code": "520300_10",
            "name": "湄潭县",
            "center": [
              106.9373,
              27.7066
            ]
          },
          {
            "code": "520300_11",
            "name": "余庆县",
            "center": [
              106.9373,
              27.7066
            ]
          },
          {
            "code": "520300_12",
            "name": "习水县",
            "center": [
              106.9373,
              27.7066
            ]
          },
          {
            "code": "520300_13",
            "name": "赤水市",
            "center": [
              106.9373,
              27.7066
            ]
          },
          {
            "code": "520300_14",
            "name": "仁怀市",
            "center": [
              106.9373,
              27.7066
            ]
          }
        ]
      },
      {
        "code": "520400",
        "name": "安顺市",
        "center": [
          105.9322,
          26.2455
        ],
        "children": [
          {
            "code": "520400_ALL",
            "name": "全区全域",
            "center": [
              105.9322,
              26.2455
            ]
          },
          {
            "code": "520400_1",
            "name": "西秀区",
            "center": [
              105.9322,
              26.2455
            ]
          },
          {
            "code": "520400_2",
            "name": "平坝区",
            "center": [
              105.9322,
              26.2455
            ]
          },
          {
            "code": "520400_3",
            "name": "普定县",
            "center": [
              105.9322,
              26.2455
            ]
          },
          {
            "code": "520400_4",
            "name": "镇宁布依族苗族自治县",
            "center": [
              105.9322,
              26.2455
            ]
          },
          {
            "code": "520400_5",
            "name": "关岭布依族苗族自治县",
            "center": [
              105.9322,
              26.2455
            ]
          },
          {
            "code": "520400_6",
            "name": "紫云苗族布依族自治县",
            "center": [
              105.9322,
              26.2455
            ]
          }
        ]
      },
      {
        "code": "520500",
        "name": "毕节市",
        "center": [
          105.285,
          27.3017
        ],
        "children": [
          {
            "code": "520500_ALL",
            "name": "全区全域",
            "center": [
              105.285,
              27.3017
            ]
          },
          {
            "code": "520500_1",
            "name": "七星关区",
            "center": [
              105.285,
              27.3017
            ]
          },
          {
            "code": "520500_2",
            "name": "赫章县",
            "center": [
              105.285,
              27.3017
            ]
          },
          {
            "code": "520500_3",
            "name": "威宁彝族回族苗族自治县",
            "center": [
              105.285,
              27.3017
            ]
          },
          {
            "code": "520500_4",
            "name": "纳雍县",
            "center": [
              105.285,
              27.3017
            ]
          },
          {
            "code": "520500_5",
            "name": "织金县",
            "center": [
              105.285,
              27.3017
            ]
          },
          {
            "code": "520500_6",
            "name": "黔西市",
            "center": [
              105.285,
              27.3017
            ]
          },
          {
            "code": "520500_7",
            "name": "金沙县",
            "center": [
              105.285,
              27.3017
            ]
          },
          {
            "code": "520500_8",
            "name": "大方县",
            "center": [
              105.285,
              27.3017
            ]
          }
        ]
      },
      {
        "code": "520600",
        "name": "铜仁市",
        "center": [
          109.1916,
          27.7183
        ],
        "children": [
          {
            "code": "520600_ALL",
            "name": "全区全域",
            "center": [
              109.1916,
              27.7183
            ]
          },
          {
            "code": "520600_1",
            "name": "碧江区",
            "center": [
              109.1916,
              27.7183
            ]
          },
          {
            "code": "520600_2",
            "name": "万山区",
            "center": [
              109.1916,
              27.7183
            ]
          },
          {
            "code": "520600_3",
            "name": "江口县",
            "center": [
              109.1916,
              27.7183
            ]
          },
          {
            "code": "520600_4",
            "name": "玉屏侗族自治县",
            "center": [
              109.1916,
              27.7183
            ]
          },
          {
            "code": "520600_5",
            "name": "石阡县",
            "center": [
              109.1916,
              27.7183
            ]
          },
          {
            "code": "520600_6",
            "name": "思南县",
            "center": [
              109.1916,
              27.7183
            ]
          },
          {
            "code": "520600_7",
            "name": "印江土家族苗族自治县",
            "center": [
              109.1916,
              27.7183
            ]
          },
          {
            "code": "520600_8",
            "name": "德江县",
            "center": [
              109.1916,
              27.7183
            ]
          },
          {
            "code": "520600_9",
            "name": "沿河土家族自治县",
            "center": [
              109.1916,
              27.7183
            ]
          },
          {
            "code": "520600_10",
            "name": "松桃苗族自治县",
            "center": [
              109.1916,
              27.7183
            ]
          }
        ]
      },
      {
        "code": "520700",
        "name": "黔西南布依族苗族自治州",
        "center": [
          104.8979,
          25.0881
        ],
        "children": [
          {
            "code": "520700_ALL",
            "name": "全区全域",
            "center": [
              104.8979,
              25.0881
            ]
          },
          {
            "code": "520700_1",
            "name": "兴义市",
            "center": [
              104.8979,
              25.0881
            ]
          },
          {
            "code": "520700_2",
            "name": "兴仁市",
            "center": [
              104.8979,
              25.0881
            ]
          },
          {
            "code": "520700_3",
            "name": "普安县",
            "center": [
              104.8979,
              25.0881
            ]
          },
          {
            "code": "520700_4",
            "name": "晴隆县",
            "center": [
              104.8979,
              25.0881
            ]
          },
          {
            "code": "520700_5",
            "name": "贞丰县",
            "center": [
              104.8979,
              25.0881
            ]
          },
          {
            "code": "520700_6",
            "name": "望谟县",
            "center": [
              104.8979,
              25.0881
            ]
          },
          {
            "code": "520700_7",
            "name": "册亨县",
            "center": [
              104.8979,
              25.0881
            ]
          },
          {
            "code": "520700_8",
            "name": "安龙县",
            "center": [
              104.8979,
              25.0881
            ]
          }
        ]
      },
      {
        "code": "520800",
        "name": "黔东南苗族侗族自治州",
        "center": [
          107.9775,
          26.5833
        ],
        "children": [
          {
            "code": "520800_ALL",
            "name": "全区全域",
            "center": [
              107.9775,
              26.5833
            ]
          },
          {
            "code": "520800_1",
            "name": "凯里市",
            "center": [
              107.9775,
              26.5833
            ]
          },
          {
            "code": "520800_2",
            "name": "黄平县",
            "center": [
              107.9775,
              26.5833
            ]
          },
          {
            "code": "520800_3",
            "name": "施秉县",
            "center": [
              107.9775,
              26.5833
            ]
          },
          {
            "code": "520800_4",
            "name": "三穗县",
            "center": [
              107.9775,
              26.5833
            ]
          },
          {
            "code": "520800_5",
            "name": "镇远县",
            "center": [
              107.9775,
              26.5833
            ]
          },
          {
            "code": "520800_6",
            "name": "岑巩县",
            "center": [
              107.9775,
              26.5833
            ]
          },
          {
            "code": "520800_7",
            "name": "天柱县",
            "center": [
              107.9775,
              26.5833
            ]
          },
          {
            "code": "520800_8",
            "name": "锦屏县",
            "center": [
              107.9775,
              26.5833
            ]
          },
          {
            "code": "520800_9",
            "name": "剑河县",
            "center": [
              107.9775,
              26.5833
            ]
          },
          {
            "code": "520800_10",
            "name": "台江县",
            "center": [
              107.9775,
              26.5833
            ]
          },
          {
            "code": "520800_11",
            "name": "黎平县",
            "center": [
              107.9775,
              26.5833
            ]
          },
          {
            "code": "520800_12",
            "name": "榕江县",
            "center": [
              107.9775,
              26.5833
            ]
          },
          {
            "code": "520800_13",
            "name": "从江县",
            "center": [
              107.9775,
              26.5833
            ]
          },
          {
            "code": "520800_14",
            "name": "雷山县",
            "center": [
              107.9775,
              26.5833
            ]
          },
          {
            "code": "520800_15",
            "name": "麻江县",
            "center": [
              107.9775,
              26.5833
            ]
          },
          {
            "code": "520800_16",
            "name": "丹寨县",
            "center": [
              107.9775,
              26.5833
            ]
          }
        ]
      },
      {
        "code": "520900",
        "name": "黔南布依族苗族自治州",
        "center": [
          107.5172,
          26.2582
        ],
        "children": [
          {
            "code": "520900_ALL",
            "name": "全区全域",
            "center": [
              107.5172,
              26.2582
            ]
          },
          {
            "code": "520900_1",
            "name": "都匀市",
            "center": [
              107.5172,
              26.2582
            ]
          },
          {
            "code": "520900_2",
            "name": "福泉市",
            "center": [
              107.5172,
              26.2582
            ]
          },
          {
            "code": "520900_3",
            "name": "荔波县",
            "center": [
              107.5172,
              26.2582
            ]
          },
          {
            "code": "520900_4",
            "name": "贵定县",
            "center": [
              107.5172,
              26.2582
            ]
          },
          {
            "code": "520900_5",
            "name": "瓮安县",
            "center": [
              107.5172,
              26.2582
            ]
          },
          {
            "code": "520900_6",
            "name": "独山县",
            "center": [
              107.5172,
              26.2582
            ]
          },
          {
            "code": "520900_7",
            "name": "平塘县",
            "center": [
              107.5172,
              26.2582
            ]
          },
          {
            "code": "520900_8",
            "name": "罗甸县",
            "center": [
              107.5172,
              26.2582
            ]
          },
          {
            "code": "520900_9",
            "name": "长顺县",
            "center": [
              107.5172,
              26.2582
            ]
          },
          {
            "code": "520900_10",
            "name": "龙里县",
            "center": [
              107.5172,
              26.2582
            ]
          },
          {
            "code": "520900_11",
            "name": "惠水县",
            "center": [
              107.5172,
              26.2582
            ]
          },
          {
            "code": "520900_12",
            "name": "三都水族自治县",
            "center": [
              107.5172,
              26.2582
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "530000",
    "name": "云南省",
    "center": [
      102.7123,
      25.0406
    ],
    "children": [
      {
        "code": "530000_ALL",
        "name": "全省范围",
        "center": [
          102.7123,
          25.0406
        ],
        "children": [
          {
            "code": "530000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              102.7123,
              25.0406
            ]
          }
        ]
      },
      {
        "code": "530100",
        "name": "昆明市",
        "center": [
          102.7123,
          25.0406
        ],
        "children": [
          {
            "code": "530100_ALL",
            "name": "全区全域",
            "center": [
              102.7123,
              25.0406
            ]
          },
          {
            "code": "530100_1",
            "name": "五华区",
            "center": [
              102.7123,
              25.0406
            ]
          },
          {
            "code": "530100_2",
            "name": "盘龙区",
            "center": [
              102.7123,
              25.0406
            ]
          },
          {
            "code": "530100_3",
            "name": "官渡区",
            "center": [
              102.7123,
              25.0406
            ]
          },
          {
            "code": "530100_4",
            "name": "西山区",
            "center": [
              102.7123,
              25.0406
            ]
          },
          {
            "code": "530100_5",
            "name": "东川区",
            "center": [
              102.7123,
              25.0406
            ]
          },
          {
            "code": "530100_6",
            "name": "呈贡区",
            "center": [
              102.7123,
              25.0406
            ]
          },
          {
            "code": "530100_7",
            "name": "晋宁区",
            "center": [
              102.7123,
              25.0406
            ]
          },
          {
            "code": "530100_8",
            "name": "富民县",
            "center": [
              102.7123,
              25.0406
            ]
          },
          {
            "code": "530100_9",
            "name": "宜良县",
            "center": [
              102.7123,
              25.0406
            ]
          },
          {
            "code": "530100_10",
            "name": "石林彝族自治县",
            "center": [
              102.7123,
              25.0406
            ]
          },
          {
            "code": "530100_11",
            "name": "嵩明县",
            "center": [
              102.7123,
              25.0406
            ]
          },
          {
            "code": "530100_12",
            "name": "禄劝彝族苗族自治县",
            "center": [
              102.7123,
              25.0406
            ]
          },
          {
            "code": "530100_13",
            "name": "寻甸回族彝族自治县",
            "center": [
              102.7123,
              25.0406
            ]
          },
          {
            "code": "530100_14",
            "name": "安宁市",
            "center": [
              102.7123,
              25.0406
            ]
          }
        ]
      },
      {
        "code": "530200",
        "name": "曲靖市",
        "center": [
          103.7979,
          25.4904
        ],
        "children": [
          {
            "code": "530200_ALL",
            "name": "全区全域",
            "center": [
              103.7979,
              25.4904
            ]
          },
          {
            "code": "530200_1",
            "name": "麒麟区",
            "center": [
              103.7979,
              25.4904
            ]
          },
          {
            "code": "530200_2",
            "name": "沾益区",
            "center": [
              103.7979,
              25.4904
            ]
          },
          {
            "code": "530200_3",
            "name": "马龙区",
            "center": [
              103.7979,
              25.4904
            ]
          },
          {
            "code": "530200_4",
            "name": "陆良县",
            "center": [
              103.7979,
              25.4904
            ]
          },
          {
            "code": "530200_5",
            "name": "师宗县",
            "center": [
              103.7979,
              25.4904
            ]
          },
          {
            "code": "530200_6",
            "name": "罗平县",
            "center": [
              103.7979,
              25.4904
            ]
          },
          {
            "code": "530200_7",
            "name": "富源县",
            "center": [
              103.7979,
              25.4904
            ]
          },
          {
            "code": "530200_8",
            "name": "会泽县",
            "center": [
              103.7979,
              25.4904
            ]
          },
          {
            "code": "530200_9",
            "name": "宣威市",
            "center": [
              103.7979,
              25.4904
            ]
          }
        ]
      },
      {
        "code": "530300",
        "name": "玉溪市",
        "center": [
          102.5439,
          24.3505
        ],
        "children": [
          {
            "code": "530300_ALL",
            "name": "全区全域",
            "center": [
              102.5439,
              24.3505
            ]
          },
          {
            "code": "530300_1",
            "name": "红塔区",
            "center": [
              102.5439,
              24.3505
            ]
          },
          {
            "code": "530300_2",
            "name": "江川区",
            "center": [
              102.5439,
              24.3505
            ]
          },
          {
            "code": "530300_3",
            "name": "通海县",
            "center": [
              102.5439,
              24.3505
            ]
          },
          {
            "code": "530300_4",
            "name": "华宁县",
            "center": [
              102.5439,
              24.3505
            ]
          },
          {
            "code": "530300_5",
            "name": "易门县",
            "center": [
              102.5439,
              24.3505
            ]
          },
          {
            "code": "530300_6",
            "name": "峨山彝族自治县",
            "center": [
              102.5439,
              24.3505
            ]
          },
          {
            "code": "530300_7",
            "name": "新平彝族傣族自治县",
            "center": [
              102.5439,
              24.3505
            ]
          },
          {
            "code": "530300_8",
            "name": "元江哈尼族彝族傣族自治县",
            "center": [
              102.5439,
              24.3505
            ]
          },
          {
            "code": "530300_9",
            "name": "澄江市",
            "center": [
              102.5439,
              24.3505
            ]
          }
        ]
      },
      {
        "code": "530400",
        "name": "保山市",
        "center": [
          99.1671,
          25.1118
        ],
        "children": [
          {
            "code": "530400_ALL",
            "name": "全区全域",
            "center": [
              99.1671,
              25.1118
            ]
          },
          {
            "code": "530400_1",
            "name": "隆阳区",
            "center": [
              99.1671,
              25.1118
            ]
          },
          {
            "code": "530400_2",
            "name": "施甸县",
            "center": [
              99.1671,
              25.1118
            ]
          },
          {
            "code": "530400_3",
            "name": "龙陵县",
            "center": [
              99.1671,
              25.1118
            ]
          },
          {
            "code": "530400_4",
            "name": "昌宁县",
            "center": [
              99.1671,
              25.1118
            ]
          },
          {
            "code": "530400_5",
            "name": "腾冲市",
            "center": [
              99.1671,
              25.1118
            ]
          }
        ]
      },
      {
        "code": "530500",
        "name": "昭通市",
        "center": [
          103.7172,
          27.337
        ],
        "children": [
          {
            "code": "530500_ALL",
            "name": "全区全域",
            "center": [
              103.7172,
              27.337
            ]
          },
          {
            "code": "530500_1",
            "name": "昭阳区",
            "center": [
              103.7172,
              27.337
            ]
          },
          {
            "code": "530500_2",
            "name": "鲁甸县",
            "center": [
              103.7172,
              27.337
            ]
          },
          {
            "code": "530500_3",
            "name": "巧家县",
            "center": [
              103.7172,
              27.337
            ]
          },
          {
            "code": "530500_4",
            "name": "盐津县",
            "center": [
              103.7172,
              27.337
            ]
          },
          {
            "code": "530500_5",
            "name": "大关县",
            "center": [
              103.7172,
              27.337
            ]
          },
          {
            "code": "530500_6",
            "name": "永善县",
            "center": [
              103.7172,
              27.337
            ]
          },
          {
            "code": "530500_7",
            "name": "绥江县",
            "center": [
              103.7172,
              27.337
            ]
          },
          {
            "code": "530500_8",
            "name": "镇雄县",
            "center": [
              103.7172,
              27.337
            ]
          },
          {
            "code": "530500_9",
            "name": "彝良县",
            "center": [
              103.7172,
              27.337
            ]
          },
          {
            "code": "530500_10",
            "name": "威信县",
            "center": [
              103.7172,
              27.337
            ]
          },
          {
            "code": "530500_11",
            "name": "水富市",
            "center": [
              103.7172,
              27.337
            ]
          }
        ]
      },
      {
        "code": "530600",
        "name": "丽江市",
        "center": [
          100.233,
          26.8721
        ],
        "children": [
          {
            "code": "530600_ALL",
            "name": "全区全域",
            "center": [
              100.233,
              26.8721
            ]
          },
          {
            "code": "530600_1",
            "name": "古城区",
            "center": [
              100.233,
              26.8721
            ]
          },
          {
            "code": "530600_2",
            "name": "玉龙纳西族自治县",
            "center": [
              100.233,
              26.8721
            ]
          },
          {
            "code": "530600_3",
            "name": "永胜县",
            "center": [
              100.233,
              26.8721
            ]
          },
          {
            "code": "530600_4",
            "name": "华坪县",
            "center": [
              100.233,
              26.8721
            ]
          },
          {
            "code": "530600_5",
            "name": "宁蒗彝族自治县",
            "center": [
              100.233,
              26.8721
            ]
          }
        ]
      },
      {
        "code": "530700",
        "name": "普洱市",
        "center": [
          100.9723,
          22.7773
        ],
        "children": [
          {
            "code": "530700_ALL",
            "name": "全区全域",
            "center": [
              100.9723,
              22.7773
            ]
          },
          {
            "code": "530700_1",
            "name": "思茅区",
            "center": [
              100.9723,
              22.7773
            ]
          },
          {
            "code": "530700_2",
            "name": "宁洱哈尼族彝族自治县",
            "center": [
              100.9723,
              22.7773
            ]
          },
          {
            "code": "530700_3",
            "name": "墨江哈尼族自治县",
            "center": [
              100.9723,
              22.7773
            ]
          },
          {
            "code": "530700_4",
            "name": "景东彝族自治县",
            "center": [
              100.9723,
              22.7773
            ]
          },
          {
            "code": "530700_5",
            "name": "景谷傣族彝族自治县",
            "center": [
              100.9723,
              22.7773
            ]
          },
          {
            "code": "530700_6",
            "name": "镇沅彝族哈尼族拉祜族自治县",
            "center": [
              100.9723,
              22.7773
            ]
          },
          {
            "code": "530700_7",
            "name": "江城哈尼族彝族自治县",
            "center": [
              100.9723,
              22.7773
            ]
          },
          {
            "code": "530700_8",
            "name": "孟连傣族拉祜族佤族自治县",
            "center": [
              100.9723,
              22.7773
            ]
          },
          {
            "code": "530700_9",
            "name": "澜沧拉祜族自治县",
            "center": [
              100.9723,
              22.7773
            ]
          },
          {
            "code": "530700_10",
            "name": "西盟佤族自治县",
            "center": [
              100.9723,
              22.7773
            ]
          }
        ]
      },
      {
        "code": "530800",
        "name": "临沧市",
        "center": [
          100.0869,
          23.8866
        ],
        "children": [
          {
            "code": "530800_ALL",
            "name": "全区全域",
            "center": [
              100.0869,
              23.8866
            ]
          },
          {
            "code": "530800_1",
            "name": "临翔区",
            "center": [
              100.0869,
              23.8866
            ]
          },
          {
            "code": "530800_2",
            "name": "凤庆县",
            "center": [
              100.0869,
              23.8866
            ]
          },
          {
            "code": "530800_3",
            "name": "云县",
            "center": [
              100.0869,
              23.8866
            ]
          },
          {
            "code": "530800_4",
            "name": "永德县",
            "center": [
              100.0869,
              23.8866
            ]
          },
          {
            "code": "530800_5",
            "name": "镇康县",
            "center": [
              100.0869,
              23.8866
            ]
          },
          {
            "code": "530800_6",
            "name": "双江拉祜族佤族布朗族傣族自治县",
            "center": [
              100.0869,
              23.8866
            ]
          },
          {
            "code": "530800_7",
            "name": "耿马傣族佤族自治县",
            "center": [
              100.0869,
              23.8866
            ]
          },
          {
            "code": "530800_8",
            "name": "沧源佤族自治县",
            "center": [
              100.0869,
              23.8866
            ]
          }
        ]
      },
      {
        "code": "530900",
        "name": "楚雄彝族自治州",
        "center": [
          101.546,
          25.0329
        ],
        "children": [
          {
            "code": "530900_ALL",
            "name": "全区全域",
            "center": [
              101.546,
              25.0329
            ]
          },
          {
            "code": "530900_1",
            "name": "楚雄市",
            "center": [
              101.546,
              25.0329
            ]
          },
          {
            "code": "530900_2",
            "name": "禄丰市",
            "center": [
              101.546,
              25.0329
            ]
          },
          {
            "code": "530900_3",
            "name": "双柏县",
            "center": [
              101.546,
              25.0329
            ]
          },
          {
            "code": "530900_4",
            "name": "牟定县",
            "center": [
              101.546,
              25.0329
            ]
          },
          {
            "code": "530900_5",
            "name": "南华县",
            "center": [
              101.546,
              25.0329
            ]
          },
          {
            "code": "530900_6",
            "name": "姚安县",
            "center": [
              101.546,
              25.0329
            ]
          },
          {
            "code": "530900_7",
            "name": "大姚县",
            "center": [
              101.546,
              25.0329
            ]
          },
          {
            "code": "530900_8",
            "name": "永仁县",
            "center": [
              101.546,
              25.0329
            ]
          },
          {
            "code": "530900_9",
            "name": "元谋县",
            "center": [
              101.546,
              25.0329
            ]
          },
          {
            "code": "530900_10",
            "name": "武定县",
            "center": [
              101.546,
              25.0329
            ]
          }
        ]
      },
      {
        "code": "531000",
        "name": "红河哈尼族彝族自治州",
        "center": [
          103.3841,
          23.3668
        ],
        "children": [
          {
            "code": "531000_ALL",
            "name": "全区全域",
            "center": [
              103.3841,
              23.3668
            ]
          },
          {
            "code": "531000_1",
            "name": "蒙自市",
            "center": [
              103.3841,
              23.3668
            ]
          },
          {
            "code": "531000_2",
            "name": "个旧市",
            "center": [
              103.3841,
              23.3668
            ]
          },
          {
            "code": "531000_3",
            "name": "开远市",
            "center": [
              103.3841,
              23.3668
            ]
          },
          {
            "code": "531000_4",
            "name": "弥勒市",
            "center": [
              103.3841,
              23.3668
            ]
          },
          {
            "code": "531000_5",
            "name": "建水县",
            "center": [
              103.3841,
              23.3668
            ]
          },
          {
            "code": "531000_6",
            "name": "石屏县",
            "center": [
              103.3841,
              23.3668
            ]
          },
          {
            "code": "531000_7",
            "name": "泸西县",
            "center": [
              103.3841,
              23.3668
            ]
          },
          {
            "code": "531000_8",
            "name": "元阳县",
            "center": [
              103.3841,
              23.3668
            ]
          },
          {
            "code": "531000_9",
            "name": "红河县",
            "center": [
              103.3841,
              23.3668
            ]
          },
          {
            "code": "531000_10",
            "name": "金平苗族瑶族傣族自治县",
            "center": [
              103.3841,
              23.3668
            ]
          },
          {
            "code": "531000_11",
            "name": "绿春县",
            "center": [
              103.3841,
              23.3668
            ]
          },
          {
            "code": "531000_12",
            "name": "河口瑶族自治县",
            "center": [
              103.3841,
              23.3668
            ]
          },
          {
            "code": "531000_13",
            "name": "屏边苗族自治县",
            "center": [
              103.3841,
              23.3668
            ]
          }
        ]
      },
      {
        "code": "531100",
        "name": "文山壮族苗族自治州",
        "center": [
          104.2442,
          23.3695
        ],
        "children": [
          {
            "code": "531100_ALL",
            "name": "全区全域",
            "center": [
              104.2442,
              23.3695
            ]
          },
          {
            "code": "531100_1",
            "name": "文山市",
            "center": [
              104.2442,
              23.3695
            ]
          },
          {
            "code": "531100_2",
            "name": "砚山县",
            "center": [
              104.2442,
              23.3695
            ]
          },
          {
            "code": "531100_3",
            "name": "西畴县",
            "center": [
              104.2442,
              23.3695
            ]
          },
          {
            "code": "531100_4",
            "name": "麻栗坡县",
            "center": [
              104.2442,
              23.3695
            ]
          },
          {
            "code": "531100_5",
            "name": "马关县",
            "center": [
              104.2442,
              23.3695
            ]
          },
          {
            "code": "531100_6",
            "name": "丘北县",
            "center": [
              104.2442,
              23.3695
            ]
          },
          {
            "code": "531100_7",
            "name": "广南县",
            "center": [
              104.2442,
              23.3695
            ]
          },
          {
            "code": "531100_8",
            "name": "富宁县",
            "center": [
              104.2442,
              23.3695
            ]
          }
        ]
      },
      {
        "code": "531200",
        "name": "西双版纳傣族自治州",
        "center": [
          100.7979,
          22.0017
        ],
        "children": [
          {
            "code": "531200_ALL",
            "name": "全区全域",
            "center": [
              100.7979,
              22.0017
            ]
          },
          {
            "code": "531200_1",
            "name": "景洪市",
            "center": [
              100.7979,
              22.0017
            ]
          },
          {
            "code": "531200_2",
            "name": "勐海县",
            "center": [
              100.7979,
              22.0017
            ]
          },
          {
            "code": "531200_3",
            "name": "勐腊县",
            "center": [
              100.7979,
              22.0017
            ]
          }
        ]
      },
      {
        "code": "531300",
        "name": "大理白族自治州",
        "center": [
          100.2257,
          25.5894
        ],
        "children": [
          {
            "code": "531300_ALL",
            "name": "全区全域",
            "center": [
              100.2257,
              25.5894
            ]
          },
          {
            "code": "531300_1",
            "name": "大理市",
            "center": [
              100.2257,
              25.5894
            ]
          },
          {
            "code": "531300_2",
            "name": "祥云县",
            "center": [
              100.2257,
              25.5894
            ]
          },
          {
            "code": "531300_3",
            "name": "宾川县",
            "center": [
              100.2257,
              25.5894
            ]
          },
          {
            "code": "531300_4",
            "name": "弥渡县",
            "center": [
              100.2257,
              25.5894
            ]
          },
          {
            "code": "531300_5",
            "name": "永平县",
            "center": [
              100.2257,
              25.5894
            ]
          },
          {
            "code": "531300_6",
            "name": "云龙县",
            "center": [
              100.2257,
              25.5894
            ]
          },
          {
            "code": "531300_7",
            "name": "洱源县",
            "center": [
              100.2257,
              25.5894
            ]
          },
          {
            "code": "531300_8",
            "name": "剑川县",
            "center": [
              100.2257,
              25.5894
            ]
          },
          {
            "code": "531300_9",
            "name": "鹤庆县",
            "center": [
              100.2257,
              25.5894
            ]
          },
          {
            "code": "531300_10",
            "name": "漾濞彝族自治县",
            "center": [
              100.2257,
              25.5894
            ]
          },
          {
            "code": "531300_11",
            "name": "南涧彝族自治县",
            "center": [
              100.2257,
              25.5894
            ]
          },
          {
            "code": "531300_12",
            "name": "巍山彝族回族自治县",
            "center": [
              100.2257,
              25.5894
            ]
          }
        ]
      },
      {
        "code": "531400",
        "name": "德宏傣族景颇族自治州",
        "center": [
          98.5784,
          24.4372
        ],
        "children": [
          {
            "code": "531400_ALL",
            "name": "全区全域",
            "center": [
              98.5784,
              24.4372
            ]
          },
          {
            "code": "531400_1",
            "name": "芒市",
            "center": [
              98.5784,
              24.4372
            ]
          },
          {
            "code": "531400_2",
            "name": "瑞丽市",
            "center": [
              98.5784,
              24.4372
            ]
          },
          {
            "code": "531400_3",
            "name": "梁河县",
            "center": [
              98.5784,
              24.4372
            ]
          },
          {
            "code": "531400_4",
            "name": "盈江县",
            "center": [
              98.5784,
              24.4372
            ]
          },
          {
            "code": "531400_5",
            "name": "陇川县",
            "center": [
              98.5784,
              24.4372
            ]
          }
        ]
      },
      {
        "code": "531500",
        "name": "怒江傈僳族自治州",
        "center": [
          98.8543,
          25.8509
        ],
        "children": [
          {
            "code": "531500_ALL",
            "name": "全区全域",
            "center": [
              98.8543,
              25.8509
            ]
          },
          {
            "code": "531500_1",
            "name": "泸水市",
            "center": [
              98.8543,
              25.8509
            ]
          },
          {
            "code": "531500_2",
            "name": "福贡县",
            "center": [
              98.8543,
              25.8509
            ]
          },
          {
            "code": "531500_3",
            "name": "贡山独龙族怒族自治县",
            "center": [
              98.8543,
              25.8509
            ]
          },
          {
            "code": "531500_4",
            "name": "兰坪白族普米族自治县",
            "center": [
              98.8543,
              25.8509
            ]
          }
        ]
      },
      {
        "code": "531600",
        "name": "迪庆藏族自治州",
        "center": [
          99.7065,
          27.8268
        ],
        "children": [
          {
            "code": "531600_ALL",
            "name": "全区全域",
            "center": [
              99.7065,
              27.8268
            ]
          },
          {
            "code": "531600_1",
            "name": "香格里拉市",
            "center": [
              99.7065,
              27.8268
            ]
          },
          {
            "code": "531600_2",
            "name": "德钦县",
            "center": [
              99.7065,
              27.8268
            ]
          },
          {
            "code": "531600_3",
            "name": "维西傈僳族自治县",
            "center": [
              99.7065,
              27.8268
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "540000",
    "name": "西藏自治区",
    "center": [
      91.1322,
      29.6603
    ],
    "children": [
      {
        "code": "540000_ALL",
        "name": "全省范围",
        "center": [
          91.1322,
          29.6603
        ],
        "children": [
          {
            "code": "540000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              91.1322,
              29.6603
            ]
          }
        ]
      },
      {
        "code": "540100",
        "name": "拉萨市",
        "center": [
          91.1322,
          29.6603
        ],
        "children": [
          {
            "code": "540100_ALL",
            "name": "全区全域",
            "center": [
              91.1322,
              29.6603
            ]
          },
          {
            "code": "540100_1",
            "name": "城关区",
            "center": [
              91.1322,
              29.6603
            ]
          },
          {
            "code": "540100_2",
            "name": "堆龙德庆区",
            "center": [
              91.1322,
              29.6603
            ]
          },
          {
            "code": "540100_3",
            "name": "达孜区",
            "center": [
              91.1322,
              29.6603
            ]
          },
          {
            "code": "540100_4",
            "name": "林周县",
            "center": [
              91.1322,
              29.6603
            ]
          },
          {
            "code": "540100_5",
            "name": "当雄县",
            "center": [
              91.1322,
              29.6603
            ]
          },
          {
            "code": "540100_6",
            "name": "尼木县",
            "center": [
              91.1322,
              29.6603
            ]
          },
          {
            "code": "540100_7",
            "name": "曲水县",
            "center": [
              91.1322,
              29.6603
            ]
          },
          {
            "code": "540100_8",
            "name": "墨竹工卡县",
            "center": [
              91.1322,
              29.6603
            ]
          }
        ]
      },
      {
        "code": "540200",
        "name": "日喀则市",
        "center": [
          88.8849,
          29.2638
        ],
        "children": [
          {
            "code": "540200_ALL",
            "name": "全区全域",
            "center": [
              88.8849,
              29.2638
            ]
          },
          {
            "code": "540200_1",
            "name": "桑珠孜区",
            "center": [
              88.8849,
              29.2638
            ]
          },
          {
            "code": "540200_2",
            "name": "南木林县",
            "center": [
              88.8849,
              29.2638
            ]
          },
          {
            "code": "540200_3",
            "name": "江孜县",
            "center": [
              88.8849,
              29.2638
            ]
          },
          {
            "code": "540200_4",
            "name": "定日县",
            "center": [
              88.8849,
              29.2638
            ]
          },
          {
            "code": "540200_5",
            "name": "萨迦县",
            "center": [
              88.8849,
              29.2638
            ]
          },
          {
            "code": "540200_6",
            "name": "拉孜县",
            "center": [
              88.8849,
              29.2638
            ]
          },
          {
            "code": "540200_7",
            "name": "昂仁县",
            "center": [
              88.8849,
              29.2638
            ]
          },
          {
            "code": "540200_8",
            "name": "谢通门县",
            "center": [
              88.8849,
              29.2638
            ]
          },
          {
            "code": "540200_9",
            "name": "白朗县",
            "center": [
              88.8849,
              29.2638
            ]
          },
          {
            "code": "540200_10",
            "name": "仁布县",
            "center": [
              88.8849,
              29.2638
            ]
          },
          {
            "code": "540200_11",
            "name": "康马县",
            "center": [
              88.8849,
              29.2638
            ]
          },
          {
            "code": "540200_12",
            "name": "定结县",
            "center": [
              88.8849,
              29.2638
            ]
          },
          {
            "code": "540200_13",
            "name": "仲巴县",
            "center": [
              88.8849,
              29.2638
            ]
          },
          {
            "code": "540200_14",
            "name": "亚东县",
            "center": [
              88.8849,
              29.2638
            ]
          },
          {
            "code": "540200_15",
            "name": "吉隆县",
            "center": [
              88.8849,
              29.2638
            ]
          },
          {
            "code": "540200_16",
            "name": "聂拉木县",
            "center": [
              88.8849,
              29.2638
            ]
          },
          {
            "code": "540200_17",
            "name": "萨嘎县",
            "center": [
              88.8849,
              29.2638
            ]
          },
          {
            "code": "540200_18",
            "name": "岗巴县",
            "center": [
              88.8849,
              29.2638
            ]
          }
        ]
      },
      {
        "code": "540300",
        "name": "昌都市",
        "center": [
          97.1785,
          31.1369
        ],
        "children": [
          {
            "code": "540300_ALL",
            "name": "全区全域",
            "center": [
              97.1785,
              31.1369
            ]
          },
          {
            "code": "540300_1",
            "name": "卡若区",
            "center": [
              97.1785,
              31.1369
            ]
          },
          {
            "code": "540300_2",
            "name": "江达县",
            "center": [
              97.1785,
              31.1369
            ]
          },
          {
            "code": "540300_3",
            "name": "贡觉县",
            "center": [
              97.1785,
              31.1369
            ]
          },
          {
            "code": "540300_4",
            "name": "类乌齐县",
            "center": [
              97.1785,
              31.1369
            ]
          },
          {
            "code": "540300_5",
            "name": "丁青县",
            "center": [
              97.1785,
              31.1369
            ]
          },
          {
            "code": "540300_6",
            "name": "察雅县",
            "center": [
              97.1785,
              31.1369
            ]
          },
          {
            "code": "540300_7",
            "name": "八宿县",
            "center": [
              97.1785,
              31.1369
            ]
          },
          {
            "code": "540300_8",
            "name": "左贡县",
            "center": [
              97.1785,
              31.1369
            ]
          },
          {
            "code": "540300_9",
            "name": "芒康县",
            "center": [
              97.1785,
              31.1369
            ]
          },
          {
            "code": "540300_10",
            "name": "洛隆县",
            "center": [
              97.1785,
              31.1369
            ]
          },
          {
            "code": "540300_11",
            "name": "边坝县",
            "center": [
              97.1785,
              31.1369
            ]
          }
        ]
      },
      {
        "code": "540400",
        "name": "林芝市",
        "center": [
          94.3621,
          29.6546
        ],
        "children": [
          {
            "code": "540400_ALL",
            "name": "全区全域",
            "center": [
              94.3621,
              29.6546
            ]
          },
          {
            "code": "540400_1",
            "name": "巴宜区",
            "center": [
              94.3621,
              29.6546
            ]
          },
          {
            "code": "540400_2",
            "name": "工布江达县",
            "center": [
              94.3621,
              29.6546
            ]
          },
          {
            "code": "540400_3",
            "name": "米林市",
            "center": [
              94.3621,
              29.6546
            ]
          },
          {
            "code": "540400_4",
            "name": "墨脱县",
            "center": [
              94.3621,
              29.6546
            ]
          },
          {
            "code": "540400_5",
            "name": "波密县",
            "center": [
              94.3621,
              29.6546
            ]
          },
          {
            "code": "540400_6",
            "name": "察隅县",
            "center": [
              94.3621,
              29.6546
            ]
          },
          {
            "code": "540400_7",
            "name": "朗县",
            "center": [
              94.3621,
              29.6546
            ]
          }
        ]
      },
      {
        "code": "540500",
        "name": "山南市",
        "center": [
          91.7665,
          29.2361
        ],
        "children": [
          {
            "code": "540500_ALL",
            "name": "全区全域",
            "center": [
              91.7665,
              29.2361
            ]
          },
          {
            "code": "540500_1",
            "name": "乃东区",
            "center": [
              91.7665,
              29.2361
            ]
          },
          {
            "code": "540500_2",
            "name": "扎囊县",
            "center": [
              91.7665,
              29.2361
            ]
          },
          {
            "code": "540500_3",
            "name": "贡嘎县",
            "center": [
              91.7665,
              29.2361
            ]
          },
          {
            "code": "540500_4",
            "name": "桑日县",
            "center": [
              91.7665,
              29.2361
            ]
          },
          {
            "code": "540500_5",
            "name": "琼结县",
            "center": [
              91.7665,
              29.2361
            ]
          },
          {
            "code": "540500_6",
            "name": "曲松县",
            "center": [
              91.7665,
              29.2361
            ]
          },
          {
            "code": "540500_7",
            "name": "措美县",
            "center": [
              91.7665,
              29.2361
            ]
          },
          {
            "code": "540500_8",
            "name": "洛扎县",
            "center": [
              91.7665,
              29.2361
            ]
          },
          {
            "code": "540500_9",
            "name": "加查县",
            "center": [
              91.7665,
              29.2361
            ]
          },
          {
            "code": "540500_10",
            "name": "隆子县",
            "center": [
              91.7665,
              29.2361
            ]
          },
          {
            "code": "540500_11",
            "name": "错那市",
            "center": [
              91.7665,
              29.2361
            ]
          },
          {
            "code": "540500_12",
            "name": "浪卡子县",
            "center": [
              91.7665,
              29.2361
            ]
          }
        ]
      },
      {
        "code": "540600",
        "name": "那曲市",
        "center": [
          92.0602,
          31.4762
        ],
        "children": [
          {
            "code": "540600_ALL",
            "name": "全区全域",
            "center": [
              92.0602,
              31.4762
            ]
          },
          {
            "code": "540600_1",
            "name": "色尼区",
            "center": [
              92.0602,
              31.4762
            ]
          },
          {
            "code": "540600_2",
            "name": "申扎县",
            "center": [
              92.0602,
              31.4762
            ]
          },
          {
            "code": "540600_3",
            "name": "班戈县",
            "center": [
              92.0602,
              31.4762
            ]
          },
          {
            "code": "540600_4",
            "name": "聂荣县",
            "center": [
              92.0602,
              31.4762
            ]
          },
          {
            "code": "540600_5",
            "name": "安多县",
            "center": [
              92.0602,
              31.4762
            ]
          },
          {
            "code": "540600_6",
            "name": "嘉黎县",
            "center": [
              92.0602,
              31.4762
            ]
          },
          {
            "code": "540600_7",
            "name": "索县",
            "center": [
              92.0602,
              31.4762
            ]
          },
          {
            "code": "540600_8",
            "name": "巴青县",
            "center": [
              92.0602,
              31.4762
            ]
          },
          {
            "code": "540600_9",
            "name": "尼玛县",
            "center": [
              92.0602,
              31.4762
            ]
          },
          {
            "code": "540600_10",
            "name": "双湖县",
            "center": [
              92.0602,
              31.4762
            ]
          }
        ]
      },
      {
        "code": "540700",
        "name": "阿里地区",
        "center": [
          80.1055,
          32.5032
        ],
        "children": [
          {
            "code": "540700_ALL",
            "name": "全区全域",
            "center": [
              80.1055,
              32.5032
            ]
          },
          {
            "code": "540700_1",
            "name": "噶尔县",
            "center": [
              80.1055,
              32.5032
            ]
          },
          {
            "code": "540700_2",
            "name": "普兰县",
            "center": [
              80.1055,
              32.5032
            ]
          },
          {
            "code": "540700_3",
            "name": "札达县",
            "center": [
              80.1055,
              32.5032
            ]
          },
          {
            "code": "540700_4",
            "name": "日土县",
            "center": [
              80.1055,
              32.5032
            ]
          },
          {
            "code": "540700_5",
            "name": "革吉县",
            "center": [
              80.1055,
              32.5032
            ]
          },
          {
            "code": "540700_6",
            "name": "改则县",
            "center": [
              80.1055,
              32.5032
            ]
          },
          {
            "code": "540700_7",
            "name": "措勤县",
            "center": [
              80.1055,
              32.5032
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "620000",
    "name": "甘肃省",
    "center": [
      103.8236,
      36.058
    ],
    "children": [
      {
        "code": "620000_ALL",
        "name": "全省范围",
        "center": [
          103.8236,
          36.058
        ],
        "children": [
          {
            "code": "620000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              103.8236,
              36.058
            ]
          }
        ]
      },
      {
        "code": "620100",
        "name": "兰州市",
        "center": [
          103.8236,
          36.058
        ],
        "children": [
          {
            "code": "620100_ALL",
            "name": "全区全域",
            "center": [
              103.8236,
              36.058
            ]
          },
          {
            "code": "620100_1",
            "name": "城关区",
            "center": [
              103.8236,
              36.058
            ]
          },
          {
            "code": "620100_2",
            "name": "七里河区",
            "center": [
              103.8236,
              36.058
            ]
          },
          {
            "code": "620100_3",
            "name": "西固区",
            "center": [
              103.8236,
              36.058
            ]
          },
          {
            "code": "620100_4",
            "name": "红古区",
            "center": [
              103.8236,
              36.058
            ]
          },
          {
            "code": "620100_5",
            "name": "永登县",
            "center": [
              103.8236,
              36.058
            ]
          },
          {
            "code": "620100_6",
            "name": "皋兰县",
            "center": [
              103.8236,
              36.058
            ]
          },
          {
            "code": "620100_7",
            "name": "榆中县",
            "center": [
              103.8236,
              36.058
            ]
          }
        ]
      },
      {
        "code": "620200",
        "name": "嘉峪关市",
        "center": [
          98.2773,
          39.7732
        ],
        "children": [
          {
            "code": "620200_ALL",
            "name": "全区全域",
            "center": [
              98.2773,
              39.7732
            ]
          },
          {
            "code": "620200_1",
            "name": "雄关街道",
            "center": [
              98.2773,
              39.7732
            ]
          },
          {
            "code": "620200_2",
            "name": "镜铁街道",
            "center": [
              98.2773,
              39.7732
            ]
          },
          {
            "code": "620200_3",
            "name": "长城街道",
            "center": [
              98.2773,
              39.7732
            ]
          }
        ]
      },
      {
        "code": "620300",
        "name": "金昌市",
        "center": [
          102.1879,
          38.5142
        ],
        "children": [
          {
            "code": "620300_ALL",
            "name": "全区全域",
            "center": [
              102.1879,
              38.5142
            ]
          },
          {
            "code": "620300_1",
            "name": "金川区",
            "center": [
              102.1879,
              38.5142
            ]
          },
          {
            "code": "620300_2",
            "name": "永昌县",
            "center": [
              102.1879,
              38.5142
            ]
          }
        ]
      },
      {
        "code": "620400",
        "name": "白银市",
        "center": [
          104.1736,
          36.5456
        ],
        "children": [
          {
            "code": "620400_ALL",
            "name": "全区全域",
            "center": [
              104.1736,
              36.5456
            ]
          },
          {
            "code": "620400_1",
            "name": "白银区",
            "center": [
              104.1736,
              36.5456
            ]
          },
          {
            "code": "620400_2",
            "name": "平川区",
            "center": [
              104.1736,
              36.5456
            ]
          },
          {
            "code": "620400_3",
            "name": "靖远县",
            "center": [
              104.1736,
              36.5456
            ]
          },
          {
            "code": "620400_4",
            "name": "会宁县",
            "center": [
              104.1736,
              36.5456
            ]
          },
          {
            "code": "620400_5",
            "name": "景泰县",
            "center": [
              104.1736,
              36.5456
            ]
          }
        ]
      },
      {
        "code": "620500",
        "name": "天水市",
        "center": [
          105.725,
          34.5815
        ],
        "children": [
          {
            "code": "620500_ALL",
            "name": "全区全域",
            "center": [
              105.725,
              34.5815
            ]
          },
          {
            "code": "620500_1",
            "name": "秦州区",
            "center": [
              105.725,
              34.5815
            ]
          },
          {
            "code": "620500_2",
            "name": "麦积区",
            "center": [
              105.725,
              34.5815
            ]
          },
          {
            "code": "620500_3",
            "name": "清水县",
            "center": [
              105.725,
              34.5815
            ]
          },
          {
            "code": "620500_4",
            "name": "秦安县",
            "center": [
              105.725,
              34.5815
            ]
          },
          {
            "code": "620500_5",
            "name": "甘谷县",
            "center": [
              105.725,
              34.5815
            ]
          },
          {
            "code": "620500_6",
            "name": "武山县",
            "center": [
              105.725,
              34.5815
            ]
          },
          {
            "code": "620500_7",
            "name": "张家川回族自治县",
            "center": [
              105.725,
              34.5815
            ]
          }
        ]
      },
      {
        "code": "620600",
        "name": "武威市",
        "center": [
          102.6371,
          37.9283
        ],
        "children": [
          {
            "code": "620600_ALL",
            "name": "全区全域",
            "center": [
              102.6371,
              37.9283
            ]
          },
          {
            "code": "620600_1",
            "name": "凉州区",
            "center": [
              102.6371,
              37.9283
            ]
          },
          {
            "code": "620600_2",
            "name": "民勤县",
            "center": [
              102.6371,
              37.9283
            ]
          },
          {
            "code": "620600_3",
            "name": "古浪县",
            "center": [
              102.6371,
              37.9283
            ]
          },
          {
            "code": "620600_4",
            "name": "天祝藏族自治县",
            "center": [
              102.6371,
              37.9283
            ]
          }
        ]
      },
      {
        "code": "620700",
        "name": "张掖市",
        "center": [
          100.4555,
          38.9328
        ],
        "children": [
          {
            "code": "620700_ALL",
            "name": "全区全域",
            "center": [
              100.4555,
              38.9328
            ]
          },
          {
            "code": "620700_1",
            "name": "甘州区",
            "center": [
              100.4555,
              38.9328
            ]
          },
          {
            "code": "620700_2",
            "name": "肃南裕固族自治县",
            "center": [
              100.4555,
              38.9328
            ]
          },
          {
            "code": "620700_3",
            "name": "民乐县",
            "center": [
              100.4555,
              38.9328
            ]
          },
          {
            "code": "620700_4",
            "name": "临泽县",
            "center": [
              100.4555,
              38.9328
            ]
          },
          {
            "code": "620700_5",
            "name": "高台县",
            "center": [
              100.4555,
              38.9328
            ]
          },
          {
            "code": "620700_6",
            "name": "山丹县",
            "center": [
              100.4555,
              38.9328
            ]
          }
        ]
      },
      {
        "code": "620800",
        "name": "平凉市",
        "center": [
          106.6846,
          35.5427
        ],
        "children": [
          {
            "code": "620800_ALL",
            "name": "全区全域",
            "center": [
              106.6846,
              35.5427
            ]
          },
          {
            "code": "620800_1",
            "name": "崆峒区",
            "center": [
              106.6846,
              35.5427
            ]
          },
          {
            "code": "620800_2",
            "name": "泾川县",
            "center": [
              106.6846,
              35.5427
            ]
          },
          {
            "code": "620800_3",
            "name": "灵台县",
            "center": [
              106.6846,
              35.5427
            ]
          },
          {
            "code": "620800_4",
            "name": "崇信县",
            "center": [
              106.6846,
              35.5427
            ]
          },
          {
            "code": "620800_5",
            "name": "华亭市",
            "center": [
              106.6846,
              35.5427
            ]
          },
          {
            "code": "620800_6",
            "name": "庄浪县",
            "center": [
              106.6846,
              35.5427
            ]
          },
          {
            "code": "620800_7",
            "name": "静宁县",
            "center": [
              106.6846,
              35.5427
            ]
          }
        ]
      },
      {
        "code": "620900",
        "name": "酒泉市",
        "center": [
          98.5108,
          39.744
        ],
        "children": [
          {
            "code": "620900_ALL",
            "name": "全区全域",
            "center": [
              98.5108,
              39.744
            ]
          },
          {
            "code": "620900_1",
            "name": "肃州区",
            "center": [
              98.5108,
              39.744
            ]
          },
          {
            "code": "620900_2",
            "name": "金塔县",
            "center": [
              98.5108,
              39.744
            ]
          },
          {
            "code": "620900_3",
            "name": "瓜州县",
            "center": [
              98.5108,
              39.744
            ]
          },
          {
            "code": "620900_4",
            "name": "肃北蒙古族自治县",
            "center": [
              98.5108,
              39.744
            ]
          },
          {
            "code": "620900_5",
            "name": "阿克塞哈萨克族自治县",
            "center": [
              98.5108,
              39.744
            ]
          },
          {
            "code": "620900_6",
            "name": "玉门市",
            "center": [
              98.5108,
              39.744
            ]
          },
          {
            "code": "620900_7",
            "name": "敦煌市",
            "center": [
              98.5108,
              39.744
            ]
          }
        ]
      },
      {
        "code": "621000",
        "name": "庆阳市",
        "center": [
          107.6384,
          35.7342
        ],
        "children": [
          {
            "code": "621000_ALL",
            "name": "全区全域",
            "center": [
              107.6384,
              35.7342
            ]
          },
          {
            "code": "621000_1",
            "name": "西峰区",
            "center": [
              107.6384,
              35.7342
            ]
          },
          {
            "code": "621000_2",
            "name": "庆城县",
            "center": [
              107.6384,
              35.7342
            ]
          },
          {
            "code": "621000_3",
            "name": "环县",
            "center": [
              107.6384,
              35.7342
            ]
          },
          {
            "code": "621000_4",
            "name": "华池县",
            "center": [
              107.6384,
              35.7342
            ]
          },
          {
            "code": "621000_5",
            "name": "合水县",
            "center": [
              107.6384,
              35.7342
            ]
          },
          {
            "code": "621000_6",
            "name": "正宁县",
            "center": [
              107.6384,
              35.7342
            ]
          },
          {
            "code": "621000_7",
            "name": "宁县",
            "center": [
              107.6384,
              35.7342
            ]
          },
          {
            "code": "621000_8",
            "name": "镇原县",
            "center": [
              107.6384,
              35.7342
            ]
          }
        ]
      },
      {
        "code": "621100",
        "name": "定西市",
        "center": [
          104.6263,
          35.5806
        ],
        "children": [
          {
            "code": "621100_ALL",
            "name": "全区全域",
            "center": [
              104.6263,
              35.5806
            ]
          },
          {
            "code": "621100_1",
            "name": "安定区",
            "center": [
              104.6263,
              35.5806
            ]
          },
          {
            "code": "621100_2",
            "name": "通渭县",
            "center": [
              104.6263,
              35.5806
            ]
          },
          {
            "code": "621100_3",
            "name": "陇西县",
            "center": [
              104.6263,
              35.5806
            ]
          },
          {
            "code": "621100_4",
            "name": "渭源县",
            "center": [
              104.6263,
              35.5806
            ]
          },
          {
            "code": "621100_5",
            "name": "临洮县",
            "center": [
              104.6263,
              35.5806
            ]
          },
          {
            "code": "621100_6",
            "name": "漳县",
            "center": [
              104.6263,
              35.5806
            ]
          },
          {
            "code": "621100_7",
            "name": "岷县",
            "center": [
              104.6263,
              35.5806
            ]
          }
        ]
      },
      {
        "code": "621200",
        "name": "陇南市",
        "center": [
          104.9294,
          33.3886
        ],
        "children": [
          {
            "code": "621200_ALL",
            "name": "全区全域",
            "center": [
              104.9294,
              33.3886
            ]
          },
          {
            "code": "621200_1",
            "name": "武都区",
            "center": [
              104.9294,
              33.3886
            ]
          },
          {
            "code": "621200_2",
            "name": "成县",
            "center": [
              104.9294,
              33.3886
            ]
          },
          {
            "code": "621200_3",
            "name": "文县",
            "center": [
              104.9294,
              33.3886
            ]
          },
          {
            "code": "621200_4",
            "name": "宕昌县",
            "center": [
              104.9294,
              33.3886
            ]
          },
          {
            "code": "621200_5",
            "name": "康县",
            "center": [
              104.9294,
              33.3886
            ]
          },
          {
            "code": "621200_6",
            "name": "西和县",
            "center": [
              104.9294,
              33.3886
            ]
          },
          {
            "code": "621200_7",
            "name": "礼县",
            "center": [
              104.9294,
              33.3886
            ]
          },
          {
            "code": "621200_8",
            "name": "徽县",
            "center": [
              104.9294,
              33.3886
            ]
          },
          {
            "code": "621200_9",
            "name": "两当县",
            "center": [
              104.9294,
              33.3886
            ]
          }
        ]
      },
      {
        "code": "621300",
        "name": "临夏回族自治州",
        "center": [
          103.2106,
          35.5994
        ],
        "children": [
          {
            "code": "621300_ALL",
            "name": "全区全域",
            "center": [
              103.2106,
              35.5994
            ]
          },
          {
            "code": "621300_1",
            "name": "临夏市",
            "center": [
              103.2106,
              35.5994
            ]
          },
          {
            "code": "621300_2",
            "name": "临夏县",
            "center": [
              103.2106,
              35.5994
            ]
          },
          {
            "code": "621300_3",
            "name": "康乐县",
            "center": [
              103.2106,
              35.5994
            ]
          },
          {
            "code": "621300_4",
            "name": "永靖县",
            "center": [
              103.2106,
              35.5994
            ]
          },
          {
            "code": "621300_5",
            "name": "广河县",
            "center": [
              103.2106,
              35.5994
            ]
          },
          {
            "code": "621300_6",
            "name": "和政县",
            "center": [
              103.2106,
              35.5994
            ]
          },
          {
            "code": "621300_7",
            "name": "东乡族自治县",
            "center": [
              103.2106,
              35.5994
            ]
          },
          {
            "code": "621300_8",
            "name": "积石山保安族东乡族撒拉族自治县",
            "center": [
              103.2106,
              35.5994
            ]
          }
        ]
      },
      {
        "code": "621400",
        "name": "甘南藏族自治州",
        "center": [
          102.9112,
          34.9864
        ],
        "children": [
          {
            "code": "621400_ALL",
            "name": "全区全域",
            "center": [
              102.9112,
              34.9864
            ]
          },
          {
            "code": "621400_1",
            "name": "合作市",
            "center": [
              102.9112,
              34.9864
            ]
          },
          {
            "code": "621400_2",
            "name": "临潭县",
            "center": [
              102.9112,
              34.9864
            ]
          },
          {
            "code": "621400_3",
            "name": "卓尼县",
            "center": [
              102.9112,
              34.9864
            ]
          },
          {
            "code": "621400_4",
            "name": "舟曲县",
            "center": [
              102.9112,
              34.9864
            ]
          },
          {
            "code": "621400_5",
            "name": "迭部县",
            "center": [
              102.9112,
              34.9864
            ]
          },
          {
            "code": "621400_6",
            "name": "玛曲县",
            "center": [
              102.9112,
              34.9864
            ]
          },
          {
            "code": "621400_7",
            "name": "碌曲县",
            "center": [
              102.9112,
              34.9864
            ]
          },
          {
            "code": "621400_8",
            "name": "夏河县",
            "center": [
              102.9112,
              34.9864
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "630000",
    "name": "青海省",
    "center": [
      101.7789,
      36.6232
    ],
    "children": [
      {
        "code": "630000_ALL",
        "name": "全省范围",
        "center": [
          101.7789,
          36.6232
        ],
        "children": [
          {
            "code": "630000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              101.7789,
              36.6232
            ]
          }
        ]
      },
      {
        "code": "630100",
        "name": "西宁市",
        "center": [
          101.7789,
          36.6232
        ],
        "children": [
          {
            "code": "630100_ALL",
            "name": "全区全域",
            "center": [
              101.7789,
              36.6232
            ]
          },
          {
            "code": "630100_1",
            "name": "城东区",
            "center": [
              101.7789,
              36.6232
            ]
          },
          {
            "code": "630100_2",
            "name": "城中区",
            "center": [
              101.7789,
              36.6232
            ]
          },
          {
            "code": "630100_3",
            "name": "城西区",
            "center": [
              101.7789,
              36.6232
            ]
          },
          {
            "code": "630100_4",
            "name": "城北区",
            "center": [
              101.7789,
              36.6232
            ]
          },
          {
            "code": "630100_5",
            "name": "湟中区",
            "center": [
              101.7789,
              36.6232
            ]
          },
          {
            "code": "630100_6",
            "name": "湟源县",
            "center": [
              101.7789,
              36.6232
            ]
          },
          {
            "code": "630100_7",
            "name": "大通回族土家族自治县",
            "center": [
              101.7789,
              36.6232
            ]
          }
        ]
      },
      {
        "code": "630200",
        "name": "海东市",
        "center": [
          102.1033,
          36.5029
        ],
        "children": [
          {
            "code": "630200_ALL",
            "name": "全区全域",
            "center": [
              102.1033,
              36.5029
            ]
          },
          {
            "code": "630200_1",
            "name": "乐都区",
            "center": [
              102.1033,
              36.5029
            ]
          },
          {
            "code": "630200_2",
            "name": "平安区",
            "center": [
              102.1033,
              36.5029
            ]
          },
          {
            "code": "630200_3",
            "name": "民和回族土家族自治县",
            "center": [
              102.1033,
              36.5029
            ]
          },
          {
            "code": "630200_4",
            "name": "互助土家族自治县",
            "center": [
              102.1033,
              36.5029
            ]
          },
          {
            "code": "630200_5",
            "name": "化隆回族自治县",
            "center": [
              102.1033,
              36.5029
            ]
          },
          {
            "code": "630200_6",
            "name": "循化撒拉族自治县",
            "center": [
              102.1033,
              36.5029
            ]
          }
        ]
      },
      {
        "code": "630300",
        "name": "海北藏族自治州",
        "center": [
          100.901,
          36.9594
        ],
        "children": [
          {
            "code": "630300_ALL",
            "name": "全区全域",
            "center": [
              100.901,
              36.9594
            ]
          },
          {
            "code": "630300_1",
            "name": "海晏县",
            "center": [
              100.901,
              36.9594
            ]
          },
          {
            "code": "630300_2",
            "name": "祁连县",
            "center": [
              100.901,
              36.9594
            ]
          },
          {
            "code": "630300_3",
            "name": "刚察县",
            "center": [
              100.901,
              36.9594
            ]
          },
          {
            "code": "630300_4",
            "name": "门源回族自治县",
            "center": [
              100.901,
              36.9594
            ]
          }
        ]
      },
      {
        "code": "630400",
        "name": "黄南藏族自治州",
        "center": [
          102.0193,
          35.5177
        ],
        "children": [
          {
            "code": "630400_ALL",
            "name": "全区全域",
            "center": [
              102.0193,
              35.5177
            ]
          },
          {
            "code": "630400_1",
            "name": "同仁市",
            "center": [
              102.0193,
              35.5177
            ]
          },
          {
            "code": "630400_2",
            "name": "尖扎县",
            "center": [
              102.0193,
              35.5177
            ]
          },
          {
            "code": "630400_3",
            "name": "泽库县",
            "center": [
              102.0193,
              35.5177
            ]
          },
          {
            "code": "630400_4",
            "name": "河南蒙古族自治县",
            "center": [
              102.0193,
              35.5177
            ]
          }
        ]
      },
      {
        "code": "630500",
        "name": "海南藏族自治州",
        "center": [
          100.6204,
          36.2804
        ],
        "children": [
          {
            "code": "630500_ALL",
            "name": "全区全域",
            "center": [
              100.6204,
              36.2804
            ]
          },
          {
            "code": "630500_1",
            "name": "共和县",
            "center": [
              100.6204,
              36.2804
            ]
          },
          {
            "code": "630500_2",
            "name": "同德县",
            "center": [
              100.6204,
              36.2804
            ]
          },
          {
            "code": "630500_3",
            "name": "贵德县",
            "center": [
              100.6204,
              36.2804
            ]
          },
          {
            "code": "630500_4",
            "name": "兴海县",
            "center": [
              100.6204,
              36.2804
            ]
          },
          {
            "code": "630500_5",
            "name": "贵南县",
            "center": [
              100.6204,
              36.2804
            ]
          }
        ]
      },
      {
        "code": "630600",
        "name": "果洛藏族自治州",
        "center": [
          100.2422,
          34.4714
        ],
        "children": [
          {
            "code": "630600_ALL",
            "name": "全区全域",
            "center": [
              100.2422,
              34.4714
            ]
          },
          {
            "code": "630600_1",
            "name": "玛沁县",
            "center": [
              100.2422,
              34.4714
            ]
          },
          {
            "code": "630600_2",
            "name": "班玛县",
            "center": [
              100.2422,
              34.4714
            ]
          },
          {
            "code": "630600_3",
            "name": "甘德县",
            "center": [
              100.2422,
              34.4714
            ]
          },
          {
            "code": "630600_4",
            "name": "达日县",
            "center": [
              100.2422,
              34.4714
            ]
          },
          {
            "code": "630600_5",
            "name": "久治县",
            "center": [
              100.2422,
              34.4714
            ]
          },
          {
            "code": "630600_6",
            "name": "玛多县",
            "center": [
              100.2422,
              34.4714
            ]
          }
        ]
      },
      {
        "code": "630700",
        "name": "玉树藏族自治州",
        "center": [
          97.0085,
          33.0062
        ],
        "children": [
          {
            "code": "630700_ALL",
            "name": "全区全域",
            "center": [
              97.0085,
              33.0062
            ]
          },
          {
            "code": "630700_1",
            "name": "玉树市",
            "center": [
              97.0085,
              33.0062
            ]
          },
          {
            "code": "630700_2",
            "name": "杂多县",
            "center": [
              97.0085,
              33.0062
            ]
          },
          {
            "code": "630700_3",
            "name": "称多县",
            "center": [
              97.0085,
              33.0062
            ]
          },
          {
            "code": "630700_4",
            "name": "治多县",
            "center": [
              97.0085,
              33.0062
            ]
          },
          {
            "code": "630700_5",
            "name": "囊谦县",
            "center": [
              97.0085,
              33.0062
            ]
          },
          {
            "code": "630700_6",
            "name": "曲麻莱县",
            "center": [
              97.0085,
              33.0062
            ]
          }
        ]
      },
      {
        "code": "630800",
        "name": "海西蒙古族藏族自治州",
        "center": [
          97.3708,
          37.3746
        ],
        "children": [
          {
            "code": "630800_ALL",
            "name": "全区全域",
            "center": [
              97.3708,
              37.3746
            ]
          },
          {
            "code": "630800_1",
            "name": "德令哈市",
            "center": [
              97.3708,
              37.3746
            ]
          },
          {
            "code": "630800_2",
            "name": "格尔木市",
            "center": [
              97.3708,
              37.3746
            ]
          },
          {
            "code": "630800_3",
            "name": "茫崖市",
            "center": [
              97.3708,
              37.3746
            ]
          },
          {
            "code": "630800_4",
            "name": "乌兰县",
            "center": [
              97.3708,
              37.3746
            ]
          },
          {
            "code": "630800_5",
            "name": "都兰县",
            "center": [
              97.3708,
              37.3746
            ]
          },
          {
            "code": "630800_6",
            "name": "天峻县",
            "center": [
              97.3708,
              37.3746
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "640000",
    "name": "宁夏回族自治区",
    "center": [
      106.2781,
      38.4664
    ],
    "children": [
      {
        "code": "640000_ALL",
        "name": "全省范围",
        "center": [
          106.2781,
          38.4664
        ],
        "children": [
          {
            "code": "640000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              106.2781,
              38.4664
            ]
          }
        ]
      },
      {
        "code": "640100",
        "name": "银川市",
        "center": [
          106.2781,
          38.4664
        ],
        "children": [
          {
            "code": "640100_ALL",
            "name": "全区全域",
            "center": [
              106.2781,
              38.4664
            ]
          },
          {
            "code": "640100_1",
            "name": "兴庆区",
            "center": [
              106.2781,
              38.4664
            ]
          },
          {
            "code": "640100_2",
            "name": "金凤区",
            "center": [
              106.2781,
              38.4664
            ]
          },
          {
            "code": "640100_3",
            "name": "西夏区",
            "center": [
              106.2781,
              38.4664
            ]
          },
          {
            "code": "640100_4",
            "name": "永宁县",
            "center": [
              106.2781,
              38.4664
            ]
          },
          {
            "code": "640100_5",
            "name": "贺兰县",
            "center": [
              106.2781,
              38.4664
            ]
          },
          {
            "code": "640100_6",
            "name": "灵武市",
            "center": [
              106.2781,
              38.4664
            ]
          }
        ]
      },
      {
        "code": "640200",
        "name": "石嘴山市",
        "center": [
          106.3792,
          39.0122
        ],
        "children": [
          {
            "code": "640200_ALL",
            "name": "全区全域",
            "center": [
              106.3792,
              39.0122
            ]
          },
          {
            "code": "640200_1",
            "name": "大武口区",
            "center": [
              106.3792,
              39.0122
            ]
          },
          {
            "code": "640200_2",
            "name": "惠农区",
            "center": [
              106.3792,
              39.0122
            ]
          },
          {
            "code": "640200_3",
            "name": "平罗县",
            "center": [
              106.3792,
              39.0122
            ]
          }
        ]
      },
      {
        "code": "640300",
        "name": "吴忠市",
        "center": [
          106.1995,
          37.9862
        ],
        "children": [
          {
            "code": "640300_ALL",
            "name": "全区全域",
            "center": [
              106.1995,
              37.9862
            ]
          },
          {
            "code": "640300_1",
            "name": "利通区",
            "center": [
              106.1995,
              37.9862
            ]
          },
          {
            "code": "640300_2",
            "name": "红寺堡区",
            "center": [
              106.1995,
              37.9862
            ]
          },
          {
            "code": "640300_3",
            "name": "盐池县",
            "center": [
              106.1995,
              37.9862
            ]
          },
          {
            "code": "640300_4",
            "name": "同心县",
            "center": [
              106.1995,
              37.9862
            ]
          },
          {
            "code": "640300_5",
            "name": "青铜峡市",
            "center": [
              106.1995,
              37.9862
            ]
          }
        ]
      },
      {
        "code": "640400",
        "name": "固原市",
        "center": [
          106.2852,
          36.0046
        ],
        "children": [
          {
            "code": "640400_ALL",
            "name": "全区全域",
            "center": [
              106.2852,
              36.0046
            ]
          },
          {
            "code": "640400_1",
            "name": "原州区",
            "center": [
              106.2852,
              36.0046
            ]
          },
          {
            "code": "640400_2",
            "name": "西吉县",
            "center": [
              106.2852,
              36.0046
            ]
          },
          {
            "code": "640400_3",
            "name": "隆德县",
            "center": [
              106.2852,
              36.0046
            ]
          },
          {
            "code": "640400_4",
            "name": "泾源县",
            "center": [
              106.2852,
              36.0046
            ]
          },
          {
            "code": "640400_5",
            "name": "彭阳县",
            "center": [
              106.2852,
              36.0046
            ]
          }
        ]
      },
      {
        "code": "640500",
        "name": "中卫市",
        "center": [
          105.1896,
          37.5149
        ],
        "children": [
          {
            "code": "640500_ALL",
            "name": "全区全域",
            "center": [
              105.1896,
              37.5149
            ]
          },
          {
            "code": "640500_1",
            "name": "沙坡头区",
            "center": [
              105.1896,
              37.5149
            ]
          },
          {
            "code": "640500_2",
            "name": "中宁县",
            "center": [
              105.1896,
              37.5149
            ]
          },
          {
            "code": "640500_3",
            "name": "海原县",
            "center": [
              105.1896,
              37.5149
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "650000",
    "name": "新疆维吾尔自治区",
    "center": [
      87.6177,
      43.7928
    ],
    "children": [
      {
        "code": "650000_ALL",
        "name": "全省范围",
        "center": [
          87.6177,
          43.7928
        ],
        "children": [
          {
            "code": "650000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              87.6177,
              43.7928
            ]
          }
        ]
      },
      {
        "code": "650100",
        "name": "乌鲁木齐市",
        "center": [
          87.6177,
          43.7928
        ],
        "children": [
          {
            "code": "650100_ALL",
            "name": "全区全域",
            "center": [
              87.6177,
              43.7928
            ]
          },
          {
            "code": "650100_1",
            "name": "天山区",
            "center": [
              87.6177,
              43.7928
            ]
          },
          {
            "code": "650100_2",
            "name": "沙依巴克区",
            "center": [
              87.6177,
              43.7928
            ]
          },
          {
            "code": "650100_3",
            "name": "新市区",
            "center": [
              87.6177,
              43.7928
            ]
          },
          {
            "code": "650100_4",
            "name": "水磨沟区",
            "center": [
              87.6177,
              43.7928
            ]
          },
          {
            "code": "650100_5",
            "name": "头屯河区",
            "center": [
              87.6177,
              43.7928
            ]
          },
          {
            "code": "650100_6",
            "name": "达坂城区",
            "center": [
              87.6177,
              43.7928
            ]
          },
          {
            "code": "650100_7",
            "name": "米东区",
            "center": [
              87.6177,
              43.7928
            ]
          },
          {
            "code": "650100_8",
            "name": "乌鲁木齐县",
            "center": [
              87.6177,
              43.7928
            ]
          }
        ]
      },
      {
        "code": "650200",
        "name": "克拉玛依市",
        "center": [
          84.8893,
          45.5798
        ],
        "children": [
          {
            "code": "650200_ALL",
            "name": "全区全域",
            "center": [
              84.8893,
              45.5798
            ]
          },
          {
            "code": "650200_1",
            "name": "独山子区",
            "center": [
              84.8893,
              45.5798
            ]
          },
          {
            "code": "650200_2",
            "name": "克拉玛依区",
            "center": [
              84.8893,
              45.5798
            ]
          },
          {
            "code": "650200_3",
            "name": "白碱滩区",
            "center": [
              84.8893,
              45.5798
            ]
          },
          {
            "code": "650200_4",
            "name": "乌尔禾区",
            "center": [
              84.8893,
              45.5798
            ]
          }
        ]
      },
      {
        "code": "650300",
        "name": "吐鲁番市",
        "center": [
          89.1841,
          42.9513
        ],
        "children": [
          {
            "code": "650300_ALL",
            "name": "全区全域",
            "center": [
              89.1841,
              42.9513
            ]
          },
          {
            "code": "650300_1",
            "name": "高昌区",
            "center": [
              89.1841,
              42.9513
            ]
          },
          {
            "code": "650300_2",
            "name": "鄯善县",
            "center": [
              89.1841,
              42.9513
            ]
          },
          {
            "code": "650300_3",
            "name": "托克逊县",
            "center": [
              89.1841,
              42.9513
            ]
          }
        ]
      },
      {
        "code": "650400",
        "name": "哈密市",
        "center": [
          93.5132,
          42.8332
        ],
        "children": [
          {
            "code": "650400_ALL",
            "name": "全区全域",
            "center": [
              93.5132,
              42.8332
            ]
          },
          {
            "code": "650400_1",
            "name": "伊州区",
            "center": [
              93.5132,
              42.8332
            ]
          },
          {
            "code": "650400_2",
            "name": "巴里坤哈萨克自治县",
            "center": [
              93.5132,
              42.8332
            ]
          },
          {
            "code": "650400_3",
            "name": "伊吾县",
            "center": [
              93.5132,
              42.8332
            ]
          }
        ]
      },
      {
        "code": "650500",
        "name": "昌吉回族自治州",
        "center": [
          87.304,
          44.0146
        ],
        "children": [
          {
            "code": "650500_ALL",
            "name": "全区全域",
            "center": [
              87.304,
              44.0146
            ]
          },
          {
            "code": "650500_1",
            "name": "昌吉市",
            "center": [
              87.304,
              44.0146
            ]
          },
          {
            "code": "650500_2",
            "name": "阜康市",
            "center": [
              87.304,
              44.0146
            ]
          },
          {
            "code": "650500_3",
            "name": "呼图壁县",
            "center": [
              87.304,
              44.0146
            ]
          },
          {
            "code": "650500_4",
            "name": "玛纳斯县",
            "center": [
              87.304,
              44.0146
            ]
          },
          {
            "code": "650500_5",
            "name": "奇台县",
            "center": [
              87.304,
              44.0146
            ]
          },
          {
            "code": "650500_6",
            "name": "吉木萨尔县",
            "center": [
              87.304,
              44.0146
            ]
          },
          {
            "code": "650500_7",
            "name": "木垒哈萨克自治县",
            "center": [
              87.304,
              44.0146
            ]
          }
        ]
      },
      {
        "code": "650600",
        "name": "博尔塔拉蒙古自治州",
        "center": [
          82.0747,
          44.9051
        ],
        "children": [
          {
            "code": "650600_ALL",
            "name": "全区全域",
            "center": [
              82.0747,
              44.9051
            ]
          },
          {
            "code": "650600_1",
            "name": "博乐市",
            "center": [
              82.0747,
              44.9051
            ]
          },
          {
            "code": "650600_2",
            "name": "阿拉山口市",
            "center": [
              82.0747,
              44.9051
            ]
          },
          {
            "code": "650600_3",
            "name": "精河县",
            "center": [
              82.0747,
              44.9051
            ]
          },
          {
            "code": "650600_4",
            "name": "温泉县",
            "center": [
              82.0747,
              44.9051
            ]
          }
        ]
      },
      {
        "code": "650700",
        "name": "巴音郭楞蒙古自治州",
        "center": [
          86.151,
          41.7641
        ],
        "children": [
          {
            "code": "650700_ALL",
            "name": "全区全域",
            "center": [
              86.151,
              41.7641
            ]
          },
          {
            "code": "650700_1",
            "name": "库尔勒市",
            "center": [
              86.151,
              41.7641
            ]
          },
          {
            "code": "650700_2",
            "name": "焉耆回族自治县",
            "center": [
              86.151,
              41.7641
            ]
          },
          {
            "code": "650700_3",
            "name": "和静县",
            "center": [
              86.151,
              41.7641
            ]
          },
          {
            "code": "650700_4",
            "name": "和硕县",
            "center": [
              86.151,
              41.7641
            ]
          },
          {
            "code": "650700_5",
            "name": "博湖县",
            "center": [
              86.151,
              41.7641
            ]
          },
          {
            "code": "650700_6",
            "name": "轮台县",
            "center": [
              86.151,
              41.7641
            ]
          },
          {
            "code": "650700_7",
            "name": "尉犁县",
            "center": [
              86.151,
              41.7641
            ]
          },
          {
            "code": "650700_8",
            "name": "若羌县",
            "center": [
              86.151,
              41.7641
            ]
          },
          {
            "code": "650700_9",
            "name": "且末县",
            "center": [
              86.151,
              41.7641
            ]
          }
        ]
      },
      {
        "code": "650800",
        "name": "阿克苏地区",
        "center": [
          80.2651,
          41.1707
        ],
        "children": [
          {
            "code": "650800_ALL",
            "name": "全区全域",
            "center": [
              80.2651,
              41.1707
            ]
          },
          {
            "code": "650800_1",
            "name": "阿克苏市",
            "center": [
              80.2651,
              41.1707
            ]
          },
          {
            "code": "650800_2",
            "name": "温宿县",
            "center": [
              80.2651,
              41.1707
            ]
          },
          {
            "code": "650800_3",
            "name": "库车市",
            "center": [
              80.2651,
              41.1707
            ]
          },
          {
            "code": "650800_4",
            "name": "沙雅县",
            "center": [
              80.2651,
              41.1707
            ]
          },
          {
            "code": "650800_5",
            "name": "新和县",
            "center": [
              80.2651,
              41.1707
            ]
          },
          {
            "code": "650800_6",
            "name": "拜城县",
            "center": [
              80.2651,
              41.1707
            ]
          },
          {
            "code": "650800_7",
            "name": "乌什县",
            "center": [
              80.2651,
              41.1707
            ]
          },
          {
            "code": "650800_8",
            "name": "阿瓦提县",
            "center": [
              80.2651,
              41.1707
            ]
          },
          {
            "code": "650800_9",
            "name": "柯坪县",
            "center": [
              80.2651,
              41.1707
            ]
          }
        ]
      },
      {
        "code": "650900",
        "name": "克孜勒苏柯尔克孜自治州",
        "center": [
          76.1728,
          39.7134
        ],
        "children": [
          {
            "code": "650900_ALL",
            "name": "全区全域",
            "center": [
              76.1728,
              39.7134
            ]
          },
          {
            "code": "650900_1",
            "name": "阿图什市",
            "center": [
              76.1728,
              39.7134
            ]
          },
          {
            "code": "650900_2",
            "name": "阿克陶县",
            "center": [
              76.1728,
              39.7134
            ]
          },
          {
            "code": "650900_3",
            "name": "阿合奇县",
            "center": [
              76.1728,
              39.7134
            ]
          },
          {
            "code": "650900_4",
            "name": "乌恰县",
            "center": [
              76.1728,
              39.7134
            ]
          }
        ]
      },
      {
        "code": "651000",
        "name": "喀什地区",
        "center": [
          75.9898,
          39.4677
        ],
        "children": [
          {
            "code": "651000_ALL",
            "name": "全区全域",
            "center": [
              75.9898,
              39.4677
            ]
          },
          {
            "code": "651000_1",
            "name": "喀什市",
            "center": [
              75.9898,
              39.4677
            ]
          },
          {
            "code": "651000_2",
            "name": "疏附县",
            "center": [
              75.9898,
              39.4677
            ]
          },
          {
            "code": "651000_3",
            "name": "疏勒县",
            "center": [
              75.9898,
              39.4677
            ]
          },
          {
            "code": "651000_4",
            "name": "英吉沙县",
            "center": [
              75.9898,
              39.4677
            ]
          },
          {
            "code": "651000_5",
            "name": "泽普县",
            "center": [
              75.9898,
              39.4677
            ]
          },
          {
            "code": "651000_6",
            "name": "莎车县",
            "center": [
              75.9898,
              39.4677
            ]
          },
          {
            "code": "651000_7",
            "name": "叶城县",
            "center": [
              75.9898,
              39.4677
            ]
          },
          {
            "code": "651000_8",
            "name": "麦盖提县",
            "center": [
              75.9898,
              39.4677
            ]
          },
          {
            "code": "651000_9",
            "name": "岳普湖县",
            "center": [
              75.9898,
              39.4677
            ]
          },
          {
            "code": "651000_10",
            "name": "伽师县",
            "center": [
              75.9898,
              39.4677
            ]
          },
          {
            "code": "651000_11",
            "name": "巴楚县",
            "center": [
              75.9898,
              39.4677
            ]
          },
          {
            "code": "651000_12",
            "name": "塔什库尔干塔吉克自治县",
            "center": [
              75.9898,
              39.4677
            ]
          }
        ]
      },
      {
        "code": "651100",
        "name": "和田地区",
        "center": [
          79.9253,
          37.1107
        ],
        "children": [
          {
            "code": "651100_ALL",
            "name": "全区全域",
            "center": [
              79.9253,
              37.1107
            ]
          },
          {
            "code": "651100_1",
            "name": "和田市",
            "center": [
              79.9253,
              37.1107
            ]
          },
          {
            "code": "651100_2",
            "name": "和田县",
            "center": [
              79.9253,
              37.1107
            ]
          },
          {
            "code": "651100_3",
            "name": "墨玉县",
            "center": [
              79.9253,
              37.1107
            ]
          },
          {
            "code": "651100_4",
            "name": "皮山县",
            "center": [
              79.9253,
              37.1107
            ]
          },
          {
            "code": "651100_5",
            "name": "洛浦县",
            "center": [
              79.9253,
              37.1107
            ]
          },
          {
            "code": "651100_6",
            "name": "策勒县",
            "center": [
              79.9253,
              37.1107
            ]
          },
          {
            "code": "651100_7",
            "name": "于田县",
            "center": [
              79.9253,
              37.1107
            ]
          },
          {
            "code": "651100_8",
            "name": "民丰县",
            "center": [
              79.9253,
              37.1107
            ]
          }
        ]
      },
      {
        "code": "651200",
        "name": "伊犁哈萨克自治州",
        "center": [
          81.3179,
          43.9219
        ],
        "children": [
          {
            "code": "651200_ALL",
            "name": "全区全域",
            "center": [
              81.3179,
              43.9219
            ]
          },
          {
            "code": "651200_1",
            "name": "伊宁市",
            "center": [
              81.3179,
              43.9219
            ]
          },
          {
            "code": "651200_2",
            "name": "奎屯市",
            "center": [
              81.3179,
              43.9219
            ]
          },
          {
            "code": "651200_3",
            "name": "霍尔果斯市",
            "center": [
              81.3179,
              43.9219
            ]
          },
          {
            "code": "651200_4",
            "name": "伊宁县",
            "center": [
              81.3179,
              43.9219
            ]
          },
          {
            "code": "651200_5",
            "name": "察布查尔锡伯自治县",
            "center": [
              81.3179,
              43.9219
            ]
          },
          {
            "code": "651200_6",
            "name": "霍城县",
            "center": [
              81.3179,
              43.9219
            ]
          },
          {
            "code": "651200_7",
            "name": "巩留县",
            "center": [
              81.3179,
              43.9219
            ]
          },
          {
            "code": "651200_8",
            "name": "新源县",
            "center": [
              81.3179,
              43.9219
            ]
          },
          {
            "code": "651200_9",
            "name": "昭苏县",
            "center": [
              81.3179,
              43.9219
            ]
          },
          {
            "code": "651200_10",
            "name": "特克斯县",
            "center": [
              81.3179,
              43.9219
            ]
          },
          {
            "code": "651200_11",
            "name": "尼勒克县",
            "center": [
              81.3179,
              43.9219
            ]
          }
        ]
      },
      {
        "code": "651300",
        "name": "塔城地区",
        "center": [
          82.9857,
          46.7463
        ],
        "children": [
          {
            "code": "651300_ALL",
            "name": "全区全域",
            "center": [
              82.9857,
              46.7463
            ]
          },
          {
            "code": "651300_1",
            "name": "塔城市",
            "center": [
              82.9857,
              46.7463
            ]
          },
          {
            "code": "651300_2",
            "name": "乌苏市",
            "center": [
              82.9857,
              46.7463
            ]
          },
          {
            "code": "651300_3",
            "name": "额敏县",
            "center": [
              82.9857,
              46.7463
            ]
          },
          {
            "code": "651300_4",
            "name": "沙湾市",
            "center": [
              82.9857,
              46.7463
            ]
          },
          {
            "code": "651300_5",
            "name": "托里县",
            "center": [
              82.9857,
              46.7463
            ]
          },
          {
            "code": "651300_6",
            "name": "裕民县",
            "center": [
              82.9857,
              46.7463
            ]
          },
          {
            "code": "651300_7",
            "name": "和布克赛尔蒙古自治县",
            "center": [
              82.9857,
              46.7463
            ]
          }
        ]
      },
      {
        "code": "651400",
        "name": "阿勒泰地区",
        "center": [
          88.1396,
          47.8484
        ],
        "children": [
          {
            "code": "651400_ALL",
            "name": "全区全域",
            "center": [
              88.1396,
              47.8484
            ]
          },
          {
            "code": "651400_1",
            "name": "阿勒泰市",
            "center": [
              88.1396,
              47.8484
            ]
          },
          {
            "code": "651400_2",
            "name": "布尔津县",
            "center": [
              88.1396,
              47.8484
            ]
          },
          {
            "code": "651400_3",
            "name": "富蕴县",
            "center": [
              88.1396,
              47.8484
            ]
          },
          {
            "code": "651400_4",
            "name": "福海县",
            "center": [
              88.1396,
              47.8484
            ]
          },
          {
            "code": "651400_5",
            "name": "哈巴河县",
            "center": [
              88.1396,
              47.8484
            ]
          },
          {
            "code": "651400_6",
            "name": "青河县",
            "center": [
              88.1396,
              47.8484
            ]
          },
          {
            "code": "651400_7",
            "name": "吉木乃县",
            "center": [
              88.1396,
              47.8484
            ]
          }
        ]
      },
      {
        "code": "651500",
        "name": "自治区直辖县级行政区划",
        "center": [
          86.0411,
          44.3059
        ],
        "children": [
          {
            "code": "651500_ALL",
            "name": "全区全域",
            "center": [
              86.0411,
              44.3059
            ]
          },
          {
            "code": "651500_1",
            "name": "石河子市",
            "center": [
              86.0411,
              44.3059
            ]
          },
          {
            "code": "651500_2",
            "name": "阿拉尔市",
            "center": [
              86.0411,
              44.3059
            ]
          },
          {
            "code": "651500_3",
            "name": "图木舒克市",
            "center": [
              86.0411,
              44.3059
            ]
          },
          {
            "code": "651500_4",
            "name": "五家渠市",
            "center": [
              86.0411,
              44.3059
            ]
          },
          {
            "code": "651500_5",
            "name": "北屯市",
            "center": [
              86.0411,
              44.3059
            ]
          },
          {
            "code": "651500_6",
            "name": "铁门关市",
            "center": [
              86.0411,
              44.3059
            ]
          },
          {
            "code": "651500_7",
            "name": "双河市",
            "center": [
              86.0411,
              44.3059
            ]
          },
          {
            "code": "651500_8",
            "name": "可克达拉市",
            "center": [
              86.0411,
              44.3059
            ]
          },
          {
            "code": "651500_9",
            "name": "昆玉市",
            "center": [
              86.0411,
              44.3059
            ]
          },
          {
            "code": "651500_10",
            "name": "胡杨河市",
            "center": [
              86.0411,
              44.3059
            ]
          },
          {
            "code": "651500_11",
            "name": "新星市",
            "center": [
              86.0411,
              44.3059
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "510000",
    "name": "四川省",
    "center": [
      104.0657,
      30.6594
    ],
    "children": [
      {
        "code": "510000_ALL",
        "name": "全省范围",
        "center": [
          104.0657,
          30.6594
        ],
        "children": [
          {
            "code": "510000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              104.0657,
              30.6594
            ]
          }
        ]
      },
      {
        "code": "510100",
        "name": "成都市",
        "center": [
          104.0657,
          30.6594
        ],
        "children": [
          {
            "code": "510100_ALL",
            "name": "全区全域",
            "center": [
              104.0657,
              30.6594
            ]
          },
          {
            "code": "510100_1",
            "name": "锦江区",
            "center": [
              104.0657,
              30.6594
            ]
          },
          {
            "code": "510100_2",
            "name": "青羊区",
            "center": [
              104.0657,
              30.6594
            ]
          },
          {
            "code": "510100_3",
            "name": "金牛区",
            "center": [
              104.0657,
              30.6594
            ]
          },
          {
            "code": "510100_4",
            "name": "武侯区",
            "center": [
              104.0657,
              30.6594
            ]
          },
          {
            "code": "510100_5",
            "name": "成华区",
            "center": [
              104.0657,
              30.6594
            ]
          },
          {
            "code": "510100_6",
            "name": "龙泉驿区",
            "center": [
              104.0657,
              30.6594
            ]
          },
          {
            "code": "510100_7",
            "name": "青白江区",
            "center": [
              104.0657,
              30.6594
            ]
          },
          {
            "code": "510100_8",
            "name": "新都区",
            "center": [
              104.0657,
              30.6594
            ]
          },
          {
            "code": "510100_9",
            "name": "温江区",
            "center": [
              104.0657,
              30.6594
            ]
          },
          {
            "code": "510100_10",
            "name": "双流区",
            "center": [
              104.0657,
              30.6594
            ]
          },
          {
            "code": "510100_11",
            "name": "郫都区",
            "center": [
              104.0657,
              30.6594
            ]
          },
          {
            "code": "510100_12",
            "name": "新津区",
            "center": [
              104.0657,
              30.6594
            ]
          },
          {
            "code": "510100_13",
            "name": "蒲江县",
            "center": [
              104.0657,
              30.6594
            ]
          },
          {
            "code": "510100_14",
            "name": "大邑县",
            "center": [
              104.0657,
              30.6594
            ]
          },
          {
            "code": "510100_15",
            "name": "金堂县",
            "center": [
              104.0657,
              30.6594
            ]
          },
          {
            "code": "510100_16",
            "name": "都江堰市",
            "center": [
              104.0657,
              30.6594
            ]
          },
          {
            "code": "510100_17",
            "name": "彭州市",
            "center": [
              104.0657,
              30.6594
            ]
          },
          {
            "code": "510100_18",
            "name": "邛崃市",
            "center": [
              104.0657,
              30.6594
            ]
          },
          {
            "code": "510100_19",
            "name": "崇州市",
            "center": [
              104.0657,
              30.6594
            ]
          },
          {
            "code": "510100_20",
            "name": "简阳市",
            "center": [
              104.0657,
              30.6594
            ]
          }
        ]
      },
      {
        "code": "510200",
        "name": "自贡市",
        "center": [
          104.7734,
          29.3527
        ],
        "children": [
          {
            "code": "510200_ALL",
            "name": "全区全域",
            "center": [
              104.7734,
              29.3527
            ]
          },
          {
            "code": "510200_1",
            "name": "自流井区",
            "center": [
              104.7734,
              29.3527
            ]
          },
          {
            "code": "510200_2",
            "name": "贡井区",
            "center": [
              104.7734,
              29.3527
            ]
          },
          {
            "code": "510200_3",
            "name": "大安区",
            "center": [
              104.7734,
              29.3527
            ]
          },
          {
            "code": "510200_4",
            "name": "沿滩区",
            "center": [
              104.7734,
              29.3527
            ]
          },
          {
            "code": "510200_5",
            "name": "荣县",
            "center": [
              104.7734,
              29.3527
            ]
          },
          {
            "code": "510200_6",
            "name": "富顺县",
            "center": [
              104.7734,
              29.3527
            ]
          }
        ]
      },
      {
        "code": "510300",
        "name": "攀枝花市",
        "center": [
          101.716,
          26.5804
        ],
        "children": [
          {
            "code": "510300_ALL",
            "name": "全区全域",
            "center": [
              101.716,
              26.5804
            ]
          },
          {
            "code": "510300_1",
            "name": "东区",
            "center": [
              101.716,
              26.5804
            ]
          },
          {
            "code": "510300_2",
            "name": "西区",
            "center": [
              101.716,
              26.5804
            ]
          },
          {
            "code": "510300_3",
            "name": "仁和区",
            "center": [
              101.716,
              26.5804
            ]
          },
          {
            "code": "510300_4",
            "name": "米易县",
            "center": [
              101.716,
              26.5804
            ]
          },
          {
            "code": "510300_5",
            "name": "盐边县",
            "center": [
              101.716,
              26.5804
            ]
          }
        ]
      },
      {
        "code": "510400",
        "name": "泸州市",
        "center": [
          105.4433,
          28.8891
        ],
        "children": [
          {
            "code": "510400_ALL",
            "name": "全区全域",
            "center": [
              105.4433,
              28.8891
            ]
          },
          {
            "code": "510400_1",
            "name": "江阳区",
            "center": [
              105.4433,
              28.8891
            ]
          },
          {
            "code": "510400_2",
            "name": "纳溪区",
            "center": [
              105.4433,
              28.8891
            ]
          },
          {
            "code": "510400_3",
            "name": "龙马潭区",
            "center": [
              105.4433,
              28.8891
            ]
          },
          {
            "code": "510400_4",
            "name": "泸县",
            "center": [
              105.4433,
              28.8891
            ]
          },
          {
            "code": "510400_5",
            "name": "合江县",
            "center": [
              105.4433,
              28.8891
            ]
          },
          {
            "code": "510400_6",
            "name": "叙永县",
            "center": [
              105.4433,
              28.8891
            ]
          },
          {
            "code": "510400_7",
            "name": "古蔺县",
            "center": [
              105.4433,
              28.8891
            ]
          }
        ]
      },
      {
        "code": "510500",
        "name": "德阳市",
        "center": [
          104.3986,
          31.127
        ],
        "children": [
          {
            "code": "510500_ALL",
            "name": "全区全域",
            "center": [
              104.3986,
              31.127
            ]
          },
          {
            "code": "510500_1",
            "name": "旌阳区",
            "center": [
              104.3986,
              31.127
            ]
          },
          {
            "code": "510500_2",
            "name": "罗江区",
            "center": [
              104.3986,
              31.127
            ]
          },
          {
            "code": "510500_3",
            "name": "中江县",
            "center": [
              104.3986,
              31.127
            ]
          },
          {
            "code": "510500_4",
            "name": "广汉市",
            "center": [
              104.3986,
              31.127
            ]
          },
          {
            "code": "510500_5",
            "name": "什邡市",
            "center": [
              104.3986,
              31.127
            ]
          },
          {
            "code": "510500_6",
            "name": "绵竹市",
            "center": [
              104.3986,
              31.127
            ]
          }
        ]
      },
      {
        "code": "510600",
        "name": "绵阳市",
        "center": [
          104.7417,
          31.464
        ],
        "children": [
          {
            "code": "510600_ALL",
            "name": "全区全域",
            "center": [
              104.7417,
              31.464
            ]
          },
          {
            "code": "510600_1",
            "name": "涪城区",
            "center": [
              104.7417,
              31.464
            ]
          },
          {
            "code": "510600_2",
            "name": "游仙区",
            "center": [
              104.7417,
              31.464
            ]
          },
          {
            "code": "510600_3",
            "name": "安州区",
            "center": [
              104.7417,
              31.464
            ]
          },
          {
            "code": "510600_4",
            "name": "三台县",
            "center": [
              104.7417,
              31.464
            ]
          },
          {
            "code": "510600_5",
            "name": "盐亭县",
            "center": [
              104.7417,
              31.464
            ]
          },
          {
            "code": "510600_6",
            "name": "梓潼县",
            "center": [
              104.7417,
              31.464
            ]
          },
          {
            "code": "510600_7",
            "name": "平武县",
            "center": [
              104.7417,
              31.464
            ]
          },
          {
            "code": "510600_8",
            "name": "北川羌族自治县",
            "center": [
              104.7417,
              31.464
            ]
          },
          {
            "code": "510600_9",
            "name": "江油市",
            "center": [
              104.7417,
              31.464
            ]
          }
        ]
      },
      {
        "code": "510700",
        "name": "广元市",
        "center": [
          105.8297,
          32.4336
        ],
        "children": [
          {
            "code": "510700_ALL",
            "name": "全区全域",
            "center": [
              105.8297,
              32.4336
            ]
          },
          {
            "code": "510700_1",
            "name": "利州区",
            "center": [
              105.8297,
              32.4336
            ]
          },
          {
            "code": "510700_2",
            "name": "昭化区",
            "center": [
              105.8297,
              32.4336
            ]
          },
          {
            "code": "510700_3",
            "name": "朝天区",
            "center": [
              105.8297,
              32.4336
            ]
          },
          {
            "code": "510700_4",
            "name": "旺苍县",
            "center": [
              105.8297,
              32.4336
            ]
          },
          {
            "code": "510700_5",
            "name": "剑阁县",
            "center": [
              105.8297,
              32.4336
            ]
          },
          {
            "code": "510700_6",
            "name": "苍溪县",
            "center": [
              105.8297,
              32.4336
            ]
          },
          {
            "code": "510700_7",
            "name": "青川县",
            "center": [
              105.8297,
              32.4336
            ]
          }
        ]
      },
      {
        "code": "510800",
        "name": "遂宁市",
        "center": [
          105.5713,
          30.5133
        ],
        "children": [
          {
            "code": "510800_ALL",
            "name": "全区全域",
            "center": [
              105.5713,
              30.5133
            ]
          },
          {
            "code": "510800_1",
            "name": "船山区",
            "center": [
              105.5713,
              30.5133
            ]
          },
          {
            "code": "510800_2",
            "name": "安居区",
            "center": [
              105.5713,
              30.5133
            ]
          },
          {
            "code": "510800_3",
            "name": "蓬溪县",
            "center": [
              105.5713,
              30.5133
            ]
          },
          {
            "code": "510800_4",
            "name": "大英县",
            "center": [
              105.5713,
              30.5133
            ]
          },
          {
            "code": "510800_5",
            "name": "射洪市",
            "center": [
              105.5713,
              30.5133
            ]
          }
        ]
      },
      {
        "code": "510900",
        "name": "内江市",
        "center": [
          105.0661,
          29.587
        ],
        "children": [
          {
            "code": "510900_ALL",
            "name": "全区全域",
            "center": [
              105.0661,
              29.587
            ]
          },
          {
            "code": "510900_1",
            "name": "市中区",
            "center": [
              105.0661,
              29.587
            ]
          },
          {
            "code": "510900_2",
            "name": "东兴区",
            "center": [
              105.0661,
              29.587
            ]
          },
          {
            "code": "510900_3",
            "name": "威远县",
            "center": [
              105.0661,
              29.587
            ]
          },
          {
            "code": "510900_4",
            "name": "资中县",
            "center": [
              105.0661,
              29.587
            ]
          },
          {
            "code": "510900_5",
            "name": "隆昌市",
            "center": [
              105.0661,
              29.587
            ]
          }
        ]
      },
      {
        "code": "511000",
        "name": "乐山市",
        "center": [
          103.7613,
          29.582
        ],
        "children": [
          {
            "code": "511000_ALL",
            "name": "全区全域",
            "center": [
              103.7613,
              29.582
            ]
          },
          {
            "code": "511000_1",
            "name": "市中区",
            "center": [
              103.7613,
              29.582
            ]
          },
          {
            "code": "511000_2",
            "name": "沙湾区",
            "center": [
              103.7613,
              29.582
            ]
          },
          {
            "code": "511000_3",
            "name": "五通桥区",
            "center": [
              103.7613,
              29.582
            ]
          },
          {
            "code": "511000_4",
            "name": "金口河区",
            "center": [
              103.7613,
              29.582
            ]
          },
          {
            "code": "511000_5",
            "name": "犍为县",
            "center": [
              103.7613,
              29.582
            ]
          },
          {
            "code": "511000_6",
            "name": "井研县",
            "center": [
              103.7613,
              29.582
            ]
          },
          {
            "code": "511000_7",
            "name": "夹江县",
            "center": [
              103.7613,
              29.582
            ]
          },
          {
            "code": "511000_8",
            "name": "沐川县",
            "center": [
              103.7613,
              29.582
            ]
          },
          {
            "code": "511000_9",
            "name": "峨边彝族自治县",
            "center": [
              103.7613,
              29.582
            ]
          },
          {
            "code": "511000_10",
            "name": "马边彝族自治县",
            "center": [
              103.7613,
              29.582
            ]
          },
          {
            "code": "511000_11",
            "name": "峨眉山市",
            "center": [
              103.7613,
              29.582
            ]
          }
        ]
      },
      {
        "code": "511100",
        "name": "南充市",
        "center": [
          106.0829,
          30.7952
        ],
        "children": [
          {
            "code": "511100_ALL",
            "name": "全区全域",
            "center": [
              106.0829,
              30.7952
            ]
          },
          {
            "code": "511100_1",
            "name": "顺庆区",
            "center": [
              106.0829,
              30.7952
            ]
          },
          {
            "code": "511100_2",
            "name": "高坪区",
            "center": [
              106.0829,
              30.7952
            ]
          },
          {
            "code": "511100_3",
            "name": "嘉陵区",
            "center": [
              106.0829,
              30.7952
            ]
          },
          {
            "code": "511100_4",
            "name": "南部县",
            "center": [
              106.0829,
              30.7952
            ]
          },
          {
            "code": "511100_5",
            "name": "营山县",
            "center": [
              106.0829,
              30.7952
            ]
          },
          {
            "code": "511100_6",
            "name": "蓬安县",
            "center": [
              106.0829,
              30.7952
            ]
          },
          {
            "code": "511100_7",
            "name": "仪陇县",
            "center": [
              106.0829,
              30.7952
            ]
          },
          {
            "code": "511100_8",
            "name": "西充县",
            "center": [
              106.0829,
              30.7952
            ]
          },
          {
            "code": "511100_9",
            "name": "阆中市",
            "center": [
              106.0829,
              30.7952
            ]
          }
        ]
      },
      {
        "code": "511200",
        "name": "眉山市",
        "center": [
          103.8318,
          30.0483
        ],
        "children": [
          {
            "code": "511200_ALL",
            "name": "全区全域",
            "center": [
              103.8318,
              30.0483
            ]
          },
          {
            "code": "511200_1",
            "name": "东坡区",
            "center": [
              103.8318,
              30.0483
            ]
          },
          {
            "code": "511200_2",
            "name": "彭山区",
            "center": [
              103.8318,
              30.0483
            ]
          },
          {
            "code": "511200_3",
            "name": "仁寿县",
            "center": [
              103.8318,
              30.0483
            ]
          },
          {
            "code": "511200_4",
            "name": "洪雅县",
            "center": [
              103.8318,
              30.0483
            ]
          },
          {
            "code": "511200_5",
            "name": "丹棱县",
            "center": [
              103.8318,
              30.0483
            ]
          },
          {
            "code": "511200_6",
            "name": "青神县",
            "center": [
              103.8318,
              30.0483
            ]
          }
        ]
      },
      {
        "code": "511300",
        "name": "宜宾市",
        "center": [
          104.6308,
          28.7602
        ],
        "children": [
          {
            "code": "511300_ALL",
            "name": "全区全域",
            "center": [
              104.6308,
              28.7602
            ]
          },
          {
            "code": "511300_1",
            "name": "翠屏区",
            "center": [
              104.6308,
              28.7602
            ]
          },
          {
            "code": "511300_2",
            "name": "南溪区",
            "center": [
              104.6308,
              28.7602
            ]
          },
          {
            "code": "511300_3",
            "name": "叙州区",
            "center": [
              104.6308,
              28.7602
            ]
          },
          {
            "code": "511300_4",
            "name": "江安县",
            "center": [
              104.6308,
              28.7602
            ]
          },
          {
            "code": "511300_5",
            "name": "长宁县",
            "center": [
              104.6308,
              28.7602
            ]
          },
          {
            "code": "511300_6",
            "name": "高县",
            "center": [
              104.6308,
              28.7602
            ]
          },
          {
            "code": "511300_7",
            "name": "珙县",
            "center": [
              104.6308,
              28.7602
            ]
          },
          {
            "code": "511300_8",
            "name": "筠连县",
            "center": [
              104.6308,
              28.7602
            ]
          },
          {
            "code": "511300_9",
            "name": "兴文县",
            "center": [
              104.6308,
              28.7602
            ]
          },
          {
            "code": "511300_10",
            "name": "屏山县",
            "center": [
              104.6308,
              28.7602
            ]
          }
        ]
      },
      {
        "code": "511400",
        "name": "广安市",
        "center": [
          106.6333,
          30.4563
        ],
        "children": [
          {
            "code": "511400_ALL",
            "name": "全区全域",
            "center": [
              106.6333,
              30.4563
            ]
          },
          {
            "code": "511400_1",
            "name": "广安区",
            "center": [
              106.6333,
              30.4563
            ]
          },
          {
            "code": "511400_2",
            "name": "前锋区",
            "center": [
              106.6333,
              30.4563
            ]
          },
          {
            "code": "511400_3",
            "name": "岳池县",
            "center": [
              106.6333,
              30.4563
            ]
          },
          {
            "code": "511400_4",
            "name": "武胜县",
            "center": [
              106.6333,
              30.4563
            ]
          },
          {
            "code": "511400_5",
            "name": "邻水县",
            "center": [
              106.6333,
              30.4563
            ]
          },
          {
            "code": "511400_6",
            "name": "华蓥市",
            "center": [
              106.6333,
              30.4563
            ]
          }
        ]
      },
      {
        "code": "511500",
        "name": "达州市",
        "center": [
          107.5023,
          31.2095
        ],
        "children": [
          {
            "code": "511500_ALL",
            "name": "全区全域",
            "center": [
              107.5023,
              31.2095
            ]
          },
          {
            "code": "511500_1",
            "name": "通川区",
            "center": [
              107.5023,
              31.2095
            ]
          },
          {
            "code": "511500_2",
            "name": "达川区",
            "center": [
              107.5023,
              31.2095
            ]
          },
          {
            "code": "511500_3",
            "name": "宣汉县",
            "center": [
              107.5023,
              31.2095
            ]
          },
          {
            "code": "511500_4",
            "name": "开江县",
            "center": [
              107.5023,
              31.2095
            ]
          },
          {
            "code": "511500_5",
            "name": "渠县",
            "center": [
              107.5023,
              31.2095
            ]
          },
          {
            "code": "511500_6",
            "name": "大竹县",
            "center": [
              107.5023,
              31.2095
            ]
          },
          {
            "code": "511500_7",
            "name": "万源市",
            "center": [
              107.5023,
              31.2095
            ]
          }
        ]
      },
      {
        "code": "511600",
        "name": "雅安市",
        "center": [
          103.001,
          29.9803
        ],
        "children": [
          {
            "code": "511600_ALL",
            "name": "全区全域",
            "center": [
              103.001,
              29.9803
            ]
          },
          {
            "code": "511600_1",
            "name": "雨城区",
            "center": [
              103.001,
              29.9803
            ]
          },
          {
            "code": "511600_2",
            "name": "名山区",
            "center": [
              103.001,
              29.9803
            ]
          },
          {
            "code": "511600_3",
            "name": "荥经县",
            "center": [
              103.001,
              29.9803
            ]
          },
          {
            "code": "511600_4",
            "name": "汉源县",
            "center": [
              103.001,
              29.9803
            ]
          },
          {
            "code": "511600_5",
            "name": "石棉县",
            "center": [
              103.001,
              29.9803
            ]
          },
          {
            "code": "511600_6",
            "name": "天全县",
            "center": [
              103.001,
              29.9803
            ]
          },
          {
            "code": "511600_7",
            "name": "芦山县",
            "center": [
              103.001,
              29.9803
            ]
          },
          {
            "code": "511600_8",
            "name": "宝兴县",
            "center": [
              103.001,
              29.9803
            ]
          }
        ]
      },
      {
        "code": "511700",
        "name": "巴中市",
        "center": [
          106.7537,
          31.8588
        ],
        "children": [
          {
            "code": "511700_ALL",
            "name": "全区全域",
            "center": [
              106.7537,
              31.8588
            ]
          },
          {
            "code": "511700_1",
            "name": "巴州区",
            "center": [
              106.7537,
              31.8588
            ]
          },
          {
            "code": "511700_2",
            "name": "恩阳区",
            "center": [
              106.7537,
              31.8588
            ]
          },
          {
            "code": "511700_3",
            "name": "通江县",
            "center": [
              106.7537,
              31.8588
            ]
          },
          {
            "code": "511700_4",
            "name": "南江县",
            "center": [
              106.7537,
              31.8588
            ]
          },
          {
            "code": "511700_5",
            "name": "平昌县",
            "center": [
              106.7537,
              31.8588
            ]
          }
        ]
      },
      {
        "code": "511800",
        "name": "资阳市",
        "center": [
          104.6419,
          30.1222
        ],
        "children": [
          {
            "code": "511800_ALL",
            "name": "全区全域",
            "center": [
              104.6419,
              30.1222
            ]
          },
          {
            "code": "511800_1",
            "name": "雁江区",
            "center": [
              104.6419,
              30.1222
            ]
          },
          {
            "code": "511800_2",
            "name": "安岳县",
            "center": [
              104.6419,
              30.1222
            ]
          },
          {
            "code": "511800_3",
            "name": "乐至县",
            "center": [
              104.6419,
              30.1222
            ]
          }
        ]
      },
      {
        "code": "511900",
        "name": "阿坝藏族羌族自治州",
        "center": [
          102.2246,
          31.8994
        ],
        "children": [
          {
            "code": "511900_ALL",
            "name": "全区全域",
            "center": [
              102.2246,
              31.8994
            ]
          },
          {
            "code": "511900_1",
            "name": "马尔康市",
            "center": [
              102.2246,
              31.8994
            ]
          },
          {
            "code": "511900_2",
            "name": "汶川县",
            "center": [
              102.2246,
              31.8994
            ]
          },
          {
            "code": "511900_3",
            "name": "理县",
            "center": [
              102.2246,
              31.8994
            ]
          },
          {
            "code": "511900_4",
            "name": "茂县",
            "center": [
              102.2246,
              31.8994
            ]
          },
          {
            "code": "511900_5",
            "name": "松潘县",
            "center": [
              102.2246,
              31.8994
            ]
          },
          {
            "code": "511900_6",
            "name": "九寨沟县",
            "center": [
              102.2246,
              31.8994
            ]
          },
          {
            "code": "511900_7",
            "name": "金川县",
            "center": [
              102.2246,
              31.8994
            ]
          },
          {
            "code": "511900_8",
            "name": "小金县",
            "center": [
              102.2246,
              31.8994
            ]
          },
          {
            "code": "511900_9",
            "name": "黑水县",
            "center": [
              102.2246,
              31.8994
            ]
          },
          {
            "code": "511900_10",
            "name": "壤塘县",
            "center": [
              102.2246,
              31.8994
            ]
          },
          {
            "code": "511900_11",
            "name": "阿坝县",
            "center": [
              102.2246,
              31.8994
            ]
          },
          {
            "code": "511900_12",
            "name": "若尔盖县",
            "center": [
              102.2246,
              31.8994
            ]
          },
          {
            "code": "511900_13",
            "name": "红原县",
            "center": [
              102.2246,
              31.8994
            ]
          }
        ]
      },
      {
        "code": "512000",
        "name": "甘孜藏族自治州",
        "center": [
          101.9638,
          30.0507
        ],
        "children": [
          {
            "code": "512000_ALL",
            "name": "全区全域",
            "center": [
              101.9638,
              30.0507
            ]
          },
          {
            "code": "512000_1",
            "name": "康定市",
            "center": [
              101.9638,
              30.0507
            ]
          },
          {
            "code": "512000_2",
            "name": "泸定县",
            "center": [
              101.9638,
              30.0507
            ]
          },
          {
            "code": "512000_3",
            "name": "丹巴县",
            "center": [
              101.9638,
              30.0507
            ]
          },
          {
            "code": "512000_4",
            "name": "九龙县",
            "center": [
              101.9638,
              30.0507
            ]
          },
          {
            "code": "512000_5",
            "name": "雅江县",
            "center": [
              101.9638,
              30.0507
            ]
          },
          {
            "code": "512000_6",
            "name": "道孚县",
            "center": [
              101.9638,
              30.0507
            ]
          },
          {
            "code": "512000_7",
            "name": "炉霍县",
            "center": [
              101.9638,
              30.0507
            ]
          },
          {
            "code": "512000_8",
            "name": "甘孜县",
            "center": [
              101.9638,
              30.0507
            ]
          },
          {
            "code": "512000_9",
            "name": "新龙县",
            "center": [
              101.9638,
              30.0507
            ]
          },
          {
            "code": "512000_10",
            "name": "德格县",
            "center": [
              101.9638,
              30.0507
            ]
          },
          {
            "code": "512000_11",
            "name": "白玉县",
            "center": [
              101.9638,
              30.0507
            ]
          },
          {
            "code": "512000_12",
            "name": "石渠县",
            "center": [
              101.9638,
              30.0507
            ]
          },
          {
            "code": "512000_13",
            "name": "色达县",
            "center": [
              101.9638,
              30.0507
            ]
          },
          {
            "code": "512000_14",
            "name": "理塘县",
            "center": [
              101.9638,
              30.0507
            ]
          },
          {
            "code": "512000_15",
            "name": "巴塘县",
            "center": [
              101.9638,
              30.0507
            ]
          },
          {
            "code": "512000_16",
            "name": "乡城县",
            "center": [
              101.9638,
              30.0507
            ]
          },
          {
            "code": "512000_17",
            "name": "稻城县",
            "center": [
              101.9638,
              30.0507
            ]
          },
          {
            "code": "512000_18",
            "name": "得荣县",
            "center": [
              101.9638,
              30.0507
            ]
          }
        ]
      },
      {
        "code": "512100",
        "name": "凉山彝族自治州",
        "center": [
          102.2673,
          27.8818
        ],
        "children": [
          {
            "code": "512100_ALL",
            "name": "全区全域",
            "center": [
              102.2673,
              27.8818
            ]
          },
          {
            "code": "512100_1",
            "name": "西昌市",
            "center": [
              102.2673,
              27.8818
            ]
          },
          {
            "code": "512100_2",
            "name": "会理市",
            "center": [
              102.2673,
              27.8818
            ]
          },
          {
            "code": "512100_3",
            "name": "木里藏族自治县",
            "center": [
              102.2673,
              27.8818
            ]
          },
          {
            "code": "512100_4",
            "name": "盐源县",
            "center": [
              102.2673,
              27.8818
            ]
          },
          {
            "code": "512100_5",
            "name": "德昌县",
            "center": [
              102.2673,
              27.8818
            ]
          },
          {
            "code": "512100_6",
            "name": "会东县",
            "center": [
              102.2673,
              27.8818
            ]
          },
          {
            "code": "512100_7",
            "name": "宁南县",
            "center": [
              102.2673,
              27.8818
            ]
          },
          {
            "code": "512100_8",
            "name": "普格县",
            "center": [
              102.2673,
              27.8818
            ]
          },
          {
            "code": "512100_9",
            "name": "布拖县",
            "center": [
              102.2673,
              27.8818
            ]
          },
          {
            "code": "512100_10",
            "name": "金阳县",
            "center": [
              102.2673,
              27.8818
            ]
          },
          {
            "code": "512100_11",
            "name": "昭觉县",
            "center": [
              102.2673,
              27.8818
            ]
          },
          {
            "code": "512100_12",
            "name": "喜德县",
            "center": [
              102.2673,
              27.8818
            ]
          },
          {
            "code": "512100_13",
            "name": "冕宁县",
            "center": [
              102.2673,
              27.8818
            ]
          },
          {
            "code": "512100_14",
            "name": "越西县",
            "center": [
              102.2673,
              27.8818
            ]
          },
          {
            "code": "512100_15",
            "name": "甘洛县",
            "center": [
              102.2673,
              27.8818
            ]
          },
          {
            "code": "512100_16",
            "name": "美姑县",
            "center": [
              102.2673,
              27.8818
            ]
          },
          {
            "code": "512100_17",
            "name": "雷波县",
            "center": [
              102.2673,
              27.8818
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "440000",
    "name": "广东省",
    "center": [
      113.2806,
      23.1251
    ],
    "children": [
      {
        "code": "440000_ALL",
        "name": "全省范围",
        "center": [
          113.2806,
          23.1251
        ],
        "children": [
          {
            "code": "440000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              113.2806,
              23.1251
            ]
          }
        ]
      },
      {
        "code": "440100",
        "name": "广州市",
        "center": [
          113.2806,
          23.1251
        ],
        "children": [
          {
            "code": "440100_ALL",
            "name": "全区全域",
            "center": [
              113.2806,
              23.1251
            ]
          },
          {
            "code": "440100_1",
            "name": "越秀区",
            "center": [
              113.2806,
              23.1251
            ]
          },
          {
            "code": "440100_2",
            "name": "海珠区",
            "center": [
              113.2806,
              23.1251
            ]
          },
          {
            "code": "440100_3",
            "name": "荔湾区",
            "center": [
              113.2806,
              23.1251
            ]
          },
          {
            "code": "440100_4",
            "name": "天河区",
            "center": [
              113.2806,
              23.1251
            ]
          },
          {
            "code": "440100_5",
            "name": "白云区",
            "center": [
              113.2806,
              23.1251
            ]
          },
          {
            "code": "440100_6",
            "name": "黄埔区",
            "center": [
              113.2806,
              23.1251
            ]
          },
          {
            "code": "440100_7",
            "name": "番禺区",
            "center": [
              113.2806,
              23.1251
            ]
          },
          {
            "code": "440100_8",
            "name": "花都区",
            "center": [
              113.2806,
              23.1251
            ]
          },
          {
            "code": "440100_9",
            "name": "南沙区",
            "center": [
              113.2806,
              23.1251
            ]
          },
          {
            "code": "440100_10",
            "name": "从化区",
            "center": [
              113.2806,
              23.1251
            ]
          },
          {
            "code": "440100_11",
            "name": "增城区",
            "center": [
              113.2806,
              23.1251
            ]
          }
        ]
      },
      {
        "code": "440200",
        "name": "深圳市",
        "center": [
          114.0859,
          22.547
        ],
        "children": [
          {
            "code": "440200_ALL",
            "name": "全区全域",
            "center": [
              114.0859,
              22.547
            ]
          },
          {
            "code": "440200_1",
            "name": "罗湖区",
            "center": [
              114.0859,
              22.547
            ]
          },
          {
            "code": "440200_2",
            "name": "福田区",
            "center": [
              114.0859,
              22.547
            ]
          },
          {
            "code": "440200_3",
            "name": "南山区",
            "center": [
              114.0859,
              22.547
            ]
          },
          {
            "code": "440200_4",
            "name": "宝安区",
            "center": [
              114.0859,
              22.547
            ]
          },
          {
            "code": "440200_5",
            "name": "龙岗区",
            "center": [
              114.0859,
              22.547
            ]
          },
          {
            "code": "440200_6",
            "name": "盐田区",
            "center": [
              114.0859,
              22.547
            ]
          },
          {
            "code": "440200_7",
            "name": "龙华区",
            "center": [
              114.0859,
              22.547
            ]
          },
          {
            "code": "440200_8",
            "name": "坪山区",
            "center": [
              114.0859,
              22.547
            ]
          },
          {
            "code": "440200_9",
            "name": "光明区",
            "center": [
              114.0859,
              22.547
            ]
          },
          {
            "code": "440200_10",
            "name": "大鹏新区",
            "center": [
              114.0859,
              22.547
            ]
          }
        ]
      },
      {
        "code": "440300",
        "name": "珠海市",
        "center": [
          113.5767,
          22.2707
        ],
        "children": [
          {
            "code": "440300_ALL",
            "name": "全区全域",
            "center": [
              113.5767,
              22.2707
            ]
          },
          {
            "code": "440300_1",
            "name": "香洲区",
            "center": [
              113.5767,
              22.2707
            ]
          },
          {
            "code": "440300_2",
            "name": "斗门区",
            "center": [
              113.5767,
              22.2707
            ]
          },
          {
            "code": "440300_3",
            "name": "金湾区",
            "center": [
              113.5767,
              22.2707
            ]
          }
        ]
      },
      {
        "code": "440400",
        "name": "汕头市",
        "center": [
          116.682,
          23.3541
        ],
        "children": [
          {
            "code": "440400_ALL",
            "name": "全区全域",
            "center": [
              116.682,
              23.3541
            ]
          },
          {
            "code": "440400_1",
            "name": "龙湖区",
            "center": [
              116.682,
              23.3541
            ]
          },
          {
            "code": "440400_2",
            "name": "金平区",
            "center": [
              116.682,
              23.3541
            ]
          },
          {
            "code": "440400_3",
            "name": "濠江区",
            "center": [
              116.682,
              23.3541
            ]
          },
          {
            "code": "440400_4",
            "name": "潮阳区",
            "center": [
              116.682,
              23.3541
            ]
          },
          {
            "code": "440400_5",
            "name": "潮南区",
            "center": [
              116.682,
              23.3541
            ]
          },
          {
            "code": "440400_6",
            "name": "澄海区",
            "center": [
              116.682,
              23.3541
            ]
          },
          {
            "code": "440400_7",
            "name": "南澳县",
            "center": [
              116.682,
              23.3541
            ]
          }
        ]
      },
      {
        "code": "440500",
        "name": "韶关市",
        "center": [
          113.5975,
          24.8111
        ],
        "children": [
          {
            "code": "440500_ALL",
            "name": "全区全域",
            "center": [
              113.5975,
              24.8111
            ]
          },
          {
            "code": "440500_1",
            "name": "武江区",
            "center": [
              113.5975,
              24.8111
            ]
          },
          {
            "code": "440500_2",
            "name": "浈江区",
            "center": [
              113.5975,
              24.8111
            ]
          },
          {
            "code": "440500_3",
            "name": "曲江区",
            "center": [
              113.5975,
              24.8111
            ]
          },
          {
            "code": "440500_4",
            "name": "始兴县",
            "center": [
              113.5975,
              24.8111
            ]
          },
          {
            "code": "440500_5",
            "name": "仁化县",
            "center": [
              113.5975,
              24.8111
            ]
          },
          {
            "code": "440500_6",
            "name": "翁源县",
            "center": [
              113.5975,
              24.8111
            ]
          },
          {
            "code": "440500_7",
            "name": "乳源县",
            "center": [
              113.5975,
              24.8111
            ]
          },
          {
            "code": "440500_8",
            "name": "新丰县",
            "center": [
              113.5975,
              24.8111
            ]
          },
          {
            "code": "440500_9",
            "name": "乐昌市",
            "center": [
              113.5975,
              24.8111
            ]
          },
          {
            "code": "440500_10",
            "name": "南雄市",
            "center": [
              113.5975,
              24.8111
            ]
          }
        ]
      },
      {
        "code": "440600",
        "name": "佛山市",
        "center": [
          113.1227,
          23.0288
        ],
        "children": [
          {
            "code": "440600_ALL",
            "name": "全区全域",
            "center": [
              113.1227,
              23.0288
            ]
          },
          {
            "code": "440600_1",
            "name": "禅城区",
            "center": [
              113.1227,
              23.0288
            ]
          },
          {
            "code": "440600_2",
            "name": "南海区",
            "center": [
              113.1227,
              23.0288
            ]
          },
          {
            "code": "440600_3",
            "name": "顺德区",
            "center": [
              113.1227,
              23.0288
            ]
          },
          {
            "code": "440600_4",
            "name": "三水区",
            "center": [
              113.1227,
              23.0288
            ]
          },
          {
            "code": "440600_5",
            "name": "高明区",
            "center": [
              113.1227,
              23.0288
            ]
          }
        ]
      },
      {
        "code": "440700",
        "name": "江门市",
        "center": [
          113.0819,
          22.5787
        ],
        "children": [
          {
            "code": "440700_ALL",
            "name": "全区全域",
            "center": [
              113.0819,
              22.5787
            ]
          },
          {
            "code": "440700_1",
            "name": "蓬江区",
            "center": [
              113.0819,
              22.5787
            ]
          },
          {
            "code": "440700_2",
            "name": "江海区",
            "center": [
              113.0819,
              22.5787
            ]
          },
          {
            "code": "440700_3",
            "name": "新会区",
            "center": [
              113.0819,
              22.5787
            ]
          },
          {
            "code": "440700_4",
            "name": "台山市",
            "center": [
              113.0819,
              22.5787
            ]
          },
          {
            "code": "440700_5",
            "name": "开平市",
            "center": [
              113.0819,
              22.5787
            ]
          },
          {
            "code": "440700_6",
            "name": "鹤山市",
            "center": [
              113.0819,
              22.5787
            ]
          },
          {
            "code": "440700_7",
            "name": "恩平市",
            "center": [
              113.0819,
              22.5787
            ]
          }
        ]
      },
      {
        "code": "440800",
        "name": "湛江市",
        "center": [
          110.3649,
          21.2749
        ],
        "children": [
          {
            "code": "440800_ALL",
            "name": "全区全域",
            "center": [
              110.3649,
              21.2749
            ]
          },
          {
            "code": "440800_1",
            "name": "赤坎区",
            "center": [
              110.3649,
              21.2749
            ]
          },
          {
            "code": "440800_2",
            "name": "霞山区",
            "center": [
              110.3649,
              21.2749
            ]
          },
          {
            "code": "440800_3",
            "name": "坡头区",
            "center": [
              110.3649,
              21.2749
            ]
          },
          {
            "code": "440800_4",
            "name": "麻章区",
            "center": [
              110.3649,
              21.2749
            ]
          },
          {
            "code": "440800_5",
            "name": "遂溪县",
            "center": [
              110.3649,
              21.2749
            ]
          },
          {
            "code": "440800_6",
            "name": "徐闻县",
            "center": [
              110.3649,
              21.2749
            ]
          },
          {
            "code": "440800_7",
            "name": "廉江市",
            "center": [
              110.3649,
              21.2749
            ]
          },
          {
            "code": "440800_8",
            "name": "雷州市",
            "center": [
              110.3649,
              21.2749
            ]
          },
          {
            "code": "440800_9",
            "name": "吴川市",
            "center": [
              110.3649,
              21.2749
            ]
          }
        ]
      },
      {
        "code": "440900",
        "name": "茂名市",
        "center": [
          110.9192,
          21.6598
        ],
        "children": [
          {
            "code": "440900_ALL",
            "name": "全区全域",
            "center": [
              110.9192,
              21.6598
            ]
          },
          {
            "code": "440900_1",
            "name": "茂南区",
            "center": [
              110.9192,
              21.6598
            ]
          },
          {
            "code": "440900_2",
            "name": "电白区",
            "center": [
              110.9192,
              21.6598
            ]
          },
          {
            "code": "440900_3",
            "name": "高州市",
            "center": [
              110.9192,
              21.6598
            ]
          },
          {
            "code": "440900_4",
            "name": "化州市",
            "center": [
              110.9192,
              21.6598
            ]
          },
          {
            "code": "440900_5",
            "name": "信宜市",
            "center": [
              110.9192,
              21.6598
            ]
          }
        ]
      },
      {
        "code": "441000",
        "name": "肇庆市",
        "center": [
          112.4725,
          23.0515
        ],
        "children": [
          {
            "code": "441000_ALL",
            "name": "全区全域",
            "center": [
              112.4725,
              23.0515
            ]
          },
          {
            "code": "441000_1",
            "name": "端州区",
            "center": [
              112.4725,
              23.0515
            ]
          },
          {
            "code": "441000_2",
            "name": "鼎湖区",
            "center": [
              112.4725,
              23.0515
            ]
          },
          {
            "code": "441000_3",
            "name": "高要区",
            "center": [
              112.4725,
              23.0515
            ]
          },
          {
            "code": "441000_4",
            "name": "广宁县",
            "center": [
              112.4725,
              23.0515
            ]
          },
          {
            "code": "441000_5",
            "name": "怀集县",
            "center": [
              112.4725,
              23.0515
            ]
          },
          {
            "code": "441000_6",
            "name": "封开县",
            "center": [
              112.4725,
              23.0515
            ]
          },
          {
            "code": "441000_7",
            "name": "德庆县",
            "center": [
              112.4725,
              23.0515
            ]
          },
          {
            "code": "441000_8",
            "name": "四会市",
            "center": [
              112.4725,
              23.0515
            ]
          }
        ]
      },
      {
        "code": "441100",
        "name": "惠州市",
        "center": [
          114.4126,
          23.0794
        ],
        "children": [
          {
            "code": "441100_ALL",
            "name": "全区全域",
            "center": [
              114.4126,
              23.0794
            ]
          },
          {
            "code": "441100_1",
            "name": "惠城区",
            "center": [
              114.4126,
              23.0794
            ]
          },
          {
            "code": "441100_2",
            "name": "惠阳区",
            "center": [
              114.4126,
              23.0794
            ]
          },
          {
            "code": "441100_3",
            "name": "博罗县",
            "center": [
              114.4126,
              23.0794
            ]
          },
          {
            "code": "441100_4",
            "name": "惠东县",
            "center": [
              114.4126,
              23.0794
            ]
          },
          {
            "code": "441100_5",
            "name": "龙门县",
            "center": [
              114.4126,
              23.0794
            ]
          }
        ]
      },
      {
        "code": "441200",
        "name": "梅州市",
        "center": [
          116.1176,
          24.2991
        ],
        "children": [
          {
            "code": "441200_ALL",
            "name": "全区全域",
            "center": [
              116.1176,
              24.2991
            ]
          },
          {
            "code": "441200_1",
            "name": "梅江区",
            "center": [
              116.1176,
              24.2991
            ]
          },
          {
            "code": "441200_2",
            "name": "梅县区",
            "center": [
              116.1176,
              24.2991
            ]
          },
          {
            "code": "441200_3",
            "name": "大埔县",
            "center": [
              116.1176,
              24.2991
            ]
          },
          {
            "code": "441200_4",
            "name": "丰顺县",
            "center": [
              116.1176,
              24.2991
            ]
          },
          {
            "code": "441200_5",
            "name": "五华县",
            "center": [
              116.1176,
              24.2991
            ]
          },
          {
            "code": "441200_6",
            "name": "平远县",
            "center": [
              116.1176,
              24.2991
            ]
          },
          {
            "code": "441200_7",
            "name": "蕉岭县",
            "center": [
              116.1176,
              24.2991
            ]
          },
          {
            "code": "441200_8",
            "name": "兴宁市",
            "center": [
              116.1176,
              24.2991
            ]
          }
        ]
      },
      {
        "code": "441300",
        "name": "汕尾市",
        "center": [
          115.3642,
          22.7844
        ],
        "children": [
          {
            "code": "441300_ALL",
            "name": "全区全域",
            "center": [
              115.3642,
              22.7844
            ]
          },
          {
            "code": "441300_1",
            "name": "城区",
            "center": [
              115.3642,
              22.7844
            ]
          },
          {
            "code": "441300_2",
            "name": "海丰县",
            "center": [
              115.3642,
              22.7844
            ]
          },
          {
            "code": "441300_3",
            "name": "陆河县",
            "center": [
              115.3642,
              22.7844
            ]
          },
          {
            "code": "441300_4",
            "name": "陆丰市",
            "center": [
              115.3642,
              22.7844
            ]
          }
        ]
      },
      {
        "code": "441400",
        "name": "河源市",
        "center": [
          114.6978,
          23.7463
        ],
        "children": [
          {
            "code": "441400_ALL",
            "name": "全区全域",
            "center": [
              114.6978,
              23.7463
            ]
          },
          {
            "code": "441400_1",
            "name": "源城区",
            "center": [
              114.6978,
              23.7463
            ]
          },
          {
            "code": "441400_2",
            "name": "紫金县",
            "center": [
              114.6978,
              23.7463
            ]
          },
          {
            "code": "441400_3",
            "name": "龙川县",
            "center": [
              114.6978,
              23.7463
            ]
          },
          {
            "code": "441400_4",
            "name": "连平县",
            "center": [
              114.6978,
              23.7463
            ]
          },
          {
            "code": "441400_5",
            "name": "和平县",
            "center": [
              114.6978,
              23.7463
            ]
          },
          {
            "code": "441400_6",
            "name": "东源县",
            "center": [
              114.6978,
              23.7463
            ]
          }
        ]
      },
      {
        "code": "441500",
        "name": "阳江市",
        "center": [
          111.9751,
          21.8592
        ],
        "children": [
          {
            "code": "441500_ALL",
            "name": "全区全域",
            "center": [
              111.9751,
              21.8592
            ]
          },
          {
            "code": "441500_1",
            "name": "江城区",
            "center": [
              111.9751,
              21.8592
            ]
          },
          {
            "code": "441500_2",
            "name": "阳东区",
            "center": [
              111.9751,
              21.8592
            ]
          },
          {
            "code": "441500_3",
            "name": "阳西县",
            "center": [
              111.9751,
              21.8592
            ]
          },
          {
            "code": "441500_4",
            "name": "阳春市",
            "center": [
              111.9751,
              21.8592
            ]
          }
        ]
      },
      {
        "code": "441600",
        "name": "清远市",
        "center": [
          113.0512,
          23.6853
        ],
        "children": [
          {
            "code": "441600_ALL",
            "name": "全区全域",
            "center": [
              113.0512,
              23.6853
            ]
          },
          {
            "code": "441600_1",
            "name": "清城区",
            "center": [
              113.0512,
              23.6853
            ]
          },
          {
            "code": "441600_2",
            "name": "清新区",
            "center": [
              113.0512,
              23.6853
            ]
          },
          {
            "code": "441600_3",
            "name": "佛冈县",
            "center": [
              113.0512,
              23.6853
            ]
          },
          {
            "code": "441600_4",
            "name": "阳山县",
            "center": [
              113.0512,
              23.6853
            ]
          },
          {
            "code": "441600_5",
            "name": "连南县",
            "center": [
              113.0512,
              23.6853
            ]
          },
          {
            "code": "441600_6",
            "name": "连山县",
            "center": [
              113.0512,
              23.6853
            ]
          },
          {
            "code": "441600_7",
            "name": "英德市",
            "center": [
              113.0512,
              23.6853
            ]
          },
          {
            "code": "441600_8",
            "name": "连州市",
            "center": [
              113.0512,
              23.6853
            ]
          }
        ]
      },
      {
        "code": "441700",
        "name": "东莞市",
        "center": [
          113.7518,
          23.0207
        ],
        "children": [
          {
            "code": "441700_ALL",
            "name": "全区全域",
            "center": [
              113.7518,
              23.0207
            ]
          },
          {
            "code": "441700_1",
            "name": "莞城街道",
            "center": [
              113.7518,
              23.0207
            ]
          },
          {
            "code": "441700_2",
            "name": "南城街道",
            "center": [
              113.7518,
              23.0207
            ]
          },
          {
            "code": "441700_3",
            "name": "东城街道",
            "center": [
              113.7518,
              23.0207
            ]
          },
          {
            "code": "441700_4",
            "name": "万江街道",
            "center": [
              113.7518,
              23.0207
            ]
          },
          {
            "code": "441700_5",
            "name": "长安镇",
            "center": [
              113.7518,
              23.0207
            ]
          },
          {
            "code": "441700_6",
            "name": "虎门镇",
            "center": [
              113.7518,
              23.0207
            ]
          },
          {
            "code": "441700_7",
            "name": "厚街镇",
            "center": [
              113.7518,
              23.0207
            ]
          },
          {
            "code": "441700_8",
            "name": "塘厦镇",
            "center": [
              113.7518,
              23.0207
            ]
          },
          {
            "code": "441700_9",
            "name": "常平镇",
            "center": [
              113.7518,
              23.0207
            ]
          },
          {
            "code": "441700_10",
            "name": "寮步镇",
            "center": [
              113.7518,
              23.0207
            ]
          }
        ]
      },
      {
        "code": "441800",
        "name": "中山市",
        "center": [
          113.3824,
          22.5211
        ],
        "children": [
          {
            "code": "441800_ALL",
            "name": "全区全域",
            "center": [
              113.3824,
              22.5211
            ]
          },
          {
            "code": "441800_1",
            "name": "石岐街道",
            "center": [
              113.3824,
              22.5211
            ]
          },
          {
            "code": "441800_2",
            "name": "东区街道",
            "center": [
              113.3824,
              22.5211
            ]
          },
          {
            "code": "441800_3",
            "name": "西区街道",
            "center": [
              113.3824,
              22.5211
            ]
          },
          {
            "code": "441800_4",
            "name": "南区街道",
            "center": [
              113.3824,
              22.5211
            ]
          },
          {
            "code": "441800_5",
            "name": "火炬开发区",
            "center": [
              113.3824,
              22.5211
            ]
          },
          {
            "code": "441800_6",
            "name": "小榄镇",
            "center": [
              113.3824,
              22.5211
            ]
          },
          {
            "code": "441800_7",
            "name": "三乡镇",
            "center": [
              113.3824,
              22.5211
            ]
          },
          {
            "code": "441800_8",
            "name": "坦洲镇",
            "center": [
              113.3824,
              22.5211
            ]
          },
          {
            "code": "441800_9",
            "name": "古镇镇",
            "center": [
              113.3824,
              22.5211
            ]
          }
        ]
      },
      {
        "code": "441900",
        "name": "潮州市",
        "center": [
          116.6323,
          23.6617
        ],
        "children": [
          {
            "code": "441900_ALL",
            "name": "全区全域",
            "center": [
              116.6323,
              23.6617
            ]
          },
          {
            "code": "441900_1",
            "name": "湘桥区",
            "center": [
              116.6323,
              23.6617
            ]
          },
          {
            "code": "441900_2",
            "name": "潮安区",
            "center": [
              116.6323,
              23.6617
            ]
          },
          {
            "code": "441900_3",
            "name": "饶平县",
            "center": [
              116.6323,
              23.6617
            ]
          }
        ]
      },
      {
        "code": "442000",
        "name": "揭阳市",
        "center": [
          116.3557,
          23.5438
        ],
        "children": [
          {
            "code": "442000_ALL",
            "name": "全区全域",
            "center": [
              116.3557,
              23.5438
            ]
          },
          {
            "code": "442000_1",
            "name": "榕城区",
            "center": [
              116.3557,
              23.5438
            ]
          },
          {
            "code": "442000_2",
            "name": "揭东区",
            "center": [
              116.3557,
              23.5438
            ]
          },
          {
            "code": "442000_3",
            "name": "揭西县",
            "center": [
              116.3557,
              23.5438
            ]
          },
          {
            "code": "442000_4",
            "name": "惠来县",
            "center": [
              116.3557,
              23.5438
            ]
          },
          {
            "code": "442000_5",
            "name": "普宁市",
            "center": [
              116.3557,
              23.5438
            ]
          }
        ]
      },
      {
        "code": "442100",
        "name": "云浮市",
        "center": [
          112.0444,
          22.9298
        ],
        "children": [
          {
            "code": "442100_ALL",
            "name": "全区全域",
            "center": [
              112.0444,
              22.9298
            ]
          },
          {
            "code": "442100_1",
            "name": "云城区",
            "center": [
              112.0444,
              22.9298
            ]
          },
          {
            "code": "442100_2",
            "name": "云安区",
            "center": [
              112.0444,
              22.9298
            ]
          },
          {
            "code": "442100_3",
            "name": "新兴县",
            "center": [
              112.0444,
              22.9298
            ]
          },
          {
            "code": "442100_4",
            "name": "郁南县",
            "center": [
              112.0444,
              22.9298
            ]
          },
          {
            "code": "442100_5",
            "name": "罗定市",
            "center": [
              112.0444,
              22.9298
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "320000",
    "name": "江苏省",
    "center": [
      118.7674,
      32.0415
    ],
    "children": [
      {
        "code": "320000_ALL",
        "name": "全省范围",
        "center": [
          118.7674,
          32.0415
        ],
        "children": [
          {
            "code": "320000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              118.7674,
              32.0415
            ]
          }
        ]
      },
      {
        "code": "320100",
        "name": "南京市",
        "center": [
          118.7674,
          32.0415
        ],
        "children": [
          {
            "code": "320100_ALL",
            "name": "全区全域",
            "center": [
              118.7674,
              32.0415
            ]
          },
          {
            "code": "320100_1",
            "name": "玄武区",
            "center": [
              118.7674,
              32.0415
            ]
          },
          {
            "code": "320100_2",
            "name": "秦淮区",
            "center": [
              118.7674,
              32.0415
            ]
          },
          {
            "code": "320100_3",
            "name": "建邺区",
            "center": [
              118.7674,
              32.0415
            ]
          },
          {
            "code": "320100_4",
            "name": "鼓楼区",
            "center": [
              118.7674,
              32.0415
            ]
          },
          {
            "code": "320100_5",
            "name": "浦口区",
            "center": [
              118.7674,
              32.0415
            ]
          },
          {
            "code": "320100_6",
            "name": "栖霞区",
            "center": [
              118.7674,
              32.0415
            ]
          },
          {
            "code": "320100_7",
            "name": "雨花台区",
            "center": [
              118.7674,
              32.0415
            ]
          },
          {
            "code": "320100_8",
            "name": "江宁区",
            "center": [
              118.7674,
              32.0415
            ]
          },
          {
            "code": "320100_9",
            "name": "六合区",
            "center": [
              118.7674,
              32.0415
            ]
          },
          {
            "code": "320100_10",
            "name": "溧水区",
            "center": [
              118.7674,
              32.0415
            ]
          },
          {
            "code": "320100_11",
            "name": "高淳区",
            "center": [
              118.7674,
              32.0415
            ]
          }
        ]
      },
      {
        "code": "320200",
        "name": "无锡市",
        "center": [
          120.3017,
          31.5747
        ],
        "children": [
          {
            "code": "320200_ALL",
            "name": "全区全域",
            "center": [
              120.3017,
              31.5747
            ]
          },
          {
            "code": "320200_1",
            "name": "锡山区",
            "center": [
              120.3017,
              31.5747
            ]
          },
          {
            "code": "320200_2",
            "name": "惠山区",
            "center": [
              120.3017,
              31.5747
            ]
          },
          {
            "code": "320200_3",
            "name": "滨湖区",
            "center": [
              120.3017,
              31.5747
            ]
          },
          {
            "code": "320200_4",
            "name": "梁溪区",
            "center": [
              120.3017,
              31.5747
            ]
          },
          {
            "code": "320200_5",
            "name": "新吴区",
            "center": [
              120.3017,
              31.5747
            ]
          },
          {
            "code": "320200_6",
            "name": "江阴市",
            "center": [
              120.3017,
              31.5747
            ]
          },
          {
            "code": "320200_7",
            "name": "宜兴市",
            "center": [
              120.3017,
              31.5747
            ]
          }
        ]
      },
      {
        "code": "320300",
        "name": "徐州市",
        "center": [
          117.1848,
          34.2618
        ],
        "children": [
          {
            "code": "320300_ALL",
            "name": "全区全域",
            "center": [
              117.1848,
              34.2618
            ]
          },
          {
            "code": "320300_1",
            "name": "鼓楼区",
            "center": [
              117.1848,
              34.2618
            ]
          },
          {
            "code": "320300_2",
            "name": "云龙区",
            "center": [
              117.1848,
              34.2618
            ]
          },
          {
            "code": "320300_3",
            "name": "贾汪区",
            "center": [
              117.1848,
              34.2618
            ]
          },
          {
            "code": "320300_4",
            "name": "泉山区",
            "center": [
              117.1848,
              34.2618
            ]
          },
          {
            "code": "320300_5",
            "name": "铜山区",
            "center": [
              117.1848,
              34.2618
            ]
          },
          {
            "code": "320300_6",
            "name": "丰县",
            "center": [
              117.1848,
              34.2618
            ]
          },
          {
            "code": "320300_7",
            "name": "沛县",
            "center": [
              117.1848,
              34.2618
            ]
          },
          {
            "code": "320300_8",
            "name": "睢宁县",
            "center": [
              117.1848,
              34.2618
            ]
          },
          {
            "code": "320300_9",
            "name": "新沂市",
            "center": [
              117.1848,
              34.2618
            ]
          },
          {
            "code": "320300_10",
            "name": "邳州市",
            "center": [
              117.1848,
              34.2618
            ]
          }
        ]
      },
      {
        "code": "320400",
        "name": "常州市",
        "center": [
          119.9469,
          31.7727
        ],
        "children": [
          {
            "code": "320400_ALL",
            "name": "全区全域",
            "center": [
              119.9469,
              31.7727
            ]
          },
          {
            "code": "320400_1",
            "name": "天宁区",
            "center": [
              119.9469,
              31.7727
            ]
          },
          {
            "code": "320400_2",
            "name": "钟楼区",
            "center": [
              119.9469,
              31.7727
            ]
          },
          {
            "code": "320400_3",
            "name": "新北区",
            "center": [
              119.9469,
              31.7727
            ]
          },
          {
            "code": "320400_4",
            "name": "武进区",
            "center": [
              119.9469,
              31.7727
            ]
          },
          {
            "code": "320400_5",
            "name": "金坛区",
            "center": [
              119.9469,
              31.7727
            ]
          },
          {
            "code": "320400_6",
            "name": "溧阳市",
            "center": [
              119.9469,
              31.7727
            ]
          }
        ]
      },
      {
        "code": "320500",
        "name": "苏州市",
        "center": [
          120.6195,
          31.2994
        ],
        "children": [
          {
            "code": "320500_ALL",
            "name": "全区全域",
            "center": [
              120.6195,
              31.2994
            ]
          },
          {
            "code": "320500_1",
            "name": "姑苏区",
            "center": [
              120.6195,
              31.2994
            ]
          },
          {
            "code": "320500_2",
            "name": "虎丘区",
            "center": [
              120.6195,
              31.2994
            ]
          },
          {
            "code": "320500_3",
            "name": "吴中区",
            "center": [
              120.6195,
              31.2994
            ]
          },
          {
            "code": "320500_4",
            "name": "相城区",
            "center": [
              120.6195,
              31.2994
            ]
          },
          {
            "code": "320500_5",
            "name": "吴江区",
            "center": [
              120.6195,
              31.2994
            ]
          },
          {
            "code": "320500_6",
            "name": "常熟市",
            "center": [
              120.6195,
              31.2994
            ]
          },
          {
            "code": "320500_7",
            "name": "张家港市",
            "center": [
              120.6195,
              31.2994
            ]
          },
          {
            "code": "320500_8",
            "name": "昆山市",
            "center": [
              120.6195,
              31.2994
            ]
          },
          {
            "code": "320500_9",
            "name": "太仓市",
            "center": [
              120.6195,
              31.2994
            ]
          }
        ]
      },
      {
        "code": "320600",
        "name": "南通市",
        "center": [
          120.8646,
          32.0162
        ],
        "children": [
          {
            "code": "320600_ALL",
            "name": "全区全域",
            "center": [
              120.8646,
              32.0162
            ]
          },
          {
            "code": "320600_1",
            "name": "崇川区",
            "center": [
              120.8646,
              32.0162
            ]
          },
          {
            "code": "320600_2",
            "name": "通州区",
            "center": [
              120.8646,
              32.0162
            ]
          },
          {
            "code": "320600_3",
            "name": "海门区",
            "center": [
              120.8646,
              32.0162
            ]
          },
          {
            "code": "320600_4",
            "name": "如东县",
            "center": [
              120.8646,
              32.0162
            ]
          },
          {
            "code": "320600_5",
            "name": "启东市",
            "center": [
              120.8646,
              32.0162
            ]
          },
          {
            "code": "320600_6",
            "name": "如皋市",
            "center": [
              120.8646,
              32.0162
            ]
          },
          {
            "code": "320600_7",
            "name": "海安市",
            "center": [
              120.8646,
              32.0162
            ]
          }
        ]
      },
      {
        "code": "320700",
        "name": "连云港市",
        "center": [
          119.1788,
          34.6029
        ],
        "children": [
          {
            "code": "320700_ALL",
            "name": "全区全域",
            "center": [
              119.1788,
              34.6029
            ]
          },
          {
            "code": "320700_1",
            "name": "连云区",
            "center": [
              119.1788,
              34.6029
            ]
          },
          {
            "code": "320700_2",
            "name": "海州区",
            "center": [
              119.1788,
              34.6029
            ]
          },
          {
            "code": "320700_3",
            "name": "赣榆区",
            "center": [
              119.1788,
              34.6029
            ]
          },
          {
            "code": "320700_4",
            "name": "东海县",
            "center": [
              119.1788,
              34.6029
            ]
          },
          {
            "code": "320700_5",
            "name": "灌云县",
            "center": [
              119.1788,
              34.6029
            ]
          },
          {
            "code": "320700_6",
            "name": "灌南县",
            "center": [
              119.1788,
              34.6029
            ]
          }
        ]
      },
      {
        "code": "320800",
        "name": "淮安市",
        "center": [
          119.0213,
          33.5975
        ],
        "children": [
          {
            "code": "320800_ALL",
            "name": "全区全域",
            "center": [
              119.0213,
              33.5975
            ]
          },
          {
            "code": "320800_1",
            "name": "淮安区",
            "center": [
              119.0213,
              33.5975
            ]
          },
          {
            "code": "320800_2",
            "name": "淮阴区",
            "center": [
              119.0213,
              33.5975
            ]
          },
          {
            "code": "320800_3",
            "name": "清江浦区",
            "center": [
              119.0213,
              33.5975
            ]
          },
          {
            "code": "320800_4",
            "name": "洪泽区",
            "center": [
              119.0213,
              33.5975
            ]
          },
          {
            "code": "320800_5",
            "name": "涟水县",
            "center": [
              119.0213,
              33.5975
            ]
          },
          {
            "code": "320800_6",
            "name": "盱眙县",
            "center": [
              119.0213,
              33.5975
            ]
          },
          {
            "code": "320800_7",
            "name": "金湖县",
            "center": [
              119.0213,
              33.5975
            ]
          }
        ]
      },
      {
        "code": "320900",
        "name": "盐城市",
        "center": [
          120.1399,
          33.3776
        ],
        "children": [
          {
            "code": "320900_ALL",
            "name": "全区全域",
            "center": [
              120.1399,
              33.3776
            ]
          },
          {
            "code": "320900_1",
            "name": "亭湖区",
            "center": [
              120.1399,
              33.3776
            ]
          },
          {
            "code": "320900_2",
            "name": "盐都区",
            "center": [
              120.1399,
              33.3776
            ]
          },
          {
            "code": "320900_3",
            "name": "大丰区",
            "center": [
              120.1399,
              33.3776
            ]
          },
          {
            "code": "320900_4",
            "name": "响水县",
            "center": [
              120.1399,
              33.3776
            ]
          },
          {
            "code": "320900_5",
            "name": "滨海县",
            "center": [
              120.1399,
              33.3776
            ]
          },
          {
            "code": "320900_6",
            "name": "阜宁县",
            "center": [
              120.1399,
              33.3776
            ]
          },
          {
            "code": "320900_7",
            "name": "射阳县",
            "center": [
              120.1399,
              33.3776
            ]
          },
          {
            "code": "320900_8",
            "name": "建湖县",
            "center": [
              120.1399,
              33.3776
            ]
          },
          {
            "code": "320900_9",
            "name": "东台市",
            "center": [
              120.1399,
              33.3776
            ]
          }
        ]
      },
      {
        "code": "321000",
        "name": "扬州市",
        "center": [
          119.421,
          32.3932
        ],
        "children": [
          {
            "code": "321000_ALL",
            "name": "全区全域",
            "center": [
              119.421,
              32.3932
            ]
          },
          {
            "code": "321000_1",
            "name": "广陵区",
            "center": [
              119.421,
              32.3932
            ]
          },
          {
            "code": "321000_2",
            "name": "邗江区",
            "center": [
              119.421,
              32.3932
            ]
          },
          {
            "code": "321000_3",
            "name": "江都区",
            "center": [
              119.421,
              32.3932
            ]
          },
          {
            "code": "321000_4",
            "name": "宝应县",
            "center": [
              119.421,
              32.3932
            ]
          },
          {
            "code": "321000_5",
            "name": "仪征市",
            "center": [
              119.421,
              32.3932
            ]
          },
          {
            "code": "321000_6",
            "name": "高邮市",
            "center": [
              119.421,
              32.3932
            ]
          }
        ]
      },
      {
        "code": "321100",
        "name": "镇江市",
        "center": [
          119.4527,
          32.2044
        ],
        "children": [
          {
            "code": "321100_ALL",
            "name": "全区全域",
            "center": [
              119.4527,
              32.2044
            ]
          },
          {
            "code": "321100_1",
            "name": "京口区",
            "center": [
              119.4527,
              32.2044
            ]
          },
          {
            "code": "321100_2",
            "name": "润州区",
            "center": [
              119.4527,
              32.2044
            ]
          },
          {
            "code": "321100_3",
            "name": "丹徒区",
            "center": [
              119.4527,
              32.2044
            ]
          },
          {
            "code": "321100_4",
            "name": "丹阳市",
            "center": [
              119.4527,
              32.2044
            ]
          },
          {
            "code": "321100_5",
            "name": "扬中市",
            "center": [
              119.4527,
              32.2044
            ]
          },
          {
            "code": "321100_6",
            "name": "句容市",
            "center": [
              119.4527,
              32.2044
            ]
          }
        ]
      },
      {
        "code": "321200",
        "name": "泰州市",
        "center": [
          119.9152,
          32.4849
        ],
        "children": [
          {
            "code": "321200_ALL",
            "name": "全区全域",
            "center": [
              119.9152,
              32.4849
            ]
          },
          {
            "code": "321200_1",
            "name": "海陵区",
            "center": [
              119.9152,
              32.4849
            ]
          },
          {
            "code": "321200_2",
            "name": "高港区",
            "center": [
              119.9152,
              32.4849
            ]
          },
          {
            "code": "321200_3",
            "name": "姜堰区",
            "center": [
              119.9152,
              32.4849
            ]
          },
          {
            "code": "321200_4",
            "name": "兴化市",
            "center": [
              119.9152,
              32.4849
            ]
          },
          {
            "code": "321200_5",
            "name": "靖江市",
            "center": [
              119.9152,
              32.4849
            ]
          },
          {
            "code": "321200_6",
            "name": "泰兴市",
            "center": [
              119.9152,
              32.4849
            ]
          }
        ]
      },
      {
        "code": "321300",
        "name": "宿迁市",
        "center": [
          118.2752,
          33.963
        ],
        "children": [
          {
            "code": "321300_ALL",
            "name": "全区全域",
            "center": [
              118.2752,
              33.963
            ]
          },
          {
            "code": "321300_1",
            "name": "宿城区",
            "center": [
              118.2752,
              33.963
            ]
          },
          {
            "code": "321300_2",
            "name": "宿豫区",
            "center": [
              118.2752,
              33.963
            ]
          },
          {
            "code": "321300_3",
            "name": "沭阳县",
            "center": [
              118.2752,
              33.963
            ]
          },
          {
            "code": "321300_4",
            "name": "泗阳县",
            "center": [
              118.2752,
              33.963
            ]
          },
          {
            "code": "321300_5",
            "name": "泗洪县",
            "center": [
              118.2752,
              33.963
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "330000",
    "name": "浙江省",
    "center": [
      120.1536,
      30.2875
    ],
    "children": [
      {
        "code": "330000_ALL",
        "name": "全省范围",
        "center": [
          120.1536,
          30.2875
        ],
        "children": [
          {
            "code": "330000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              120.1536,
              30.2875
            ]
          }
        ]
      },
      {
        "code": "330100",
        "name": "杭州市",
        "center": [
          120.1536,
          30.2875
        ],
        "children": [
          {
            "code": "330100_ALL",
            "name": "全区全域",
            "center": [
              120.1536,
              30.2875
            ]
          },
          {
            "code": "330100_1",
            "name": "上城区",
            "center": [
              120.1536,
              30.2875
            ]
          },
          {
            "code": "330100_2",
            "name": "拱墅区",
            "center": [
              120.1536,
              30.2875
            ]
          },
          {
            "code": "330100_3",
            "name": "西湖区",
            "center": [
              120.1536,
              30.2875
            ]
          },
          {
            "code": "330100_4",
            "name": "滨江区",
            "center": [
              120.1536,
              30.2875
            ]
          },
          {
            "code": "330100_5",
            "name": "萧山区",
            "center": [
              120.1536,
              30.2875
            ]
          },
          {
            "code": "330100_6",
            "name": "余杭区",
            "center": [
              120.1536,
              30.2875
            ]
          },
          {
            "code": "330100_7",
            "name": "临平区",
            "center": [
              120.1536,
              30.2875
            ]
          },
          {
            "code": "330100_8",
            "name": "钱塘区",
            "center": [
              120.1536,
              30.2875
            ]
          },
          {
            "code": "330100_9",
            "name": "富阳区",
            "center": [
              120.1536,
              30.2875
            ]
          },
          {
            "code": "330100_10",
            "name": "临安区",
            "center": [
              120.1536,
              30.2875
            ]
          },
          {
            "code": "330100_11",
            "name": "桐庐县",
            "center": [
              120.1536,
              30.2875
            ]
          },
          {
            "code": "330100_12",
            "name": "淳安县",
            "center": [
              120.1536,
              30.2875
            ]
          },
          {
            "code": "330100_13",
            "name": "建德市",
            "center": [
              120.1536,
              30.2875
            ]
          }
        ]
      },
      {
        "code": "330200",
        "name": "宁波市",
        "center": [
          121.5497,
          29.8683
        ],
        "children": [
          {
            "code": "330200_ALL",
            "name": "全区全域",
            "center": [
              121.5497,
              29.8683
            ]
          },
          {
            "code": "330200_1",
            "name": "海曙区",
            "center": [
              121.5497,
              29.8683
            ]
          },
          {
            "code": "330200_2",
            "name": "江北区",
            "center": [
              121.5497,
              29.8683
            ]
          },
          {
            "code": "330200_3",
            "name": "北仑区",
            "center": [
              121.5497,
              29.8683
            ]
          },
          {
            "code": "330200_4",
            "name": "镇海区",
            "center": [
              121.5497,
              29.8683
            ]
          },
          {
            "code": "330200_5",
            "name": "鄞州区",
            "center": [
              121.5497,
              29.8683
            ]
          },
          {
            "code": "330200_6",
            "name": "奉化区",
            "center": [
              121.5497,
              29.8683
            ]
          },
          {
            "code": "330200_7",
            "name": "象山县",
            "center": [
              121.5497,
              29.8683
            ]
          },
          {
            "code": "330200_8",
            "name": "宁海县",
            "center": [
              121.5497,
              29.8683
            ]
          },
          {
            "code": "330200_9",
            "name": "余姚市",
            "center": [
              121.5497,
              29.8683
            ]
          },
          {
            "code": "330200_10",
            "name": "慈溪市",
            "center": [
              121.5497,
              29.8683
            ]
          }
        ]
      },
      {
        "code": "330300",
        "name": "温州市",
        "center": [
          120.6721,
          28.0005
        ],
        "children": [
          {
            "code": "330300_ALL",
            "name": "全区全域",
            "center": [
              120.6721,
              28.0005
            ]
          },
          {
            "code": "330300_1",
            "name": "鹿城区",
            "center": [
              120.6721,
              28.0005
            ]
          },
          {
            "code": "330300_2",
            "name": "龙湾区",
            "center": [
              120.6721,
              28.0005
            ]
          },
          {
            "code": "330300_3",
            "name": "瓯海区",
            "center": [
              120.6721,
              28.0005
            ]
          },
          {
            "code": "330300_4",
            "name": "洞头区",
            "center": [
              120.6721,
              28.0005
            ]
          },
          {
            "code": "330300_5",
            "name": "永嘉县",
            "center": [
              120.6721,
              28.0005
            ]
          },
          {
            "code": "330300_6",
            "name": "平阳县",
            "center": [
              120.6721,
              28.0005
            ]
          },
          {
            "code": "330300_7",
            "name": "苍南县",
            "center": [
              120.6721,
              28.0005
            ]
          },
          {
            "code": "330300_8",
            "name": "文成县",
            "center": [
              120.6721,
              28.0005
            ]
          },
          {
            "code": "330300_9",
            "name": "泰顺县",
            "center": [
              120.6721,
              28.0005
            ]
          },
          {
            "code": "330300_10",
            "name": "瑞安市",
            "center": [
              120.6721,
              28.0005
            ]
          },
          {
            "code": "330300_11",
            "name": "乐清市",
            "center": [
              120.6721,
              28.0005
            ]
          },
          {
            "code": "330300_12",
            "name": "龙港市",
            "center": [
              120.6721,
              28.0005
            ]
          }
        ]
      },
      {
        "code": "330400",
        "name": "嘉兴市",
        "center": [
          120.7508,
          30.7627
        ],
        "children": [
          {
            "code": "330400_ALL",
            "name": "全区全域",
            "center": [
              120.7508,
              30.7627
            ]
          },
          {
            "code": "330400_1",
            "name": "南湖区",
            "center": [
              120.7508,
              30.7627
            ]
          },
          {
            "code": "330400_2",
            "name": "秀洲区",
            "center": [
              120.7508,
              30.7627
            ]
          },
          {
            "code": "330400_3",
            "name": "嘉善县",
            "center": [
              120.7508,
              30.7627
            ]
          },
          {
            "code": "330400_4",
            "name": "海盐县",
            "center": [
              120.7508,
              30.7627
            ]
          },
          {
            "code": "330400_5",
            "name": "海宁市",
            "center": [
              120.7508,
              30.7627
            ]
          },
          {
            "code": "330400_6",
            "name": "平湖市",
            "center": [
              120.7508,
              30.7627
            ]
          },
          {
            "code": "330400_7",
            "name": "桐乡市",
            "center": [
              120.7508,
              30.7627
            ]
          }
        ]
      },
      {
        "code": "330500",
        "name": "湖州市",
        "center": [
          120.1024,
          30.8672
        ],
        "children": [
          {
            "code": "330500_ALL",
            "name": "全区全域",
            "center": [
              120.1024,
              30.8672
            ]
          },
          {
            "code": "330500_1",
            "name": "吴兴区",
            "center": [
              120.1024,
              30.8672
            ]
          },
          {
            "code": "330500_2",
            "name": "南浔区",
            "center": [
              120.1024,
              30.8672
            ]
          },
          {
            "code": "330500_3",
            "name": "德清县",
            "center": [
              120.1024,
              30.8672
            ]
          },
          {
            "code": "330500_4",
            "name": "长兴县",
            "center": [
              120.1024,
              30.8672
            ]
          },
          {
            "code": "330500_5",
            "name": "安吉县",
            "center": [
              120.1024,
              30.8672
            ]
          }
        ]
      },
      {
        "code": "330600",
        "name": "绍兴市",
        "center": [
          120.5821,
          29.9971
        ],
        "children": [
          {
            "code": "330600_ALL",
            "name": "全区全域",
            "center": [
              120.5821,
              29.9971
            ]
          },
          {
            "code": "330600_1",
            "name": "越城区",
            "center": [
              120.5821,
              29.9971
            ]
          },
          {
            "code": "330600_2",
            "name": "柯桥区",
            "center": [
              120.5821,
              29.9971
            ]
          },
          {
            "code": "330600_3",
            "name": "上虞区",
            "center": [
              120.5821,
              29.9971
            ]
          },
          {
            "code": "330600_4",
            "name": "新昌县",
            "center": [
              120.5821,
              29.9971
            ]
          },
          {
            "code": "330600_5",
            "name": "诸暨市",
            "center": [
              120.5821,
              29.9971
            ]
          },
          {
            "code": "330600_6",
            "name": "嵊州市",
            "center": [
              120.5821,
              29.9971
            ]
          }
        ]
      },
      {
        "code": "330700",
        "name": "金华市",
        "center": [
          119.6495,
          29.0895
        ],
        "children": [
          {
            "code": "330700_ALL",
            "name": "全区全域",
            "center": [
              119.6495,
              29.0895
            ]
          },
          {
            "code": "330700_1",
            "name": "婺城区",
            "center": [
              119.6495,
              29.0895
            ]
          },
          {
            "code": "330700_2",
            "name": "金东区",
            "center": [
              119.6495,
              29.0895
            ]
          },
          {
            "code": "330700_3",
            "name": "武义县",
            "center": [
              119.6495,
              29.0895
            ]
          },
          {
            "code": "330700_4",
            "name": "浦江县",
            "center": [
              119.6495,
              29.0895
            ]
          },
          {
            "code": "330700_5",
            "name": "磐安县",
            "center": [
              119.6495,
              29.0895
            ]
          },
          {
            "code": "330700_6",
            "name": "兰溪市",
            "center": [
              119.6495,
              29.0895
            ]
          },
          {
            "code": "330700_7",
            "name": "义乌市",
            "center": [
              119.6495,
              29.0895
            ]
          },
          {
            "code": "330700_8",
            "name": "东阳市",
            "center": [
              119.6495,
              29.0895
            ]
          },
          {
            "code": "330700_9",
            "name": "永康市",
            "center": [
              119.6495,
              29.0895
            ]
          }
        ]
      },
      {
        "code": "330800",
        "name": "衢州市",
        "center": [
          118.8726,
          28.9417
        ],
        "children": [
          {
            "code": "330800_ALL",
            "name": "全区全域",
            "center": [
              118.8726,
              28.9417
            ]
          },
          {
            "code": "330800_1",
            "name": "柯城区",
            "center": [
              118.8726,
              28.9417
            ]
          },
          {
            "code": "330800_2",
            "name": "衢江区",
            "center": [
              118.8726,
              28.9417
            ]
          },
          {
            "code": "330800_3",
            "name": "常山县",
            "center": [
              118.8726,
              28.9417
            ]
          },
          {
            "code": "330800_4",
            "name": "开化县",
            "center": [
              118.8726,
              28.9417
            ]
          },
          {
            "code": "330800_5",
            "name": "龙游县",
            "center": [
              118.8726,
              28.9417
            ]
          },
          {
            "code": "330800_6",
            "name": "江山市",
            "center": [
              118.8726,
              28.9417
            ]
          }
        ]
      },
      {
        "code": "330900",
        "name": "舟山市",
        "center": [
          122.2072,
          29.9853
        ],
        "children": [
          {
            "code": "330900_ALL",
            "name": "全区全域",
            "center": [
              122.2072,
              29.9853
            ]
          },
          {
            "code": "330900_1",
            "name": "定海区",
            "center": [
              122.2072,
              29.9853
            ]
          },
          {
            "code": "330900_2",
            "name": "普陀区",
            "center": [
              122.2072,
              29.9853
            ]
          },
          {
            "code": "330900_3",
            "name": "岱山县",
            "center": [
              122.2072,
              29.9853
            ]
          },
          {
            "code": "330900_4",
            "name": "嵊泗县",
            "center": [
              122.2072,
              29.9853
            ]
          }
        ]
      },
      {
        "code": "331000",
        "name": "台州市",
        "center": [
          121.4286,
          28.6614
        ],
        "children": [
          {
            "code": "331000_ALL",
            "name": "全区全域",
            "center": [
              121.4286,
              28.6614
            ]
          },
          {
            "code": "331000_1",
            "name": "椒江区",
            "center": [
              121.4286,
              28.6614
            ]
          },
          {
            "code": "331000_2",
            "name": "黄岩区",
            "center": [
              121.4286,
              28.6614
            ]
          },
          {
            "code": "331000_3",
            "name": "路桥区",
            "center": [
              121.4286,
              28.6614
            ]
          },
          {
            "code": "331000_4",
            "name": "三门县",
            "center": [
              121.4286,
              28.6614
            ]
          },
          {
            "code": "331000_5",
            "name": "天台县",
            "center": [
              121.4286,
              28.6614
            ]
          },
          {
            "code": "331000_6",
            "name": "仙居县",
            "center": [
              121.4286,
              28.6614
            ]
          },
          {
            "code": "331000_7",
            "name": "温岭市",
            "center": [
              121.4286,
              28.6614
            ]
          },
          {
            "code": "331000_8",
            "name": "临海市",
            "center": [
              121.4286,
              28.6614
            ]
          },
          {
            "code": "331000_9",
            "name": "玉环市",
            "center": [
              121.4286,
              28.6614
            ]
          }
        ]
      },
      {
        "code": "331100",
        "name": "丽水市",
        "center": [
          119.9218,
          28.4519
        ],
        "children": [
          {
            "code": "331100_ALL",
            "name": "全区全域",
            "center": [
              119.9218,
              28.4519
            ]
          },
          {
            "code": "331100_1",
            "name": "莲都区",
            "center": [
              119.9218,
              28.4519
            ]
          },
          {
            "code": "331100_2",
            "name": "青田县",
            "center": [
              119.9218,
              28.4519
            ]
          },
          {
            "code": "331100_3",
            "name": "缙云县",
            "center": [
              119.9218,
              28.4519
            ]
          },
          {
            "code": "331100_4",
            "name": "遂昌县",
            "center": [
              119.9218,
              28.4519
            ]
          },
          {
            "code": "331100_5",
            "name": "松阳县",
            "center": [
              119.9218,
              28.4519
            ]
          },
          {
            "code": "331100_6",
            "name": "云和县",
            "center": [
              119.9218,
              28.4519
            ]
          },
          {
            "code": "331100_7",
            "name": "庆元县",
            "center": [
              119.9218,
              28.4519
            ]
          },
          {
            "code": "331100_8",
            "name": "景宁畲族自治县",
            "center": [
              119.9218,
              28.4519
            ]
          },
          {
            "code": "331100_9",
            "name": "龙泉市",
            "center": [
              119.9218,
              28.4519
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "370000",
    "name": "山东省",
    "center": [
      117.0009,
      36.6758
    ],
    "children": [
      {
        "code": "370000_ALL",
        "name": "全省范围",
        "center": [
          117.0009,
          36.6758
        ],
        "children": [
          {
            "code": "370000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              117.0009,
              36.6758
            ]
          }
        ]
      },
      {
        "code": "370100",
        "name": "济南市",
        "center": [
          117.0009,
          36.6758
        ],
        "children": [
          {
            "code": "370100_ALL",
            "name": "全区全域",
            "center": [
              117.0009,
              36.6758
            ]
          },
          {
            "code": "370100_1",
            "name": "历下区",
            "center": [
              117.0009,
              36.6758
            ]
          },
          {
            "code": "370100_2",
            "name": "市中区",
            "center": [
              117.0009,
              36.6758
            ]
          },
          {
            "code": "370100_3",
            "name": "槐荫区",
            "center": [
              117.0009,
              36.6758
            ]
          },
          {
            "code": "370100_4",
            "name": "天桥区",
            "center": [
              117.0009,
              36.6758
            ]
          },
          {
            "code": "370100_5",
            "name": "历城区",
            "center": [
              117.0009,
              36.6758
            ]
          },
          {
            "code": "370100_6",
            "name": "长清区",
            "center": [
              117.0009,
              36.6758
            ]
          },
          {
            "code": "370100_7",
            "name": "章丘区",
            "center": [
              117.0009,
              36.6758
            ]
          },
          {
            "code": "370100_8",
            "name": "济阳区",
            "center": [
              117.0009,
              36.6758
            ]
          },
          {
            "code": "370100_9",
            "name": "莱芜区",
            "center": [
              117.0009,
              36.6758
            ]
          },
          {
            "code": "370100_10",
            "name": "钢城区",
            "center": [
              117.0009,
              36.6758
            ]
          },
          {
            "code": "370100_11",
            "name": "平阴县",
            "center": [
              117.0009,
              36.6758
            ]
          },
          {
            "code": "370100_12",
            "name": "商河县",
            "center": [
              117.0009,
              36.6758
            ]
          }
        ]
      },
      {
        "code": "370200",
        "name": "青岛市",
        "center": [
          120.3826,
          36.0671
        ],
        "children": [
          {
            "code": "370200_ALL",
            "name": "全区全域",
            "center": [
              120.3826,
              36.0671
            ]
          },
          {
            "code": "370200_1",
            "name": "市南区",
            "center": [
              120.3826,
              36.0671
            ]
          },
          {
            "code": "370200_2",
            "name": "市北区",
            "center": [
              120.3826,
              36.0671
            ]
          },
          {
            "code": "370200_3",
            "name": "黄岛区",
            "center": [
              120.3826,
              36.0671
            ]
          },
          {
            "code": "370200_4",
            "name": "崂山区",
            "center": [
              120.3826,
              36.0671
            ]
          },
          {
            "code": "370200_5",
            "name": "李沧区",
            "center": [
              120.3826,
              36.0671
            ]
          },
          {
            "code": "370200_6",
            "name": "城阳区",
            "center": [
              120.3826,
              36.0671
            ]
          },
          {
            "code": "370200_7",
            "name": "即墨区",
            "center": [
              120.3826,
              36.0671
            ]
          },
          {
            "code": "370200_8",
            "name": "胶州市",
            "center": [
              120.3826,
              36.0671
            ]
          },
          {
            "code": "370200_9",
            "name": "平度市",
            "center": [
              120.3826,
              36.0671
            ]
          },
          {
            "code": "370200_10",
            "name": "莱西市",
            "center": [
              120.3826,
              36.0671
            ]
          }
        ]
      },
      {
        "code": "370300",
        "name": "淄博市",
        "center": [
          118.0371,
          36.8149
        ],
        "children": [
          {
            "code": "370300_ALL",
            "name": "全区全域",
            "center": [
              118.0371,
              36.8149
            ]
          },
          {
            "code": "370300_1",
            "name": "淄川区",
            "center": [
              118.0371,
              36.8149
            ]
          },
          {
            "code": "370300_2",
            "name": "张店区",
            "center": [
              118.0371,
              36.8149
            ]
          },
          {
            "code": "370300_3",
            "name": "博山区",
            "center": [
              118.0371,
              36.8149
            ]
          },
          {
            "code": "370300_4",
            "name": "临淄区",
            "center": [
              118.0371,
              36.8149
            ]
          },
          {
            "code": "370300_5",
            "name": "周村区",
            "center": [
              118.0371,
              36.8149
            ]
          },
          {
            "code": "370300_6",
            "name": "桓台县",
            "center": [
              118.0371,
              36.8149
            ]
          },
          {
            "code": "370300_7",
            "name": "高青县",
            "center": [
              118.0371,
              36.8149
            ]
          },
          {
            "code": "370300_8",
            "name": "沂源县",
            "center": [
              118.0371,
              36.8149
            ]
          }
        ]
      },
      {
        "code": "370400",
        "name": "枣庄市",
        "center": [
          117.5577,
          34.8565
        ],
        "children": [
          {
            "code": "370400_ALL",
            "name": "全区全域",
            "center": [
              117.5577,
              34.8565
            ]
          },
          {
            "code": "370400_1",
            "name": "市中区",
            "center": [
              117.5577,
              34.8565
            ]
          },
          {
            "code": "370400_2",
            "name": "薛城区",
            "center": [
              117.5577,
              34.8565
            ]
          },
          {
            "code": "370400_3",
            "name": "峄城区",
            "center": [
              117.5577,
              34.8565
            ]
          },
          {
            "code": "370400_4",
            "name": "台儿庄区",
            "center": [
              117.5577,
              34.8565
            ]
          },
          {
            "code": "370400_5",
            "name": "山亭区",
            "center": [
              117.5577,
              34.8565
            ]
          },
          {
            "code": "370400_6",
            "name": "滕州市",
            "center": [
              117.5577,
              34.8565
            ]
          }
        ]
      },
      {
        "code": "370500",
        "name": "东营市",
        "center": [
          118.6647,
          37.4346
        ],
        "children": [
          {
            "code": "370500_ALL",
            "name": "全区全域",
            "center": [
              118.6647,
              37.4346
            ]
          },
          {
            "code": "370500_1",
            "name": "东营区",
            "center": [
              118.6647,
              37.4346
            ]
          },
          {
            "code": "370500_2",
            "name": "河口区",
            "center": [
              118.6647,
              37.4346
            ]
          },
          {
            "code": "370500_3",
            "name": "垦利区",
            "center": [
              118.6647,
              37.4346
            ]
          },
          {
            "code": "370500_4",
            "name": "利津县",
            "center": [
              118.6647,
              37.4346
            ]
          },
          {
            "code": "370500_5",
            "name": "广饶县",
            "center": [
              118.6647,
              37.4346
            ]
          }
        ]
      },
      {
        "code": "370600",
        "name": "烟台市",
        "center": [
          121.3914,
          37.5393
        ],
        "children": [
          {
            "code": "370600_ALL",
            "name": "全区全域",
            "center": [
              121.3914,
              37.5393
            ]
          },
          {
            "code": "370600_1",
            "name": "芝罘区",
            "center": [
              121.3914,
              37.5393
            ]
          },
          {
            "code": "370600_2",
            "name": "福山区",
            "center": [
              121.3914,
              37.5393
            ]
          },
          {
            "code": "370600_3",
            "name": "牟平区",
            "center": [
              121.3914,
              37.5393
            ]
          },
          {
            "code": "370600_4",
            "name": "莱山区",
            "center": [
              121.3914,
              37.5393
            ]
          },
          {
            "code": "370600_5",
            "name": "蓬莱区",
            "center": [
              121.3914,
              37.5393
            ]
          },
          {
            "code": "370600_6",
            "name": "龙口市",
            "center": [
              121.3914,
              37.5393
            ]
          },
          {
            "code": "370600_7",
            "name": "莱阳市",
            "center": [
              121.3914,
              37.5393
            ]
          },
          {
            "code": "370600_8",
            "name": "莱州市",
            "center": [
              121.3914,
              37.5393
            ]
          },
          {
            "code": "370600_9",
            "name": "招远市",
            "center": [
              121.3914,
              37.5393
            ]
          },
          {
            "code": "370600_10",
            "name": "栖霞市",
            "center": [
              121.3914,
              37.5393
            ]
          },
          {
            "code": "370600_11",
            "name": "海阳市",
            "center": [
              121.3914,
              37.5393
            ]
          }
        ]
      },
      {
        "code": "370700",
        "name": "潍坊市",
        "center": [
          119.1071,
          36.7093
        ],
        "children": [
          {
            "code": "370700_ALL",
            "name": "全区全域",
            "center": [
              119.1071,
              36.7093
            ]
          },
          {
            "code": "370700_1",
            "name": "潍城区",
            "center": [
              119.1071,
              36.7093
            ]
          },
          {
            "code": "370700_2",
            "name": "寒亭区",
            "center": [
              119.1071,
              36.7093
            ]
          },
          {
            "code": "370700_3",
            "name": "坊子区",
            "center": [
              119.1071,
              36.7093
            ]
          },
          {
            "code": "370700_4",
            "name": "奎文区",
            "center": [
              119.1071,
              36.7093
            ]
          },
          {
            "code": "370700_5",
            "name": "临朐县",
            "center": [
              119.1071,
              36.7093
            ]
          },
          {
            "code": "370700_6",
            "name": "昌乐县",
            "center": [
              119.1071,
              36.7093
            ]
          },
          {
            "code": "370700_7",
            "name": "青州市",
            "center": [
              119.1071,
              36.7093
            ]
          },
          {
            "code": "370700_8",
            "name": "诸城市",
            "center": [
              119.1071,
              36.7093
            ]
          },
          {
            "code": "370700_9",
            "name": "寿光市",
            "center": [
              119.1071,
              36.7093
            ]
          },
          {
            "code": "370700_10",
            "name": "安丘市",
            "center": [
              119.1071,
              36.7093
            ]
          },
          {
            "code": "370700_11",
            "name": "高密市",
            "center": [
              119.1071,
              36.7093
            ]
          },
          {
            "code": "370700_12",
            "name": "昌邑市",
            "center": [
              119.1071,
              36.7093
            ]
          }
        ]
      },
      {
        "code": "370800",
        "name": "济宁市",
        "center": [
          116.5872,
          35.4154
        ],
        "children": [
          {
            "code": "370800_ALL",
            "name": "全区全域",
            "center": [
              116.5872,
              35.4154
            ]
          },
          {
            "code": "370800_1",
            "name": "任城区",
            "center": [
              116.5872,
              35.4154
            ]
          },
          {
            "code": "370800_2",
            "name": "兖州区",
            "center": [
              116.5872,
              35.4154
            ]
          },
          {
            "code": "370800_3",
            "name": "微山县",
            "center": [
              116.5872,
              35.4154
            ]
          },
          {
            "code": "370800_4",
            "name": "鱼台县",
            "center": [
              116.5872,
              35.4154
            ]
          },
          {
            "code": "370800_5",
            "name": "金乡县",
            "center": [
              116.5872,
              35.4154
            ]
          },
          {
            "code": "370800_6",
            "name": "嘉祥县",
            "center": [
              116.5872,
              35.4154
            ]
          },
          {
            "code": "370800_7",
            "name": "汶上县",
            "center": [
              116.5872,
              35.4154
            ]
          },
          {
            "code": "370800_8",
            "name": "泗水县",
            "center": [
              116.5872,
              35.4154
            ]
          },
          {
            "code": "370800_9",
            "name": "梁山县",
            "center": [
              116.5872,
              35.4154
            ]
          },
          {
            "code": "370800_10",
            "name": "曲阜市",
            "center": [
              116.5872,
              35.4154
            ]
          },
          {
            "code": "370800_11",
            "name": "邹城市",
            "center": [
              116.5872,
              35.4154
            ]
          }
        ]
      },
      {
        "code": "370900",
        "name": "泰安市",
        "center": [
          117.129,
          36.1949
        ],
        "children": [
          {
            "code": "370900_ALL",
            "name": "全区全域",
            "center": [
              117.129,
              36.1949
            ]
          },
          {
            "code": "370900_1",
            "name": "泰山区",
            "center": [
              117.129,
              36.1949
            ]
          },
          {
            "code": "370900_2",
            "name": "岱岳区",
            "center": [
              117.129,
              36.1949
            ]
          },
          {
            "code": "370900_3",
            "name": "宁阳县",
            "center": [
              117.129,
              36.1949
            ]
          },
          {
            "code": "370900_4",
            "name": "东平县",
            "center": [
              117.129,
              36.1949
            ]
          },
          {
            "code": "370900_5",
            "name": "新泰市",
            "center": [
              117.129,
              36.1949
            ]
          },
          {
            "code": "370900_6",
            "name": "肥城市",
            "center": [
              117.129,
              36.1949
            ]
          }
        ]
      },
      {
        "code": "371000",
        "name": "威海市",
        "center": [
          122.1163,
          37.5097
        ],
        "children": [
          {
            "code": "371000_ALL",
            "name": "全区全域",
            "center": [
              122.1163,
              37.5097
            ]
          },
          {
            "code": "371000_1",
            "name": "环翠区",
            "center": [
              122.1163,
              37.5097
            ]
          },
          {
            "code": "371000_2",
            "name": "文登区",
            "center": [
              122.1163,
              37.5097
            ]
          },
          {
            "code": "371000_3",
            "name": "荣成市",
            "center": [
              122.1163,
              37.5097
            ]
          },
          {
            "code": "371000_4",
            "name": "乳山市",
            "center": [
              122.1163,
              37.5097
            ]
          }
        ]
      },
      {
        "code": "371100",
        "name": "日照市",
        "center": [
          119.4612,
          35.4285
        ],
        "children": [
          {
            "code": "371100_ALL",
            "name": "全区全域",
            "center": [
              119.4612,
              35.4285
            ]
          },
          {
            "code": "371100_1",
            "name": "东港区",
            "center": [
              119.4612,
              35.4285
            ]
          },
          {
            "code": "371100_2",
            "name": "岚山区",
            "center": [
              119.4612,
              35.4285
            ]
          },
          {
            "code": "371100_3",
            "name": "五莲县",
            "center": [
              119.4612,
              35.4285
            ]
          },
          {
            "code": "371100_4",
            "name": "莒县",
            "center": [
              119.4612,
              35.4285
            ]
          }
        ]
      },
      {
        "code": "371200",
        "name": "临沂市",
        "center": [
          118.3264,
          35.0653
        ],
        "children": [
          {
            "code": "371200_ALL",
            "name": "全区全域",
            "center": [
              118.3264,
              35.0653
            ]
          },
          {
            "code": "371200_1",
            "name": "兰山区",
            "center": [
              118.3264,
              35.0653
            ]
          },
          {
            "code": "371200_2",
            "name": "罗庄区",
            "center": [
              118.3264,
              35.0653
            ]
          },
          {
            "code": "371200_3",
            "name": "河东区",
            "center": [
              118.3264,
              35.0653
            ]
          },
          {
            "code": "371200_4",
            "name": "沂南县",
            "center": [
              118.3264,
              35.0653
            ]
          },
          {
            "code": "371200_5",
            "name": "郯城县",
            "center": [
              118.3264,
              35.0653
            ]
          },
          {
            "code": "371200_6",
            "name": "沂水县",
            "center": [
              118.3264,
              35.0653
            ]
          },
          {
            "code": "371200_7",
            "name": "兰陵县",
            "center": [
              118.3264,
              35.0653
            ]
          },
          {
            "code": "371200_8",
            "name": "费县",
            "center": [
              118.3264,
              35.0653
            ]
          },
          {
            "code": "371200_9",
            "name": "平邑县",
            "center": [
              118.3264,
              35.0653
            ]
          },
          {
            "code": "371200_10",
            "name": "莒南县",
            "center": [
              118.3264,
              35.0653
            ]
          },
          {
            "code": "371200_11",
            "name": "蒙阴县",
            "center": [
              118.3264,
              35.0653
            ]
          },
          {
            "code": "371200_12",
            "name": "临沭县",
            "center": [
              118.3264,
              35.0653
            ]
          }
        ]
      },
      {
        "code": "371300",
        "name": "德州市",
        "center": [
          116.3074,
          37.4539
        ],
        "children": [
          {
            "code": "371300_ALL",
            "name": "全区全域",
            "center": [
              116.3074,
              37.4539
            ]
          },
          {
            "code": "371300_1",
            "name": "德城区",
            "center": [
              116.3074,
              37.4539
            ]
          },
          {
            "code": "371300_2",
            "name": "陵城区",
            "center": [
              116.3074,
              37.4539
            ]
          },
          {
            "code": "371300_3",
            "name": "宁津县",
            "center": [
              116.3074,
              37.4539
            ]
          },
          {
            "code": "371300_4",
            "name": "庆云县",
            "center": [
              116.3074,
              37.4539
            ]
          },
          {
            "code": "371300_5",
            "name": "临邑县",
            "center": [
              116.3074,
              37.4539
            ]
          },
          {
            "code": "371300_6",
            "name": "齐河县",
            "center": [
              116.3074,
              37.4539
            ]
          },
          {
            "code": "371300_7",
            "name": "平原县",
            "center": [
              116.3074,
              37.4539
            ]
          },
          {
            "code": "371300_8",
            "name": "夏津县",
            "center": [
              116.3074,
              37.4539
            ]
          },
          {
            "code": "371300_9",
            "name": "武城县",
            "center": [
              116.3074,
              37.4539
            ]
          },
          {
            "code": "371300_10",
            "name": "乐陵市",
            "center": [
              116.3074,
              37.4539
            ]
          },
          {
            "code": "371300_11",
            "name": "禹城市",
            "center": [
              116.3074,
              37.4539
            ]
          }
        ]
      },
      {
        "code": "371400",
        "name": "聊城市",
        "center": [
          115.9804,
          36.456
        ],
        "children": [
          {
            "code": "371400_ALL",
            "name": "全区全域",
            "center": [
              115.9804,
              36.456
            ]
          },
          {
            "code": "371400_1",
            "name": "东昌府区",
            "center": [
              115.9804,
              36.456
            ]
          },
          {
            "code": "371400_2",
            "name": "茌平区",
            "center": [
              115.9804,
              36.456
            ]
          },
          {
            "code": "371400_3",
            "name": "阳谷县",
            "center": [
              115.9804,
              36.456
            ]
          },
          {
            "code": "371400_4",
            "name": "莘县",
            "center": [
              115.9804,
              36.456
            ]
          },
          {
            "code": "371400_5",
            "name": "东阿县",
            "center": [
              115.9804,
              36.456
            ]
          },
          {
            "code": "371400_6",
            "name": "冠县",
            "center": [
              115.9804,
              36.456
            ]
          },
          {
            "code": "371400_7",
            "name": "高唐县",
            "center": [
              115.9804,
              36.456
            ]
          },
          {
            "code": "371400_8",
            "name": "临清市",
            "center": [
              115.9804,
              36.456
            ]
          }
        ]
      },
      {
        "code": "371500",
        "name": "滨州市",
        "center": [
          118.0169,
          37.3835
        ],
        "children": [
          {
            "code": "371500_ALL",
            "name": "全区全域",
            "center": [
              118.0169,
              37.3835
            ]
          },
          {
            "code": "371500_1",
            "name": "滨城区",
            "center": [
              118.0169,
              37.3835
            ]
          },
          {
            "code": "371500_2",
            "name": "沾化区",
            "center": [
              118.0169,
              37.3835
            ]
          },
          {
            "code": "371500_3",
            "name": "惠民县",
            "center": [
              118.0169,
              37.3835
            ]
          },
          {
            "code": "371500_4",
            "name": "阳信县",
            "center": [
              118.0169,
              37.3835
            ]
          },
          {
            "code": "371500_5",
            "name": "无棣县",
            "center": [
              118.0169,
              37.3835
            ]
          },
          {
            "code": "371500_6",
            "name": "博兴县",
            "center": [
              118.0169,
              37.3835
            ]
          },
          {
            "code": "371500_7",
            "name": "邹平市",
            "center": [
              118.0169,
              37.3835
            ]
          }
        ]
      },
      {
        "code": "371600",
        "name": "菏泽市",
        "center": [
          115.4694,
          35.2465
        ],
        "children": [
          {
            "code": "371600_ALL",
            "name": "全区全域",
            "center": [
              115.4694,
              35.2465
            ]
          },
          {
            "code": "371600_1",
            "name": "牡丹区",
            "center": [
              115.4694,
              35.2465
            ]
          },
          {
            "code": "371600_2",
            "name": "定陶区",
            "center": [
              115.4694,
              35.2465
            ]
          },
          {
            "code": "371600_3",
            "name": "曹县",
            "center": [
              115.4694,
              35.2465
            ]
          },
          {
            "code": "371600_4",
            "name": "单县",
            "center": [
              115.4694,
              35.2465
            ]
          },
          {
            "code": "371600_5",
            "name": "成武县",
            "center": [
              115.4694,
              35.2465
            ]
          },
          {
            "code": "371600_6",
            "name": "巨野县",
            "center": [
              115.4694,
              35.2465
            ]
          },
          {
            "code": "371600_7",
            "name": "郓城县",
            "center": [
              115.4694,
              35.2465
            ]
          },
          {
            "code": "371600_8",
            "name": "鄄城县",
            "center": [
              115.4694,
              35.2465
            ]
          },
          {
            "code": "371600_9",
            "name": "东明县",
            "center": [
              115.4694,
              35.2465
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "410000",
    "name": "河南省",
    "center": [
      113.6654,
      34.758
    ],
    "children": [
      {
        "code": "410000_ALL",
        "name": "全省范围",
        "center": [
          113.6654,
          34.758
        ],
        "children": [
          {
            "code": "410000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              113.6654,
              34.758
            ]
          }
        ]
      },
      {
        "code": "410100",
        "name": "郑州市",
        "center": [
          113.6654,
          34.758
        ],
        "children": [
          {
            "code": "410100_ALL",
            "name": "全区全域",
            "center": [
              113.6654,
              34.758
            ]
          },
          {
            "code": "410100_1",
            "name": "中原区",
            "center": [
              113.6654,
              34.758
            ]
          },
          {
            "code": "410100_2",
            "name": "二七区",
            "center": [
              113.6654,
              34.758
            ]
          },
          {
            "code": "410100_3",
            "name": "管城回族区",
            "center": [
              113.6654,
              34.758
            ]
          },
          {
            "code": "410100_4",
            "name": "金水区",
            "center": [
              113.6654,
              34.758
            ]
          },
          {
            "code": "410100_5",
            "name": "上街区",
            "center": [
              113.6654,
              34.758
            ]
          },
          {
            "code": "410100_6",
            "name": "惠济区",
            "center": [
              113.6654,
              34.758
            ]
          },
          {
            "code": "410100_7",
            "name": "中牟县",
            "center": [
              113.6654,
              34.758
            ]
          },
          {
            "code": "410100_8",
            "name": "巩义市",
            "center": [
              113.6654,
              34.758
            ]
          },
          {
            "code": "410100_9",
            "name": "荥阳市",
            "center": [
              113.6654,
              34.758
            ]
          },
          {
            "code": "410100_10",
            "name": "新密市",
            "center": [
              113.6654,
              34.758
            ]
          },
          {
            "code": "410100_11",
            "name": "新郑市",
            "center": [
              113.6654,
              34.758
            ]
          },
          {
            "code": "410100_12",
            "name": "登封市",
            "center": [
              113.6654,
              34.758
            ]
          }
        ]
      },
      {
        "code": "410200",
        "name": "开封市",
        "center": [
          114.3414,
          34.7973
        ],
        "children": [
          {
            "code": "410200_ALL",
            "name": "全区全域",
            "center": [
              114.3414,
              34.7973
            ]
          },
          {
            "code": "410200_1",
            "name": "龙亭区",
            "center": [
              114.3414,
              34.7973
            ]
          },
          {
            "code": "410200_2",
            "name": "顺河回族区",
            "center": [
              114.3414,
              34.7973
            ]
          },
          {
            "code": "410200_3",
            "name": "鼓楼区",
            "center": [
              114.3414,
              34.7973
            ]
          },
          {
            "code": "410200_4",
            "name": "禹王台区",
            "center": [
              114.3414,
              34.7973
            ]
          },
          {
            "code": "410200_5",
            "name": "祥符区",
            "center": [
              114.3414,
              34.7973
            ]
          },
          {
            "code": "410200_6",
            "name": "杞县",
            "center": [
              114.3414,
              34.7973
            ]
          },
          {
            "code": "410200_7",
            "name": "通许县",
            "center": [
              114.3414,
              34.7973
            ]
          },
          {
            "code": "410200_8",
            "name": "尉氏县",
            "center": [
              114.3414,
              34.7973
            ]
          },
          {
            "code": "410200_9",
            "name": "兰考县",
            "center": [
              114.3414,
              34.7973
            ]
          }
        ]
      },
      {
        "code": "410300",
        "name": "洛阳市",
        "center": [
          112.4345,
          34.663
        ],
        "children": [
          {
            "code": "410300_ALL",
            "name": "全区全域",
            "center": [
              112.4345,
              34.663
            ]
          },
          {
            "code": "410300_1",
            "name": "老城区",
            "center": [
              112.4345,
              34.663
            ]
          },
          {
            "code": "410300_2",
            "name": "西工区",
            "center": [
              112.4345,
              34.663
            ]
          },
          {
            "code": "410300_3",
            "name": "瀍河回族区",
            "center": [
              112.4345,
              34.663
            ]
          },
          {
            "code": "410300_4",
            "name": "涧西区",
            "center": [
              112.4345,
              34.663
            ]
          },
          {
            "code": "410300_5",
            "name": "洛龙区",
            "center": [
              112.4345,
              34.663
            ]
          },
          {
            "code": "410300_6",
            "name": "孟津区",
            "center": [
              112.4345,
              34.663
            ]
          },
          {
            "code": "410300_7",
            "name": "偃师区",
            "center": [
              112.4345,
              34.663
            ]
          },
          {
            "code": "410300_8",
            "name": "新安县",
            "center": [
              112.4345,
              34.663
            ]
          },
          {
            "code": "410300_9",
            "name": "栾川县",
            "center": [
              112.4345,
              34.663
            ]
          },
          {
            "code": "410300_10",
            "name": "嵩县",
            "center": [
              112.4345,
              34.663
            ]
          },
          {
            "code": "410300_11",
            "name": "汝阳县",
            "center": [
              112.4345,
              34.663
            ]
          },
          {
            "code": "410300_12",
            "name": "宜阳县",
            "center": [
              112.4345,
              34.663
            ]
          },
          {
            "code": "410300_13",
            "name": "洛宁县",
            "center": [
              112.4345,
              34.663
            ]
          },
          {
            "code": "410300_14",
            "name": "伊川县",
            "center": [
              112.4345,
              34.663
            ]
          }
        ]
      },
      {
        "code": "410400",
        "name": "平顶山市",
        "center": [
          113.3077,
          33.7352
        ],
        "children": [
          {
            "code": "410400_ALL",
            "name": "全区全域",
            "center": [
              113.3077,
              33.7352
            ]
          },
          {
            "code": "410400_1",
            "name": "新华区",
            "center": [
              113.3077,
              33.7352
            ]
          },
          {
            "code": "410400_2",
            "name": "卫东区",
            "center": [
              113.3077,
              33.7352
            ]
          },
          {
            "code": "410400_3",
            "name": "石龙区",
            "center": [
              113.3077,
              33.7352
            ]
          },
          {
            "code": "410400_4",
            "name": "湛河区",
            "center": [
              113.3077,
              33.7352
            ]
          },
          {
            "code": "410400_5",
            "name": "宝丰县",
            "center": [
              113.3077,
              33.7352
            ]
          },
          {
            "code": "410400_6",
            "name": "叶县",
            "center": [
              113.3077,
              33.7352
            ]
          },
          {
            "code": "410400_7",
            "name": "鲁山县",
            "center": [
              113.3077,
              33.7352
            ]
          },
          {
            "code": "410400_8",
            "name": "郏县",
            "center": [
              113.3077,
              33.7352
            ]
          },
          {
            "code": "410400_9",
            "name": "舞钢市",
            "center": [
              113.3077,
              33.7352
            ]
          },
          {
            "code": "410400_10",
            "name": "汝州市",
            "center": [
              113.3077,
              33.7352
            ]
          }
        ]
      },
      {
        "code": "410500",
        "name": "安阳市",
        "center": [
          114.3525,
          36.1034
        ],
        "children": [
          {
            "code": "410500_ALL",
            "name": "全区全域",
            "center": [
              114.3525,
              36.1034
            ]
          },
          {
            "code": "410500_1",
            "name": "文峰区",
            "center": [
              114.3525,
              36.1034
            ]
          },
          {
            "code": "410500_2",
            "name": "北关区",
            "center": [
              114.3525,
              36.1034
            ]
          },
          {
            "code": "410500_3",
            "name": "殷都区",
            "center": [
              114.3525,
              36.1034
            ]
          },
          {
            "code": "410500_4",
            "name": "龙安区",
            "center": [
              114.3525,
              36.1034
            ]
          },
          {
            "code": "410500_5",
            "name": "安阳县",
            "center": [
              114.3525,
              36.1034
            ]
          },
          {
            "code": "410500_6",
            "name": "汤阴县",
            "center": [
              114.3525,
              36.1034
            ]
          },
          {
            "code": "410500_7",
            "name": "滑县",
            "center": [
              114.3525,
              36.1034
            ]
          },
          {
            "code": "410500_8",
            "name": "内黄县",
            "center": [
              114.3525,
              36.1034
            ]
          },
          {
            "code": "410500_9",
            "name": "林州市",
            "center": [
              114.3525,
              36.1034
            ]
          }
        ]
      },
      {
        "code": "410600",
        "name": "鹤壁市",
        "center": [
          114.2954,
          35.7482
        ],
        "children": [
          {
            "code": "410600_ALL",
            "name": "全区全域",
            "center": [
              114.2954,
              35.7482
            ]
          },
          {
            "code": "410600_1",
            "name": "鹤山区",
            "center": [
              114.2954,
              35.7482
            ]
          },
          {
            "code": "410600_2",
            "name": "山城区",
            "center": [
              114.2954,
              35.7482
            ]
          },
          {
            "code": "410600_3",
            "name": "淇滨区",
            "center": [
              114.2954,
              35.7482
            ]
          },
          {
            "code": "410600_4",
            "name": "浚县",
            "center": [
              114.2954,
              35.7482
            ]
          },
          {
            "code": "410600_5",
            "name": "淇县",
            "center": [
              114.2954,
              35.7482
            ]
          }
        ]
      },
      {
        "code": "410700",
        "name": "新乡市",
        "center": [
          113.8839,
          35.3026
        ],
        "children": [
          {
            "code": "410700_ALL",
            "name": "全区全域",
            "center": [
              113.8839,
              35.3026
            ]
          },
          {
            "code": "410700_1",
            "name": "红旗区",
            "center": [
              113.8839,
              35.3026
            ]
          },
          {
            "code": "410700_2",
            "name": "卫滨区",
            "center": [
              113.8839,
              35.3026
            ]
          },
          {
            "code": "410700_3",
            "name": "凤泉区",
            "center": [
              113.8839,
              35.3026
            ]
          },
          {
            "code": "410700_4",
            "name": "牧野区",
            "center": [
              113.8839,
              35.3026
            ]
          },
          {
            "code": "410700_5",
            "name": "新乡县",
            "center": [
              113.8839,
              35.3026
            ]
          },
          {
            "code": "410700_6",
            "name": "获嘉县",
            "center": [
              113.8839,
              35.3026
            ]
          },
          {
            "code": "410700_7",
            "name": "原阳县",
            "center": [
              113.8839,
              35.3026
            ]
          },
          {
            "code": "410700_8",
            "name": "延津县",
            "center": [
              113.8839,
              35.3026
            ]
          },
          {
            "code": "410700_9",
            "name": "封丘县",
            "center": [
              113.8839,
              35.3026
            ]
          },
          {
            "code": "410700_10",
            "name": "辉县市",
            "center": [
              113.8839,
              35.3026
            ]
          },
          {
            "code": "410700_11",
            "name": "卫辉市",
            "center": [
              113.8839,
              35.3026
            ]
          }
        ]
      },
      {
        "code": "410800",
        "name": "焦作市",
        "center": [
          113.2382,
          35.239
        ],
        "children": [
          {
            "code": "410800_ALL",
            "name": "全区全域",
            "center": [
              113.2382,
              35.239
            ]
          },
          {
            "code": "410800_1",
            "name": "解放区",
            "center": [
              113.2382,
              35.239
            ]
          },
          {
            "code": "410800_2",
            "name": "中站区",
            "center": [
              113.2382,
              35.239
            ]
          },
          {
            "code": "410800_3",
            "name": "马村区",
            "center": [
              113.2382,
              35.239
            ]
          },
          {
            "code": "410800_4",
            "name": "山阳区",
            "center": [
              113.2382,
              35.239
            ]
          },
          {
            "code": "410800_5",
            "name": "修武县",
            "center": [
              113.2382,
              35.239
            ]
          },
          {
            "code": "410800_6",
            "name": "博爱县",
            "center": [
              113.2382,
              35.239
            ]
          },
          {
            "code": "410800_7",
            "name": "武陟县",
            "center": [
              113.2382,
              35.239
            ]
          },
          {
            "code": "410800_8",
            "name": "温县",
            "center": [
              113.2382,
              35.239
            ]
          },
          {
            "code": "410800_9",
            "name": "沁阳市",
            "center": [
              113.2382,
              35.239
            ]
          },
          {
            "code": "410800_10",
            "name": "孟州市",
            "center": [
              113.2382,
              35.239
            ]
          }
        ]
      },
      {
        "code": "410900",
        "name": "濮阳市",
        "center": [
          115.0412,
          35.7682
        ],
        "children": [
          {
            "code": "410900_ALL",
            "name": "全区全域",
            "center": [
              115.0412,
              35.7682
            ]
          },
          {
            "code": "410900_1",
            "name": "华龙区",
            "center": [
              115.0412,
              35.7682
            ]
          },
          {
            "code": "410900_2",
            "name": "清丰县",
            "center": [
              115.0412,
              35.7682
            ]
          },
          {
            "code": "410900_3",
            "name": "南乐县",
            "center": [
              115.0412,
              35.7682
            ]
          },
          {
            "code": "410900_4",
            "name": "范县",
            "center": [
              115.0412,
              35.7682
            ]
          },
          {
            "code": "410900_5",
            "name": "台前县",
            "center": [
              115.0412,
              35.7682
            ]
          },
          {
            "code": "410900_6",
            "name": "濮阳县",
            "center": [
              115.0412,
              35.7682
            ]
          }
        ]
      },
      {
        "code": "411000",
        "name": "许昌市",
        "center": [
          113.826,
          34.023
        ],
        "children": [
          {
            "code": "411000_ALL",
            "name": "全区全域",
            "center": [
              113.826,
              34.023
            ]
          },
          {
            "code": "411000_1",
            "name": "魏都区",
            "center": [
              113.826,
              34.023
            ]
          },
          {
            "code": "411000_2",
            "name": "建安区",
            "center": [
              113.826,
              34.023
            ]
          },
          {
            "code": "411000_3",
            "name": "鄢陵县",
            "center": [
              113.826,
              34.023
            ]
          },
          {
            "code": "411000_4",
            "name": "襄城县",
            "center": [
              113.826,
              34.023
            ]
          },
          {
            "code": "411000_5",
            "name": "禹州市",
            "center": [
              113.826,
              34.023
            ]
          },
          {
            "code": "411000_6",
            "name": "长葛市",
            "center": [
              113.826,
              34.023
            ]
          }
        ]
      },
      {
        "code": "411100",
        "name": "漯河市",
        "center": [
          114.0264,
          33.5758
        ],
        "children": [
          {
            "code": "411100_ALL",
            "name": "全区全域",
            "center": [
              114.0264,
              33.5758
            ]
          },
          {
            "code": "411100_1",
            "name": "源汇区",
            "center": [
              114.0264,
              33.5758
            ]
          },
          {
            "code": "411100_2",
            "name": "郾城区",
            "center": [
              114.0264,
              33.5758
            ]
          },
          {
            "code": "411100_3",
            "name": "召陵区",
            "center": [
              114.0264,
              33.5758
            ]
          },
          {
            "code": "411100_4",
            "name": "舞阳县",
            "center": [
              114.0264,
              33.5758
            ]
          },
          {
            "code": "411100_5",
            "name": "临颍县",
            "center": [
              114.0264,
              33.5758
            ]
          }
        ]
      },
      {
        "code": "411200",
        "name": "三门峡市",
        "center": [
          111.194,
          34.7773
        ],
        "children": [
          {
            "code": "411200_ALL",
            "name": "全区全域",
            "center": [
              111.194,
              34.7773
            ]
          },
          {
            "code": "411200_1",
            "name": "湖滨区",
            "center": [
              111.194,
              34.7773
            ]
          },
          {
            "code": "411200_2",
            "name": "陕州区",
            "center": [
              111.194,
              34.7773
            ]
          },
          {
            "code": "411200_3",
            "name": "渑池县",
            "center": [
              111.194,
              34.7773
            ]
          },
          {
            "code": "411200_4",
            "name": "卢氏县",
            "center": [
              111.194,
              34.7773
            ]
          },
          {
            "code": "411200_5",
            "name": "义马市",
            "center": [
              111.194,
              34.7773
            ]
          },
          {
            "code": "411200_6",
            "name": "灵宝市",
            "center": [
              111.194,
              34.7773
            ]
          }
        ]
      },
      {
        "code": "411300",
        "name": "南阳市",
        "center": [
          112.5283,
          32.9908
        ],
        "children": [
          {
            "code": "411300_ALL",
            "name": "全区全域",
            "center": [
              112.5283,
              32.9908
            ]
          },
          {
            "code": "411300_1",
            "name": "宛城区",
            "center": [
              112.5283,
              32.9908
            ]
          },
          {
            "code": "411300_2",
            "name": "卧龙区",
            "center": [
              112.5283,
              32.9908
            ]
          },
          {
            "code": "411300_3",
            "name": "南召县",
            "center": [
              112.5283,
              32.9908
            ]
          },
          {
            "code": "411300_4",
            "name": "方城县",
            "center": [
              112.5283,
              32.9908
            ]
          },
          {
            "code": "411300_5",
            "name": "西峡县",
            "center": [
              112.5283,
              32.9908
            ]
          },
          {
            "code": "411300_6",
            "name": "镇平县",
            "center": [
              112.5283,
              32.9908
            ]
          },
          {
            "code": "411300_7",
            "name": "内乡县",
            "center": [
              112.5283,
              32.9908
            ]
          },
          {
            "code": "411300_8",
            "name": "淅川县",
            "center": [
              112.5283,
              32.9908
            ]
          },
          {
            "code": "411300_9",
            "name": "社旗县",
            "center": [
              112.5283,
              32.9908
            ]
          },
          {
            "code": "411300_10",
            "name": "唐河县",
            "center": [
              112.5283,
              32.9908
            ]
          },
          {
            "code": "411300_11",
            "name": "新野县",
            "center": [
              112.5283,
              32.9908
            ]
          },
          {
            "code": "411300_12",
            "name": "桐柏县",
            "center": [
              112.5283,
              32.9908
            ]
          },
          {
            "code": "411300_13",
            "name": "邓州市",
            "center": [
              112.5283,
              32.9908
            ]
          }
        ]
      },
      {
        "code": "411400",
        "name": "商丘市",
        "center": [
          115.6505,
          34.437
        ],
        "children": [
          {
            "code": "411400_ALL",
            "name": "全区全域",
            "center": [
              115.6505,
              34.437
            ]
          },
          {
            "code": "411400_1",
            "name": "梁园区",
            "center": [
              115.6505,
              34.437
            ]
          },
          {
            "code": "411400_2",
            "name": "睢阳区",
            "center": [
              115.6505,
              34.437
            ]
          },
          {
            "code": "411400_3",
            "name": "民权县",
            "center": [
              115.6505,
              34.437
            ]
          },
          {
            "code": "411400_4",
            "name": "睢县",
            "center": [
              115.6505,
              34.437
            ]
          },
          {
            "code": "411400_5",
            "name": "宁陵县",
            "center": [
              115.6505,
              34.437
            ]
          },
          {
            "code": "411400_6",
            "name": "柘城县",
            "center": [
              115.6505,
              34.437
            ]
          },
          {
            "code": "411400_7",
            "name": "虞城县",
            "center": [
              115.6505,
              34.437
            ]
          },
          {
            "code": "411400_8",
            "name": "夏邑县",
            "center": [
              115.6505,
              34.437
            ]
          },
          {
            "code": "411400_9",
            "name": "永城市",
            "center": [
              115.6505,
              34.437
            ]
          }
        ]
      },
      {
        "code": "411500",
        "name": "信阳市",
        "center": [
          114.075,
          32.1233
        ],
        "children": [
          {
            "code": "411500_ALL",
            "name": "全区全域",
            "center": [
              114.075,
              32.1233
            ]
          },
          {
            "code": "411500_1",
            "name": "浉河区",
            "center": [
              114.075,
              32.1233
            ]
          },
          {
            "code": "411500_2",
            "name": "平桥区",
            "center": [
              114.075,
              32.1233
            ]
          },
          {
            "code": "411500_3",
            "name": "罗山县",
            "center": [
              114.075,
              32.1233
            ]
          },
          {
            "code": "411500_4",
            "name": "光山县",
            "center": [
              114.075,
              32.1233
            ]
          },
          {
            "code": "411500_5",
            "name": "新县",
            "center": [
              114.075,
              32.1233
            ]
          },
          {
            "code": "411500_6",
            "name": "商城县",
            "center": [
              114.075,
              32.1233
            ]
          },
          {
            "code": "411500_7",
            "name": "固始县",
            "center": [
              114.075,
              32.1233
            ]
          },
          {
            "code": "411500_8",
            "name": "潢川县",
            "center": [
              114.075,
              32.1233
            ]
          },
          {
            "code": "411500_9",
            "name": "淮滨县",
            "center": [
              114.075,
              32.1233
            ]
          },
          {
            "code": "411500_10",
            "name": "息县",
            "center": [
              114.075,
              32.1233
            ]
          }
        ]
      },
      {
        "code": "411600",
        "name": "周口市",
        "center": [
          114.6497,
          33.6204
        ],
        "children": [
          {
            "code": "411600_ALL",
            "name": "全区全域",
            "center": [
              114.6497,
              33.6204
            ]
          },
          {
            "code": "411600_1",
            "name": "川汇区",
            "center": [
              114.6497,
              33.6204
            ]
          },
          {
            "code": "411600_2",
            "name": "淮阳区",
            "center": [
              114.6497,
              33.6204
            ]
          },
          {
            "code": "411600_3",
            "name": "扶沟县",
            "center": [
              114.6497,
              33.6204
            ]
          },
          {
            "code": "411600_4",
            "name": "西华县",
            "center": [
              114.6497,
              33.6204
            ]
          },
          {
            "code": "411600_5",
            "name": "商水县",
            "center": [
              114.6497,
              33.6204
            ]
          },
          {
            "code": "411600_6",
            "name": "沈丘县",
            "center": [
              114.6497,
              33.6204
            ]
          },
          {
            "code": "411600_7",
            "name": "郸城县",
            "center": [
              114.6497,
              33.6204
            ]
          },
          {
            "code": "411600_8",
            "name": "太康县",
            "center": [
              114.6497,
              33.6204
            ]
          },
          {
            "code": "411600_9",
            "name": "鹿邑县",
            "center": [
              114.6497,
              33.6204
            ]
          },
          {
            "code": "411600_10",
            "name": "项城市",
            "center": [
              114.6497,
              33.6204
            ]
          }
        ]
      },
      {
        "code": "411700",
        "name": "驻马店市",
        "center": [
          114.0247,
          32.9802
        ],
        "children": [
          {
            "code": "411700_ALL",
            "name": "全区全域",
            "center": [
              114.0247,
              32.9802
            ]
          },
          {
            "code": "411700_1",
            "name": "驿城区",
            "center": [
              114.0247,
              32.9802
            ]
          },
          {
            "code": "411700_2",
            "name": "西平县",
            "center": [
              114.0247,
              32.9802
            ]
          },
          {
            "code": "411700_3",
            "name": "上蔡县",
            "center": [
              114.0247,
              32.9802
            ]
          },
          {
            "code": "411700_4",
            "name": "平舆县",
            "center": [
              114.0247,
              32.9802
            ]
          },
          {
            "code": "411700_5",
            "name": "正阳县",
            "center": [
              114.0247,
              32.9802
            ]
          },
          {
            "code": "411700_6",
            "name": "确山县",
            "center": [
              114.0247,
              32.9802
            ]
          },
          {
            "code": "411700_7",
            "name": "泌阳县",
            "center": [
              114.0247,
              32.9802
            ]
          },
          {
            "code": "411700_8",
            "name": "汝南县",
            "center": [
              114.0247,
              32.9802
            ]
          },
          {
            "code": "411700_9",
            "name": "遂平县",
            "center": [
              114.0247,
              32.9802
            ]
          },
          {
            "code": "411700_10",
            "name": "新蔡县",
            "center": [
              114.0247,
              32.9802
            ]
          }
        ]
      },
      {
        "code": "411800",
        "name": "济源市",
        "center": [
          112.59,
          35.0904
        ],
        "children": [
          {
            "code": "411800_ALL",
            "name": "全区全域",
            "center": [
              112.59,
              35.0904
            ]
          },
          {
            "code": "411800_1",
            "name": "济源市全域",
            "center": [
              112.59,
              35.0904
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "420000",
    "name": "湖北省",
    "center": [
      114.3055,
      30.5928
    ],
    "children": [
      {
        "code": "420000_ALL",
        "name": "全省范围",
        "center": [
          114.3055,
          30.5928
        ],
        "children": [
          {
            "code": "420000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              114.3055,
              30.5928
            ]
          }
        ]
      },
      {
        "code": "420100",
        "name": "武汉市",
        "center": [
          114.3055,
          30.5928
        ],
        "children": [
          {
            "code": "420100_ALL",
            "name": "全区全域",
            "center": [
              114.3055,
              30.5928
            ]
          },
          {
            "code": "420100_1",
            "name": "江岸区",
            "center": [
              114.3055,
              30.5928
            ]
          },
          {
            "code": "420100_2",
            "name": "江汉区",
            "center": [
              114.3055,
              30.5928
            ]
          },
          {
            "code": "420100_3",
            "name": "硚口区",
            "center": [
              114.3055,
              30.5928
            ]
          },
          {
            "code": "420100_4",
            "name": "汉阳区",
            "center": [
              114.3055,
              30.5928
            ]
          },
          {
            "code": "420100_5",
            "name": "武昌区",
            "center": [
              114.3055,
              30.5928
            ]
          },
          {
            "code": "420100_6",
            "name": "青山区",
            "center": [
              114.3055,
              30.5928
            ]
          },
          {
            "code": "420100_7",
            "name": "洪山区",
            "center": [
              114.3055,
              30.5928
            ]
          },
          {
            "code": "420100_8",
            "name": "东西湖区",
            "center": [
              114.3055,
              30.5928
            ]
          },
          {
            "code": "420100_9",
            "name": "汉南区",
            "center": [
              114.3055,
              30.5928
            ]
          },
          {
            "code": "420100_10",
            "name": "蔡甸区",
            "center": [
              114.3055,
              30.5928
            ]
          },
          {
            "code": "420100_11",
            "name": "江夏区",
            "center": [
              114.3055,
              30.5928
            ]
          },
          {
            "code": "420100_12",
            "name": "黄陂区",
            "center": [
              114.3055,
              30.5928
            ]
          },
          {
            "code": "420100_13",
            "name": "新洲区",
            "center": [
              114.3055,
              30.5928
            ]
          }
        ]
      },
      {
        "code": "420200",
        "name": "黄石市",
        "center": [
          115.077,
          30.2239
        ],
        "children": [
          {
            "code": "420200_ALL",
            "name": "全区全域",
            "center": [
              115.077,
              30.2239
            ]
          },
          {
            "code": "420200_1",
            "name": "黄石港区",
            "center": [
              115.077,
              30.2239
            ]
          },
          {
            "code": "420200_2",
            "name": "西塞山区",
            "center": [
              115.077,
              30.2239
            ]
          },
          {
            "code": "420200_3",
            "name": "下陆区",
            "center": [
              115.077,
              30.2239
            ]
          },
          {
            "code": "420200_4",
            "name": "铁山区",
            "center": [
              115.077,
              30.2239
            ]
          },
          {
            "code": "420200_5",
            "name": "阳新县",
            "center": [
              115.077,
              30.2239
            ]
          },
          {
            "code": "420200_6",
            "name": "大冶市",
            "center": [
              115.077,
              30.2239
            ]
          }
        ]
      },
      {
        "code": "420300",
        "name": "十堰市",
        "center": [
          110.7879,
          32.6469
        ],
        "children": [
          {
            "code": "420300_ALL",
            "name": "全区全域",
            "center": [
              110.7879,
              32.6469
            ]
          },
          {
            "code": "420300_1",
            "name": "茅箭区",
            "center": [
              110.7879,
              32.6469
            ]
          },
          {
            "code": "420300_2",
            "name": "张湾区",
            "center": [
              110.7879,
              32.6469
            ]
          },
          {
            "code": "420300_3",
            "name": "郧阳区",
            "center": [
              110.7879,
              32.6469
            ]
          },
          {
            "code": "420300_4",
            "name": "郧西县",
            "center": [
              110.7879,
              32.6469
            ]
          },
          {
            "code": "420300_5",
            "name": "竹山县",
            "center": [
              110.7879,
              32.6469
            ]
          },
          {
            "code": "420300_6",
            "name": "竹溪县",
            "center": [
              110.7879,
              32.6469
            ]
          },
          {
            "code": "420300_7",
            "name": "房县",
            "center": [
              110.7879,
              32.6469
            ]
          },
          {
            "code": "420300_8",
            "name": "丹江口市",
            "center": [
              110.7879,
              32.6469
            ]
          }
        ]
      },
      {
        "code": "420400",
        "name": "宜昌市",
        "center": [
          111.2865,
          30.692
        ],
        "children": [
          {
            "code": "420400_ALL",
            "name": "全区全域",
            "center": [
              111.2865,
              30.692
            ]
          },
          {
            "code": "420400_1",
            "name": "西陵区",
            "center": [
              111.2865,
              30.692
            ]
          },
          {
            "code": "420400_2",
            "name": "伍家岗区",
            "center": [
              111.2865,
              30.692
            ]
          },
          {
            "code": "420400_3",
            "name": "点军区",
            "center": [
              111.2865,
              30.692
            ]
          },
          {
            "code": "420400_4",
            "name": "猇亭区",
            "center": [
              111.2865,
              30.692
            ]
          },
          {
            "code": "420400_5",
            "name": "夷陵区",
            "center": [
              111.2865,
              30.692
            ]
          },
          {
            "code": "420400_6",
            "name": "远安县",
            "center": [
              111.2865,
              30.692
            ]
          },
          {
            "code": "420400_7",
            "name": "兴山县",
            "center": [
              111.2865,
              30.692
            ]
          },
          {
            "code": "420400_8",
            "name": "秭归县",
            "center": [
              111.2865,
              30.692
            ]
          },
          {
            "code": "420400_9",
            "name": "长阳土家族自治县",
            "center": [
              111.2865,
              30.692
            ]
          },
          {
            "code": "420400_10",
            "name": "五峰土家族自治县",
            "center": [
              111.2865,
              30.692
            ]
          },
          {
            "code": "420400_11",
            "name": "宜都市",
            "center": [
              111.2865,
              30.692
            ]
          },
          {
            "code": "420400_12",
            "name": "当阳市",
            "center": [
              111.2865,
              30.692
            ]
          },
          {
            "code": "420400_13",
            "name": "枝江市",
            "center": [
              111.2865,
              30.692
            ]
          }
        ]
      },
      {
        "code": "420500",
        "name": "襄阳市",
        "center": [
          112.1441,
          32.0424
        ],
        "children": [
          {
            "code": "420500_ALL",
            "name": "全区全域",
            "center": [
              112.1441,
              32.0424
            ]
          },
          {
            "code": "420500_1",
            "name": "襄城区",
            "center": [
              112.1441,
              32.0424
            ]
          },
          {
            "code": "420500_2",
            "name": "樊城区",
            "center": [
              112.1441,
              32.0424
            ]
          },
          {
            "code": "420500_3",
            "name": "襄州区",
            "center": [
              112.1441,
              32.0424
            ]
          },
          {
            "code": "420500_4",
            "name": "南漳县",
            "center": [
              112.1441,
              32.0424
            ]
          },
          {
            "code": "420500_5",
            "name": "谷城县",
            "center": [
              112.1441,
              32.0424
            ]
          },
          {
            "code": "420500_6",
            "name": "保康县",
            "center": [
              112.1441,
              32.0424
            ]
          },
          {
            "code": "420500_7",
            "name": "老河口市",
            "center": [
              112.1441,
              32.0424
            ]
          },
          {
            "code": "420500_8",
            "name": "枣阳市",
            "center": [
              112.1441,
              32.0424
            ]
          },
          {
            "code": "420500_9",
            "name": "宜城市",
            "center": [
              112.1441,
              32.0424
            ]
          }
        ]
      },
      {
        "code": "420600",
        "name": "鄂州市",
        "center": [
          114.8906,
          30.3965
        ],
        "children": [
          {
            "code": "420600_ALL",
            "name": "全区全域",
            "center": [
              114.8906,
              30.3965
            ]
          },
          {
            "code": "420600_1",
            "name": "梁子湖区",
            "center": [
              114.8906,
              30.3965
            ]
          },
          {
            "code": "420600_2",
            "name": "华容区",
            "center": [
              114.8906,
              30.3965
            ]
          },
          {
            "code": "420600_3",
            "name": "鄂城区",
            "center": [
              114.8906,
              30.3965
            ]
          }
        ]
      },
      {
        "code": "420700",
        "name": "荆门市",
        "center": [
          112.1995,
          31.0354
        ],
        "children": [
          {
            "code": "420700_ALL",
            "name": "全区全域",
            "center": [
              112.1995,
              31.0354
            ]
          },
          {
            "code": "420700_1",
            "name": "东宝区",
            "center": [
              112.1995,
              31.0354
            ]
          },
          {
            "code": "420700_2",
            "name": "掇刀区",
            "center": [
              112.1995,
              31.0354
            ]
          },
          {
            "code": "420700_3",
            "name": "京山市",
            "center": [
              112.1995,
              31.0354
            ]
          },
          {
            "code": "420700_4",
            "name": "沙洋县",
            "center": [
              112.1995,
              31.0354
            ]
          },
          {
            "code": "420700_5",
            "name": "钟祥市",
            "center": [
              112.1995,
              31.0354
            ]
          }
        ]
      },
      {
        "code": "420800",
        "name": "孝感市",
        "center": [
          113.9266,
          30.9264
        ],
        "children": [
          {
            "code": "420800_ALL",
            "name": "全区全域",
            "center": [
              113.9266,
              30.9264
            ]
          },
          {
            "code": "420800_1",
            "name": "孝南区",
            "center": [
              113.9266,
              30.9264
            ]
          },
          {
            "code": "420800_2",
            "name": "孝昌县",
            "center": [
              113.9266,
              30.9264
            ]
          },
          {
            "code": "420800_3",
            "name": "大悟县",
            "center": [
              113.9266,
              30.9264
            ]
          },
          {
            "code": "420800_4",
            "name": "云梦县",
            "center": [
              113.9266,
              30.9264
            ]
          },
          {
            "code": "420800_5",
            "name": "应城市",
            "center": [
              113.9266,
              30.9264
            ]
          },
          {
            "code": "420800_6",
            "name": "安陆市",
            "center": [
              113.9266,
              30.9264
            ]
          },
          {
            "code": "420800_7",
            "name": "汉川市",
            "center": [
              113.9266,
              30.9264
            ]
          }
        ]
      },
      {
        "code": "420900",
        "name": "荆州市",
        "center": [
          112.2381,
          30.3269
        ],
        "children": [
          {
            "code": "420900_ALL",
            "name": "全区全域",
            "center": [
              112.2381,
              30.3269
            ]
          },
          {
            "code": "420900_1",
            "name": "沙市区",
            "center": [
              112.2381,
              30.3269
            ]
          },
          {
            "code": "420900_2",
            "name": "荆州区",
            "center": [
              112.2381,
              30.3269
            ]
          },
          {
            "code": "420900_3",
            "name": "公安县",
            "center": [
              112.2381,
              30.3269
            ]
          },
          {
            "code": "420900_4",
            "name": "监利市",
            "center": [
              112.2381,
              30.3269
            ]
          },
          {
            "code": "420900_5",
            "name": "江陵县",
            "center": [
              112.2381,
              30.3269
            ]
          },
          {
            "code": "420900_6",
            "name": "石首市",
            "center": [
              112.2381,
              30.3269
            ]
          },
          {
            "code": "420900_7",
            "name": "洪湖市",
            "center": [
              112.2381,
              30.3269
            ]
          },
          {
            "code": "420900_8",
            "name": "松滋市",
            "center": [
              112.2381,
              30.3269
            ]
          }
        ]
      },
      {
        "code": "421000",
        "name": "黄冈市",
        "center": [
          114.8794,
          30.4477
        ],
        "children": [
          {
            "code": "421000_ALL",
            "name": "全区全域",
            "center": [
              114.8794,
              30.4477
            ]
          },
          {
            "code": "421000_1",
            "name": "黄州区",
            "center": [
              114.8794,
              30.4477
            ]
          },
          {
            "code": "421000_2",
            "name": "团风县",
            "center": [
              114.8794,
              30.4477
            ]
          },
          {
            "code": "421000_3",
            "name": "红安县",
            "center": [
              114.8794,
              30.4477
            ]
          },
          {
            "code": "421000_4",
            "name": "罗田县",
            "center": [
              114.8794,
              30.4477
            ]
          },
          {
            "code": "421000_5",
            "name": "英山县",
            "center": [
              114.8794,
              30.4477
            ]
          },
          {
            "code": "421000_6",
            "name": "浠水县",
            "center": [
              114.8794,
              30.4477
            ]
          },
          {
            "code": "421000_7",
            "name": "蕲春县",
            "center": [
              114.8794,
              30.4477
            ]
          },
          {
            "code": "421000_8",
            "name": "黄梅县",
            "center": [
              114.8794,
              30.4477
            ]
          },
          {
            "code": "421000_9",
            "name": "麻城市",
            "center": [
              114.8794,
              30.4477
            ]
          },
          {
            "code": "421000_10",
            "name": "武穴市",
            "center": [
              114.8794,
              30.4477
            ]
          }
        ]
      },
      {
        "code": "421100",
        "name": "咸宁市",
        "center": [
          114.3224,
          29.8415
        ],
        "children": [
          {
            "code": "421100_ALL",
            "name": "全区全域",
            "center": [
              114.3224,
              29.8415
            ]
          },
          {
            "code": "421100_1",
            "name": "咸安区",
            "center": [
              114.3224,
              29.8415
            ]
          },
          {
            "code": "421100_2",
            "name": "嘉鱼县",
            "center": [
              114.3224,
              29.8415
            ]
          },
          {
            "code": "421100_3",
            "name": "通城县",
            "center": [
              114.3224,
              29.8415
            ]
          },
          {
            "code": "421100_4",
            "name": "崇阳县",
            "center": [
              114.3224,
              29.8415
            ]
          },
          {
            "code": "421100_5",
            "name": "通山县",
            "center": [
              114.3224,
              29.8415
            ]
          },
          {
            "code": "421100_6",
            "name": "赤壁市",
            "center": [
              114.3224,
              29.8415
            ]
          }
        ]
      },
      {
        "code": "421200",
        "name": "随州市",
        "center": [
          113.3826,
          31.6906
        ],
        "children": [
          {
            "code": "421200_ALL",
            "name": "全区全域",
            "center": [
              113.3826,
              31.6906
            ]
          },
          {
            "code": "421200_1",
            "name": "曾都区",
            "center": [
              113.3826,
              31.6906
            ]
          },
          {
            "code": "421200_2",
            "name": "随县",
            "center": [
              113.3826,
              31.6906
            ]
          },
          {
            "code": "421200_3",
            "name": "广水市",
            "center": [
              113.3826,
              31.6906
            ]
          }
        ]
      },
      {
        "code": "421300",
        "name": "恩施土家族苗族自治州",
        "center": [
          109.486,
          30.2831
        ],
        "children": [
          {
            "code": "421300_ALL",
            "name": "全区全域",
            "center": [
              109.486,
              30.2831
            ]
          },
          {
            "code": "421300_1",
            "name": "恩施市",
            "center": [
              109.486,
              30.2831
            ]
          },
          {
            "code": "421300_2",
            "name": "利川市",
            "center": [
              109.486,
              30.2831
            ]
          },
          {
            "code": "421300_3",
            "name": "建始县",
            "center": [
              109.486,
              30.2831
            ]
          },
          {
            "code": "421300_4",
            "name": "巴东县",
            "center": [
              109.486,
              30.2831
            ]
          },
          {
            "code": "421300_5",
            "name": "宣恩县",
            "center": [
              109.486,
              30.2831
            ]
          },
          {
            "code": "421300_6",
            "name": "咸丰县",
            "center": [
              109.486,
              30.2831
            ]
          },
          {
            "code": "421300_7",
            "name": "来凤县",
            "center": [
              109.486,
              30.2831
            ]
          },
          {
            "code": "421300_8",
            "name": "鹤峰县",
            "center": [
              109.486,
              30.2831
            ]
          }
        ]
      },
      {
        "code": "421400",
        "name": "直辖县级单位(仙桃/潜江/天门/神农架)",
        "center": [
          113.4539,
          30.3644
        ],
        "children": [
          {
            "code": "421400_ALL",
            "name": "全区全域",
            "center": [
              113.4539,
              30.3644
            ]
          },
          {
            "code": "421400_1",
            "name": "仙桃市",
            "center": [
              113.4539,
              30.3644
            ]
          },
          {
            "code": "421400_2",
            "name": "潜江市",
            "center": [
              113.4539,
              30.3644
            ]
          },
          {
            "code": "421400_3",
            "name": "天门市",
            "center": [
              113.4539,
              30.3644
            ]
          },
          {
            "code": "421400_4",
            "name": "神农架林区",
            "center": [
              113.4539,
              30.3644
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "430000",
    "name": "湖南省",
    "center": [
      112.9388,
      28.2282
    ],
    "children": [
      {
        "code": "430000_ALL",
        "name": "全省范围",
        "center": [
          112.9388,
          28.2282
        ],
        "children": [
          {
            "code": "430000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              112.9388,
              28.2282
            ]
          }
        ]
      },
      {
        "code": "430100",
        "name": "长沙市",
        "center": [
          112.9388,
          28.2282
        ],
        "children": [
          {
            "code": "430100_ALL",
            "name": "全区全域",
            "center": [
              112.9388,
              28.2282
            ]
          },
          {
            "code": "430100_1",
            "name": "芙蓉区",
            "center": [
              112.9388,
              28.2282
            ]
          },
          {
            "code": "430100_2",
            "name": "天心区",
            "center": [
              112.9388,
              28.2282
            ]
          },
          {
            "code": "430100_3",
            "name": "岳麓区",
            "center": [
              112.9388,
              28.2282
            ]
          },
          {
            "code": "430100_4",
            "name": "开福区",
            "center": [
              112.9388,
              28.2282
            ]
          },
          {
            "code": "430100_5",
            "name": "雨花区",
            "center": [
              112.9388,
              28.2282
            ]
          },
          {
            "code": "430100_6",
            "name": "望城区",
            "center": [
              112.9388,
              28.2282
            ]
          },
          {
            "code": "430100_7",
            "name": "长沙县",
            "center": [
              112.9388,
              28.2282
            ]
          },
          {
            "code": "430100_8",
            "name": "浏阳市",
            "center": [
              112.9388,
              28.2282
            ]
          },
          {
            "code": "430100_9",
            "name": "宁乡市",
            "center": [
              112.9388,
              28.2282
            ]
          }
        ]
      },
      {
        "code": "430200",
        "name": "株洲市",
        "center": [
          113.134,
          27.8274
        ],
        "children": [
          {
            "code": "430200_ALL",
            "name": "全区全域",
            "center": [
              113.134,
              27.8274
            ]
          },
          {
            "code": "430200_1",
            "name": "荷塘区",
            "center": [
              113.134,
              27.8274
            ]
          },
          {
            "code": "430200_2",
            "name": "芦淞区",
            "center": [
              113.134,
              27.8274
            ]
          },
          {
            "code": "430200_3",
            "name": "石峰区",
            "center": [
              113.134,
              27.8274
            ]
          },
          {
            "code": "430200_4",
            "name": "天元区",
            "center": [
              113.134,
              27.8274
            ]
          },
          {
            "code": "430200_5",
            "name": "渌口区",
            "center": [
              113.134,
              27.8274
            ]
          },
          {
            "code": "430200_6",
            "name": "攸县",
            "center": [
              113.134,
              27.8274
            ]
          },
          {
            "code": "430200_7",
            "name": "茶陵县",
            "center": [
              113.134,
              27.8274
            ]
          },
          {
            "code": "430200_8",
            "name": "炎陵县",
            "center": [
              113.134,
              27.8274
            ]
          },
          {
            "code": "430200_9",
            "name": "醴陵市",
            "center": [
              113.134,
              27.8274
            ]
          }
        ]
      },
      {
        "code": "430300",
        "name": "湘潭市",
        "center": [
          112.9441,
          27.8297
        ],
        "children": [
          {
            "code": "430300_ALL",
            "name": "全区全域",
            "center": [
              112.9441,
              27.8297
            ]
          },
          {
            "code": "430300_1",
            "name": "雨湖区",
            "center": [
              112.9441,
              27.8297
            ]
          },
          {
            "code": "430300_2",
            "name": "岳塘区",
            "center": [
              112.9441,
              27.8297
            ]
          },
          {
            "code": "430300_3",
            "name": "湘潭县",
            "center": [
              112.9441,
              27.8297
            ]
          },
          {
            "code": "430300_4",
            "name": "湘乡市",
            "center": [
              112.9441,
              27.8297
            ]
          },
          {
            "code": "430300_5",
            "name": "韶山市",
            "center": [
              112.9441,
              27.8297
            ]
          }
        ]
      },
      {
        "code": "430400",
        "name": "衡阳市",
        "center": [
          112.5719,
          26.893
        ],
        "children": [
          {
            "code": "430400_ALL",
            "name": "全区全域",
            "center": [
              112.5719,
              26.893
            ]
          },
          {
            "code": "430400_1",
            "name": "珠晖区",
            "center": [
              112.5719,
              26.893
            ]
          },
          {
            "code": "430400_2",
            "name": "雁峰区",
            "center": [
              112.5719,
              26.893
            ]
          },
          {
            "code": "430400_3",
            "name": "石鼓区",
            "center": [
              112.5719,
              26.893
            ]
          },
          {
            "code": "430400_4",
            "name": "蒸湘区",
            "center": [
              112.5719,
              26.893
            ]
          },
          {
            "code": "430400_5",
            "name": "南岳区",
            "center": [
              112.5719,
              26.893
            ]
          },
          {
            "code": "430400_6",
            "name": "衡阳县",
            "center": [
              112.5719,
              26.893
            ]
          },
          {
            "code": "430400_7",
            "name": "衡南县",
            "center": [
              112.5719,
              26.893
            ]
          },
          {
            "code": "430400_8",
            "name": "衡山县",
            "center": [
              112.5719,
              26.893
            ]
          },
          {
            "code": "430400_9",
            "name": "衡东县",
            "center": [
              112.5719,
              26.893
            ]
          },
          {
            "code": "430400_10",
            "name": "祁东县",
            "center": [
              112.5719,
              26.893
            ]
          },
          {
            "code": "430400_11",
            "name": "耒阳市",
            "center": [
              112.5719,
              26.893
            ]
          },
          {
            "code": "430400_12",
            "name": "常宁市",
            "center": [
              112.5719,
              26.893
            ]
          }
        ]
      },
      {
        "code": "430500",
        "name": "邵阳市",
        "center": [
          111.4692,
          27.2378
        ],
        "children": [
          {
            "code": "430500_ALL",
            "name": "全区全域",
            "center": [
              111.4692,
              27.2378
            ]
          },
          {
            "code": "430500_1",
            "name": "双清区",
            "center": [
              111.4692,
              27.2378
            ]
          },
          {
            "code": "430500_2",
            "name": "大祥区",
            "center": [
              111.4692,
              27.2378
            ]
          },
          {
            "code": "430500_3",
            "name": "北塔区",
            "center": [
              111.4692,
              27.2378
            ]
          },
          {
            "code": "430500_4",
            "name": "邵东市",
            "center": [
              111.4692,
              27.2378
            ]
          },
          {
            "code": "430500_5",
            "name": "新邵县",
            "center": [
              111.4692,
              27.2378
            ]
          },
          {
            "code": "430500_6",
            "name": "邵阳县",
            "center": [
              111.4692,
              27.2378
            ]
          },
          {
            "code": "430500_7",
            "name": "隆回县",
            "center": [
              111.4692,
              27.2378
            ]
          },
          {
            "code": "430500_8",
            "name": "洞口县",
            "center": [
              111.4692,
              27.2378
            ]
          },
          {
            "code": "430500_9",
            "name": "绥宁县",
            "center": [
              111.4692,
              27.2378
            ]
          },
          {
            "code": "430500_10",
            "name": "新宁县",
            "center": [
              111.4692,
              27.2378
            ]
          },
          {
            "code": "430500_11",
            "name": "城步苗族自治县",
            "center": [
              111.4692,
              27.2378
            ]
          },
          {
            "code": "430500_12",
            "name": "武冈市",
            "center": [
              111.4692,
              27.2378
            ]
          }
        ]
      },
      {
        "code": "430600",
        "name": "岳阳市",
        "center": [
          113.1329,
          29.3703
        ],
        "children": [
          {
            "code": "430600_ALL",
            "name": "全区全域",
            "center": [
              113.1329,
              29.3703
            ]
          },
          {
            "code": "430600_1",
            "name": "岳阳楼区",
            "center": [
              113.1329,
              29.3703
            ]
          },
          {
            "code": "430600_2",
            "name": "云溪区",
            "center": [
              113.1329,
              29.3703
            ]
          },
          {
            "code": "430600_3",
            "name": "君山区",
            "center": [
              113.1329,
              29.3703
            ]
          },
          {
            "code": "430600_4",
            "name": "岳阳县",
            "center": [
              113.1329,
              29.3703
            ]
          },
          {
            "code": "430600_5",
            "name": "华容县",
            "center": [
              113.1329,
              29.3703
            ]
          },
          {
            "code": "430600_6",
            "name": "湘阴县",
            "center": [
              113.1329,
              29.3703
            ]
          },
          {
            "code": "430600_7",
            "name": "平江县",
            "center": [
              113.1329,
              29.3703
            ]
          },
          {
            "code": "430600_8",
            "name": "汨罗市",
            "center": [
              113.1329,
              29.3703
            ]
          },
          {
            "code": "430600_9",
            "name": "临湘市",
            "center": [
              113.1329,
              29.3703
            ]
          }
        ]
      },
      {
        "code": "430700",
        "name": "常德市",
        "center": [
          111.6913,
          29.0402
        ],
        "children": [
          {
            "code": "430700_ALL",
            "name": "全区全域",
            "center": [
              111.6913,
              29.0402
            ]
          },
          {
            "code": "430700_1",
            "name": "武陵区",
            "center": [
              111.6913,
              29.0402
            ]
          },
          {
            "code": "430700_2",
            "name": "鼎城区",
            "center": [
              111.6913,
              29.0402
            ]
          },
          {
            "code": "430700_3",
            "name": "安乡县",
            "center": [
              111.6913,
              29.0402
            ]
          },
          {
            "code": "430700_4",
            "name": "汉寿县",
            "center": [
              111.6913,
              29.0402
            ]
          },
          {
            "code": "430700_5",
            "name": "桃源县",
            "center": [
              111.6913,
              29.0402
            ]
          },
          {
            "code": "430700_6",
            "name": "临澧县",
            "center": [
              111.6913,
              29.0402
            ]
          },
          {
            "code": "430700_7",
            "name": "石门县",
            "center": [
              111.6913,
              29.0402
            ]
          },
          {
            "code": "430700_8",
            "name": "澧县",
            "center": [
              111.6913,
              29.0402
            ]
          },
          {
            "code": "430700_9",
            "name": "津市市",
            "center": [
              111.6913,
              29.0402
            ]
          }
        ]
      },
      {
        "code": "430800",
        "name": "张家界市",
        "center": [
          110.4792,
          29.1274
        ],
        "children": [
          {
            "code": "430800_ALL",
            "name": "全区全域",
            "center": [
              110.4792,
              29.1274
            ]
          },
          {
            "code": "430800_1",
            "name": "永定区",
            "center": [
              110.4792,
              29.1274
            ]
          },
          {
            "code": "430800_2",
            "name": "武陵源区",
            "center": [
              110.4792,
              29.1274
            ]
          },
          {
            "code": "430800_3",
            "name": "慈利县",
            "center": [
              110.4792,
              29.1274
            ]
          },
          {
            "code": "430800_4",
            "name": "桑植县",
            "center": [
              110.4792,
              29.1274
            ]
          }
        ]
      },
      {
        "code": "430900",
        "name": "益阳市",
        "center": [
          112.3551,
          28.5701
        ],
        "children": [
          {
            "code": "430900_ALL",
            "name": "全区全域",
            "center": [
              112.3551,
              28.5701
            ]
          },
          {
            "code": "430900_1",
            "name": "资阳区",
            "center": [
              112.3551,
              28.5701
            ]
          },
          {
            "code": "430900_2",
            "name": "赫山区",
            "center": [
              112.3551,
              28.5701
            ]
          },
          {
            "code": "430900_3",
            "name": "南县",
            "center": [
              112.3551,
              28.5701
            ]
          },
          {
            "code": "430900_4",
            "name": "桃江县",
            "center": [
              112.3551,
              28.5701
            ]
          },
          {
            "code": "430900_5",
            "name": "安化县",
            "center": [
              112.3551,
              28.5701
            ]
          },
          {
            "code": "430900_6",
            "name": "沅江市",
            "center": [
              112.3551,
              28.5701
            ]
          }
        ]
      },
      {
        "code": "431000",
        "name": "郴州市",
        "center": [
          113.0148,
          25.7705
        ],
        "children": [
          {
            "code": "431000_ALL",
            "name": "全区全域",
            "center": [
              113.0148,
              25.7705
            ]
          },
          {
            "code": "431000_1",
            "name": "北湖区",
            "center": [
              113.0148,
              25.7705
            ]
          },
          {
            "code": "431000_2",
            "name": "苏仙区",
            "center": [
              113.0148,
              25.7705
            ]
          },
          {
            "code": "431000_3",
            "name": "桂阳县",
            "center": [
              113.0148,
              25.7705
            ]
          },
          {
            "code": "431000_4",
            "name": "宜章县",
            "center": [
              113.0148,
              25.7705
            ]
          },
          {
            "code": "431000_5",
            "name": "永兴县",
            "center": [
              113.0148,
              25.7705
            ]
          },
          {
            "code": "431000_6",
            "name": "嘉禾县",
            "center": [
              113.0148,
              25.7705
            ]
          },
          {
            "code": "431000_7",
            "name": "临武县",
            "center": [
              113.0148,
              25.7705
            ]
          },
          {
            "code": "431000_8",
            "name": "汝城县",
            "center": [
              113.0148,
              25.7705
            ]
          },
          {
            "code": "431000_9",
            "name": "桂东县",
            "center": [
              113.0148,
              25.7705
            ]
          },
          {
            "code": "431000_10",
            "name": "安仁县",
            "center": [
              113.0148,
              25.7705
            ]
          },
          {
            "code": "431000_11",
            "name": "资兴市",
            "center": [
              113.0148,
              25.7705
            ]
          }
        ]
      },
      {
        "code": "431100",
        "name": "永州市",
        "center": [
          111.608,
          26.4345
        ],
        "children": [
          {
            "code": "431100_ALL",
            "name": "全区全域",
            "center": [
              111.608,
              26.4345
            ]
          },
          {
            "code": "431100_1",
            "name": "零陵区",
            "center": [
              111.608,
              26.4345
            ]
          },
          {
            "code": "431100_2",
            "name": "冷水滩区",
            "center": [
              111.608,
              26.4345
            ]
          },
          {
            "code": "431100_3",
            "name": "祁阳市",
            "center": [
              111.608,
              26.4345
            ]
          },
          {
            "code": "431100_4",
            "name": "东安县",
            "center": [
              111.608,
              26.4345
            ]
          },
          {
            "code": "431100_5",
            "name": "双牌县",
            "center": [
              111.608,
              26.4345
            ]
          },
          {
            "code": "431100_6",
            "name": "道县",
            "center": [
              111.608,
              26.4345
            ]
          },
          {
            "code": "431100_7",
            "name": "江永县",
            "center": [
              111.608,
              26.4345
            ]
          },
          {
            "code": "431100_8",
            "name": "宁远县",
            "center": [
              111.608,
              26.4345
            ]
          },
          {
            "code": "431100_9",
            "name": "蓝山县",
            "center": [
              111.608,
              26.4345
            ]
          },
          {
            "code": "431100_10",
            "name": "新田县",
            "center": [
              111.608,
              26.4345
            ]
          },
          {
            "code": "431100_11",
            "name": "江华瑶族自治县",
            "center": [
              111.608,
              26.4345
            ]
          }
        ]
      },
      {
        "code": "431200",
        "name": "怀化市",
        "center": [
          109.9985,
          27.555
        ],
        "children": [
          {
            "code": "431200_ALL",
            "name": "全区全域",
            "center": [
              109.9985,
              27.555
            ]
          },
          {
            "code": "431200_1",
            "name": "鹤城区",
            "center": [
              109.9985,
              27.555
            ]
          },
          {
            "code": "431200_2",
            "name": "中方县",
            "center": [
              109.9985,
              27.555
            ]
          },
          {
            "code": "431200_3",
            "name": "沅陵县",
            "center": [
              109.9985,
              27.555
            ]
          },
          {
            "code": "431200_4",
            "name": "辰溪县",
            "center": [
              109.9985,
              27.555
            ]
          },
          {
            "code": "431200_5",
            "name": "溆浦县",
            "center": [
              109.9985,
              27.555
            ]
          },
          {
            "code": "431200_6",
            "name": "会同县",
            "center": [
              109.9985,
              27.555
            ]
          },
          {
            "code": "431200_7",
            "name": "麻阳苗族自治县",
            "center": [
              109.9985,
              27.555
            ]
          },
          {
            "code": "431200_8",
            "name": "新晃侗族自治县",
            "center": [
              109.9985,
              27.555
            ]
          },
          {
            "code": "431200_9",
            "name": "芷江侗族自治县",
            "center": [
              109.9985,
              27.555
            ]
          },
          {
            "code": "431200_10",
            "name": "靖州苗族侗族自治县",
            "center": [
              109.9985,
              27.555
            ]
          },
          {
            "code": "431200_11",
            "name": "通道侗族自治县",
            "center": [
              109.9985,
              27.555
            ]
          },
          {
            "code": "431200_12",
            "name": "洪江市",
            "center": [
              109.9985,
              27.555
            ]
          }
        ]
      },
      {
        "code": "431300",
        "name": "娄底市",
        "center": [
          111.994,
          27.7348
        ],
        "children": [
          {
            "code": "431300_ALL",
            "name": "全区全域",
            "center": [
              111.994,
              27.7348
            ]
          },
          {
            "code": "431300_1",
            "name": "娄星区",
            "center": [
              111.994,
              27.7348
            ]
          },
          {
            "code": "431300_2",
            "name": "双峰县",
            "center": [
              111.994,
              27.7348
            ]
          },
          {
            "code": "431300_3",
            "name": "新化县",
            "center": [
              111.994,
              27.7348
            ]
          },
          {
            "code": "431300_4",
            "name": "冷水江市",
            "center": [
              111.994,
              27.7348
            ]
          },
          {
            "code": "431300_5",
            "name": "涟源市",
            "center": [
              111.994,
              27.7348
            ]
          }
        ]
      },
      {
        "code": "431400",
        "name": "湘西土家族苗族自治州",
        "center": [
          109.739,
          28.3117
        ],
        "children": [
          {
            "code": "431400_ALL",
            "name": "全区全域",
            "center": [
              109.739,
              28.3117
            ]
          },
          {
            "code": "431400_1",
            "name": "吉首市",
            "center": [
              109.739,
              28.3117
            ]
          },
          {
            "code": "431400_2",
            "name": "泸溪县",
            "center": [
              109.739,
              28.3117
            ]
          },
          {
            "code": "431400_3",
            "name": "凤凰县",
            "center": [
              109.739,
              28.3117
            ]
          },
          {
            "code": "431400_4",
            "name": "花垣县",
            "center": [
              109.739,
              28.3117
            ]
          },
          {
            "code": "431400_5",
            "name": "保靖县",
            "center": [
              109.739,
              28.3117
            ]
          },
          {
            "code": "431400_6",
            "name": "古丈县",
            "center": [
              109.739,
              28.3117
            ]
          },
          {
            "code": "431400_7",
            "name": "永顺县",
            "center": [
              109.739,
              28.3117
            ]
          },
          {
            "code": "431400_8",
            "name": "龙山县",
            "center": [
              109.739,
              28.3117
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "340000",
    "name": "安徽省",
    "center": [
      117.283,
      31.8611
    ],
    "children": [
      {
        "code": "340000_ALL",
        "name": "全省范围",
        "center": [
          117.283,
          31.8611
        ],
        "children": [
          {
            "code": "340000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              117.283,
              31.8611
            ]
          }
        ]
      },
      {
        "code": "340100",
        "name": "合肥市",
        "center": [
          117.283,
          31.8611
        ],
        "children": [
          {
            "code": "340100_ALL",
            "name": "全区全域",
            "center": [
              117.283,
              31.8611
            ]
          },
          {
            "code": "340100_1",
            "name": "瑶海区",
            "center": [
              117.283,
              31.8611
            ]
          },
          {
            "code": "340100_2",
            "name": "庐阳区",
            "center": [
              117.283,
              31.8611
            ]
          },
          {
            "code": "340100_3",
            "name": "蜀山区",
            "center": [
              117.283,
              31.8611
            ]
          },
          {
            "code": "340100_4",
            "name": "包河区",
            "center": [
              117.283,
              31.8611
            ]
          },
          {
            "code": "340100_5",
            "name": "长丰县",
            "center": [
              117.283,
              31.8611
            ]
          },
          {
            "code": "340100_6",
            "name": "肥东县",
            "center": [
              117.283,
              31.8611
            ]
          },
          {
            "code": "340100_7",
            "name": "肥西县",
            "center": [
              117.283,
              31.8611
            ]
          },
          {
            "code": "340100_8",
            "name": "庐江县",
            "center": [
              117.283,
              31.8611
            ]
          },
          {
            "code": "340100_9",
            "name": "巢湖市",
            "center": [
              117.283,
              31.8611
            ]
          }
        ]
      },
      {
        "code": "340200",
        "name": "芜湖市",
        "center": [
          118.3765,
          31.3263
        ],
        "children": [
          {
            "code": "340200_ALL",
            "name": "全区全域",
            "center": [
              118.3765,
              31.3263
            ]
          },
          {
            "code": "340200_1",
            "name": "镜湖区",
            "center": [
              118.3765,
              31.3263
            ]
          },
          {
            "code": "340200_2",
            "name": "鸠江区",
            "center": [
              118.3765,
              31.3263
            ]
          },
          {
            "code": "340200_3",
            "name": "弋江区",
            "center": [
              118.3765,
              31.3263
            ]
          },
          {
            "code": "340200_4",
            "name": "湾沚区",
            "center": [
              118.3765,
              31.3263
            ]
          },
          {
            "code": "340200_5",
            "name": "繁昌区",
            "center": [
              118.3765,
              31.3263
            ]
          },
          {
            "code": "340200_6",
            "name": "南陵县",
            "center": [
              118.3765,
              31.3263
            ]
          },
          {
            "code": "340200_7",
            "name": "无为市",
            "center": [
              118.3765,
              31.3263
            ]
          }
        ]
      },
      {
        "code": "340300",
        "name": "蚌埠市",
        "center": [
          117.3897,
          32.9163
        ],
        "children": [
          {
            "code": "340300_ALL",
            "name": "全区全域",
            "center": [
              117.3897,
              32.9163
            ]
          },
          {
            "code": "340300_1",
            "name": "龙子湖区",
            "center": [
              117.3897,
              32.9163
            ]
          },
          {
            "code": "340300_2",
            "name": "蚌山区",
            "center": [
              117.3897,
              32.9163
            ]
          },
          {
            "code": "340300_3",
            "name": "禹会区",
            "center": [
              117.3897,
              32.9163
            ]
          },
          {
            "code": "340300_4",
            "name": "淮上区",
            "center": [
              117.3897,
              32.9163
            ]
          },
          {
            "code": "340300_5",
            "name": "怀远县",
            "center": [
              117.3897,
              32.9163
            ]
          },
          {
            "code": "340300_6",
            "name": "五河县",
            "center": [
              117.3897,
              32.9163
            ]
          },
          {
            "code": "340300_7",
            "name": "固镇县",
            "center": [
              117.3897,
              32.9163
            ]
          }
        ]
      },
      {
        "code": "340400",
        "name": "淮南市",
        "center": [
          116.9998,
          32.6255
        ],
        "children": [
          {
            "code": "340400_ALL",
            "name": "全区全域",
            "center": [
              116.9998,
              32.6255
            ]
          },
          {
            "code": "340400_1",
            "name": "大通区",
            "center": [
              116.9998,
              32.6255
            ]
          },
          {
            "code": "340400_2",
            "name": "田家庵区",
            "center": [
              116.9998,
              32.6255
            ]
          },
          {
            "code": "340400_3",
            "name": "谢家集区",
            "center": [
              116.9998,
              32.6255
            ]
          },
          {
            "code": "340400_4",
            "name": "八公山区",
            "center": [
              116.9998,
              32.6255
            ]
          },
          {
            "code": "340400_5",
            "name": "潘集区",
            "center": [
              116.9998,
              32.6255
            ]
          },
          {
            "code": "340400_6",
            "name": "凤台县",
            "center": [
              116.9998,
              32.6255
            ]
          },
          {
            "code": "340400_7",
            "name": "寿县",
            "center": [
              116.9998,
              32.6255
            ]
          }
        ]
      },
      {
        "code": "340500",
        "name": "马鞍山市",
        "center": [
          118.5079,
          31.6894
        ],
        "children": [
          {
            "code": "340500_ALL",
            "name": "全区全域",
            "center": [
              118.5079,
              31.6894
            ]
          },
          {
            "code": "340500_1",
            "name": "花山区",
            "center": [
              118.5079,
              31.6894
            ]
          },
          {
            "code": "340500_2",
            "name": "雨山区",
            "center": [
              118.5079,
              31.6894
            ]
          },
          {
            "code": "340500_3",
            "name": "博望区",
            "center": [
              118.5079,
              31.6894
            ]
          },
          {
            "code": "340500_4",
            "name": "当涂县",
            "center": [
              118.5079,
              31.6894
            ]
          },
          {
            "code": "340500_5",
            "name": "含山县",
            "center": [
              118.5079,
              31.6894
            ]
          },
          {
            "code": "340500_6",
            "name": "和县",
            "center": [
              118.5079,
              31.6894
            ]
          }
        ]
      },
      {
        "code": "340600",
        "name": "淮北市",
        "center": [
          116.7983,
          33.9558
        ],
        "children": [
          {
            "code": "340600_ALL",
            "name": "全区全域",
            "center": [
              116.7983,
              33.9558
            ]
          },
          {
            "code": "340600_1",
            "name": "杜集区",
            "center": [
              116.7983,
              33.9558
            ]
          },
          {
            "code": "340600_2",
            "name": "相山区",
            "center": [
              116.7983,
              33.9558
            ]
          },
          {
            "code": "340600_3",
            "name": "烈山区",
            "center": [
              116.7983,
              33.9558
            ]
          },
          {
            "code": "340600_4",
            "name": "濉溪县",
            "center": [
              116.7983,
              33.9558
            ]
          }
        ]
      },
      {
        "code": "340700",
        "name": "铜陵市",
        "center": [
          117.8166,
          30.9299
        ],
        "children": [
          {
            "code": "340700_ALL",
            "name": "全区全域",
            "center": [
              117.8166,
              30.9299
            ]
          },
          {
            "code": "340700_1",
            "name": "铜官区",
            "center": [
              117.8166,
              30.9299
            ]
          },
          {
            "code": "340700_2",
            "name": "郊区",
            "center": [
              117.8166,
              30.9299
            ]
          },
          {
            "code": "340700_3",
            "name": "义安区",
            "center": [
              117.8166,
              30.9299
            ]
          },
          {
            "code": "340700_4",
            "name": "枞阳县",
            "center": [
              117.8166,
              30.9299
            ]
          }
        ]
      },
      {
        "code": "340800",
        "name": "安庆市",
        "center": [
          117.0587,
          30.5378
        ],
        "children": [
          {
            "code": "340800_ALL",
            "name": "全区全域",
            "center": [
              117.0587,
              30.5378
            ]
          },
          {
            "code": "340800_1",
            "name": "迎江区",
            "center": [
              117.0587,
              30.5378
            ]
          },
          {
            "code": "340800_2",
            "name": "大观区",
            "center": [
              117.0587,
              30.5378
            ]
          },
          {
            "code": "340800_3",
            "name": "宜秀区",
            "center": [
              117.0587,
              30.5378
            ]
          },
          {
            "code": "340800_4",
            "name": "怀宁县",
            "center": [
              117.0587,
              30.5378
            ]
          },
          {
            "code": "340800_5",
            "name": "太湖县",
            "center": [
              117.0587,
              30.5378
            ]
          },
          {
            "code": "340800_6",
            "name": "宿松县",
            "center": [
              117.0587,
              30.5378
            ]
          },
          {
            "code": "340800_7",
            "name": "望江县",
            "center": [
              117.0587,
              30.5378
            ]
          },
          {
            "code": "340800_8",
            "name": "岳西县",
            "center": [
              117.0587,
              30.5378
            ]
          },
          {
            "code": "340800_9",
            "name": "桐城市",
            "center": [
              117.0587,
              30.5378
            ]
          }
        ]
      },
      {
        "code": "340900",
        "name": "黄山市",
        "center": [
          118.3174,
          29.7092
        ],
        "children": [
          {
            "code": "340900_ALL",
            "name": "全区全域",
            "center": [
              118.3174,
              29.7092
            ]
          },
          {
            "code": "340900_1",
            "name": "屯溪区",
            "center": [
              118.3174,
              29.7092
            ]
          },
          {
            "code": "340900_2",
            "name": "黄山区",
            "center": [
              118.3174,
              29.7092
            ]
          },
          {
            "code": "340900_3",
            "name": "徽州区",
            "center": [
              118.3174,
              29.7092
            ]
          },
          {
            "code": "340900_4",
            "name": "歙县",
            "center": [
              118.3174,
              29.7092
            ]
          },
          {
            "code": "340900_5",
            "name": "休宁县",
            "center": [
              118.3174,
              29.7092
            ]
          },
          {
            "code": "340900_6",
            "name": "黟县",
            "center": [
              118.3174,
              29.7092
            ]
          },
          {
            "code": "340900_7",
            "name": "祁门县",
            "center": [
              118.3174,
              29.7092
            ]
          }
        ]
      },
      {
        "code": "341000",
        "name": "滁州市",
        "center": [
          118.3162,
          32.3036
        ],
        "children": [
          {
            "code": "341000_ALL",
            "name": "全区全域",
            "center": [
              118.3162,
              32.3036
            ]
          },
          {
            "code": "341000_1",
            "name": "琅琊区",
            "center": [
              118.3162,
              32.3036
            ]
          },
          {
            "code": "341000_2",
            "name": "南谯区",
            "center": [
              118.3162,
              32.3036
            ]
          },
          {
            "code": "341000_3",
            "name": "来安县",
            "center": [
              118.3162,
              32.3036
            ]
          },
          {
            "code": "341000_4",
            "name": "全椒县",
            "center": [
              118.3162,
              32.3036
            ]
          },
          {
            "code": "341000_5",
            "name": "定远县",
            "center": [
              118.3162,
              32.3036
            ]
          },
          {
            "code": "341000_6",
            "name": "凤阳县",
            "center": [
              118.3162,
              32.3036
            ]
          },
          {
            "code": "341000_7",
            "name": "天长市",
            "center": [
              118.3162,
              32.3036
            ]
          },
          {
            "code": "341000_8",
            "name": "明光市",
            "center": [
              118.3162,
              32.3036
            ]
          }
        ]
      },
      {
        "code": "341100",
        "name": "阜阳市",
        "center": [
          115.8197,
          32.8969
        ],
        "children": [
          {
            "code": "341100_ALL",
            "name": "全区全域",
            "center": [
              115.8197,
              32.8969
            ]
          },
          {
            "code": "341100_1",
            "name": "颍州区",
            "center": [
              115.8197,
              32.8969
            ]
          },
          {
            "code": "341100_2",
            "name": "颍东区",
            "center": [
              115.8197,
              32.8969
            ]
          },
          {
            "code": "341100_3",
            "name": "颍泉区",
            "center": [
              115.8197,
              32.8969
            ]
          },
          {
            "code": "341100_4",
            "name": "临泉县",
            "center": [
              115.8197,
              32.8969
            ]
          },
          {
            "code": "341100_5",
            "name": "太和县",
            "center": [
              115.8197,
              32.8969
            ]
          },
          {
            "code": "341100_6",
            "name": "阜南县",
            "center": [
              115.8197,
              32.8969
            ]
          },
          {
            "code": "341100_7",
            "name": "颍上县",
            "center": [
              115.8197,
              32.8969
            ]
          },
          {
            "code": "341100_8",
            "name": "界首市",
            "center": [
              115.8197,
              32.8969
            ]
          }
        ]
      },
      {
        "code": "341200",
        "name": "宿州市",
        "center": [
          116.9841,
          33.6339
        ],
        "children": [
          {
            "code": "341200_ALL",
            "name": "全区全域",
            "center": [
              116.9841,
              33.6339
            ]
          },
          {
            "code": "341200_1",
            "name": "埇桥区",
            "center": [
              116.9841,
              33.6339
            ]
          },
          {
            "code": "341200_2",
            "name": "砀山县",
            "center": [
              116.9841,
              33.6339
            ]
          },
          {
            "code": "341200_3",
            "name": "萧县",
            "center": [
              116.9841,
              33.6339
            ]
          },
          {
            "code": "341200_4",
            "name": "灵璧县",
            "center": [
              116.9841,
              33.6339
            ]
          },
          {
            "code": "341200_5",
            "name": "泗县",
            "center": [
              116.9841,
              33.6339
            ]
          }
        ]
      },
      {
        "code": "341300",
        "name": "六安市",
        "center": [
          116.5072,
          31.7529
        ],
        "children": [
          {
            "code": "341300_ALL",
            "name": "全区全域",
            "center": [
              116.5072,
              31.7529
            ]
          },
          {
            "code": "341300_1",
            "name": "金安区",
            "center": [
              116.5072,
              31.7529
            ]
          },
          {
            "code": "341300_2",
            "name": "裕安区",
            "center": [
              116.5072,
              31.7529
            ]
          },
          {
            "code": "341300_3",
            "name": "叶集区",
            "center": [
              116.5072,
              31.7529
            ]
          },
          {
            "code": "341300_4",
            "name": "霍邱县",
            "center": [
              116.5072,
              31.7529
            ]
          },
          {
            "code": "341300_5",
            "name": "舒城县",
            "center": [
              116.5072,
              31.7529
            ]
          },
          {
            "code": "341300_6",
            "name": "金寨县",
            "center": [
              116.5072,
              31.7529
            ]
          },
          {
            "code": "341300_7",
            "name": "霍山县",
            "center": [
              116.5072,
              31.7529
            ]
          }
        ]
      },
      {
        "code": "341400",
        "name": "亳州市",
        "center": [
          115.7801,
          33.8694
        ],
        "children": [
          {
            "code": "341400_ALL",
            "name": "全区全域",
            "center": [
              115.7801,
              33.8694
            ]
          },
          {
            "code": "341400_1",
            "name": "谯城区",
            "center": [
              115.7801,
              33.8694
            ]
          },
          {
            "code": "341400_2",
            "name": "涡阳县",
            "center": [
              115.7801,
              33.8694
            ]
          },
          {
            "code": "341400_3",
            "name": "蒙城县",
            "center": [
              115.7801,
              33.8694
            ]
          },
          {
            "code": "341400_4",
            "name": "利辛县",
            "center": [
              115.7801,
              33.8694
            ]
          }
        ]
      },
      {
        "code": "341500",
        "name": "池州市",
        "center": [
          117.4891,
          30.6648
        ],
        "children": [
          {
            "code": "341500_ALL",
            "name": "全区全域",
            "center": [
              117.4891,
              30.6648
            ]
          },
          {
            "code": "341500_1",
            "name": "贵池区",
            "center": [
              117.4891,
              30.6648
            ]
          },
          {
            "code": "341500_2",
            "name": "东至县",
            "center": [
              117.4891,
              30.6648
            ]
          },
          {
            "code": "341500_3",
            "name": "石台县",
            "center": [
              117.4891,
              30.6648
            ]
          },
          {
            "code": "341500_4",
            "name": "青阳县",
            "center": [
              117.4891,
              30.6648
            ]
          }
        ]
      },
      {
        "code": "341600",
        "name": "宣城市",
        "center": [
          118.7579,
          30.9457
        ],
        "children": [
          {
            "code": "341600_ALL",
            "name": "全区全域",
            "center": [
              118.7579,
              30.9457
            ]
          },
          {
            "code": "341600_1",
            "name": "宣州区",
            "center": [
              118.7579,
              30.9457
            ]
          },
          {
            "code": "341600_2",
            "name": "郎溪县",
            "center": [
              118.7579,
              30.9457
            ]
          },
          {
            "code": "341600_3",
            "name": "广德市",
            "center": [
              118.7579,
              30.9457
            ]
          },
          {
            "code": "341600_4",
            "name": "泾县",
            "center": [
              118.7579,
              30.9457
            ]
          },
          {
            "code": "341600_5",
            "name": "绩溪县",
            "center": [
              118.7579,
              30.9457
            ]
          },
          {
            "code": "341600_6",
            "name": "旌德县",
            "center": [
              118.7579,
              30.9457
            ]
          },
          {
            "code": "341600_7",
            "name": "宁国市",
            "center": [
              118.7579,
              30.9457
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "350000",
    "name": "福建省",
    "center": [
      119.3062,
      26.0753
    ],
    "children": [
      {
        "code": "350000_ALL",
        "name": "全省范围",
        "center": [
          119.3062,
          26.0753
        ],
        "children": [
          {
            "code": "350000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              119.3062,
              26.0753
            ]
          }
        ]
      },
      {
        "code": "350100",
        "name": "福州市",
        "center": [
          119.3062,
          26.0753
        ],
        "children": [
          {
            "code": "350100_ALL",
            "name": "全区全域",
            "center": [
              119.3062,
              26.0753
            ]
          },
          {
            "code": "350100_1",
            "name": "鼓楼区",
            "center": [
              119.3062,
              26.0753
            ]
          },
          {
            "code": "350100_2",
            "name": "台江区",
            "center": [
              119.3062,
              26.0753
            ]
          },
          {
            "code": "350100_3",
            "name": "仓山区",
            "center": [
              119.3062,
              26.0753
            ]
          },
          {
            "code": "350100_4",
            "name": "马尾区",
            "center": [
              119.3062,
              26.0753
            ]
          },
          {
            "code": "350100_5",
            "name": "晋安区",
            "center": [
              119.3062,
              26.0753
            ]
          },
          {
            "code": "350100_6",
            "name": "长乐区",
            "center": [
              119.3062,
              26.0753
            ]
          },
          {
            "code": "350100_7",
            "name": "闽侯县",
            "center": [
              119.3062,
              26.0753
            ]
          },
          {
            "code": "350100_8",
            "name": "连江县",
            "center": [
              119.3062,
              26.0753
            ]
          },
          {
            "code": "350100_9",
            "name": "罗源县",
            "center": [
              119.3062,
              26.0753
            ]
          },
          {
            "code": "350100_10",
            "name": "闽清县",
            "center": [
              119.3062,
              26.0753
            ]
          },
          {
            "code": "350100_11",
            "name": "永泰县",
            "center": [
              119.3062,
              26.0753
            ]
          },
          {
            "code": "350100_12",
            "name": "平潭县",
            "center": [
              119.3062,
              26.0753
            ]
          },
          {
            "code": "350100_13",
            "name": "福清市",
            "center": [
              119.3062,
              26.0753
            ]
          }
        ]
      },
      {
        "code": "350200",
        "name": "厦门市",
        "center": [
          118.0894,
          24.4798
        ],
        "children": [
          {
            "code": "350200_ALL",
            "name": "全区全域",
            "center": [
              118.0894,
              24.4798
            ]
          },
          {
            "code": "350200_1",
            "name": "思明区",
            "center": [
              118.0894,
              24.4798
            ]
          },
          {
            "code": "350200_2",
            "name": "湖里区",
            "center": [
              118.0894,
              24.4798
            ]
          },
          {
            "code": "350200_3",
            "name": "集美区",
            "center": [
              118.0894,
              24.4798
            ]
          },
          {
            "code": "350200_4",
            "name": "海沧区",
            "center": [
              118.0894,
              24.4798
            ]
          },
          {
            "code": "350200_5",
            "name": "同安区",
            "center": [
              118.0894,
              24.4798
            ]
          },
          {
            "code": "350200_6",
            "name": "翔安区",
            "center": [
              118.0894,
              24.4798
            ]
          }
        ]
      },
      {
        "code": "350300",
        "name": "莆田市",
        "center": [
          119.0076,
          25.431
        ],
        "children": [
          {
            "code": "350300_ALL",
            "name": "全区全域",
            "center": [
              119.0076,
              25.431
            ]
          },
          {
            "code": "350300_1",
            "name": "城厢区",
            "center": [
              119.0076,
              25.431
            ]
          },
          {
            "code": "350300_2",
            "name": "涵江区",
            "center": [
              119.0076,
              25.431
            ]
          },
          {
            "code": "350300_3",
            "name": "荔城区",
            "center": [
              119.0076,
              25.431
            ]
          },
          {
            "code": "350300_4",
            "name": "秀屿区",
            "center": [
              119.0076,
              25.431
            ]
          },
          {
            "code": "350300_5",
            "name": "仙游县",
            "center": [
              119.0076,
              25.431
            ]
          }
        ]
      },
      {
        "code": "350400",
        "name": "三明市",
        "center": [
          117.635,
          26.2654
        ],
        "children": [
          {
            "code": "350400_ALL",
            "name": "全区全域",
            "center": [
              117.635,
              26.2654
            ]
          },
          {
            "code": "350400_1",
            "name": "三元区",
            "center": [
              117.635,
              26.2654
            ]
          },
          {
            "code": "350400_2",
            "name": "沙县区",
            "center": [
              117.635,
              26.2654
            ]
          },
          {
            "code": "350400_3",
            "name": "明溪县",
            "center": [
              117.635,
              26.2654
            ]
          },
          {
            "code": "350400_4",
            "name": "清流县",
            "center": [
              117.635,
              26.2654
            ]
          },
          {
            "code": "350400_5",
            "name": "宁化县",
            "center": [
              117.635,
              26.2654
            ]
          },
          {
            "code": "350400_6",
            "name": "大田县",
            "center": [
              117.635,
              26.2654
            ]
          },
          {
            "code": "350400_7",
            "name": "尤溪县",
            "center": [
              117.635,
              26.2654
            ]
          },
          {
            "code": "350400_8",
            "name": "将乐县",
            "center": [
              117.635,
              26.2654
            ]
          },
          {
            "code": "350400_9",
            "name": "泰宁县",
            "center": [
              117.635,
              26.2654
            ]
          },
          {
            "code": "350400_10",
            "name": "建宁县",
            "center": [
              117.635,
              26.2654
            ]
          },
          {
            "code": "350400_11",
            "name": "永安市",
            "center": [
              117.635,
              26.2654
            ]
          }
        ]
      },
      {
        "code": "350500",
        "name": "泉州市",
        "center": [
          118.6757,
          24.8741
        ],
        "children": [
          {
            "code": "350500_ALL",
            "name": "全区全域",
            "center": [
              118.6757,
              24.8741
            ]
          },
          {
            "code": "350500_1",
            "name": "鲤城区",
            "center": [
              118.6757,
              24.8741
            ]
          },
          {
            "code": "350500_2",
            "name": "丰泽区",
            "center": [
              118.6757,
              24.8741
            ]
          },
          {
            "code": "350500_3",
            "name": "洛江区",
            "center": [
              118.6757,
              24.8741
            ]
          },
          {
            "code": "350500_4",
            "name": "泉港区",
            "center": [
              118.6757,
              24.8741
            ]
          },
          {
            "code": "350500_5",
            "name": "惠安县",
            "center": [
              118.6757,
              24.8741
            ]
          },
          {
            "code": "350500_6",
            "name": "安溪县",
            "center": [
              118.6757,
              24.8741
            ]
          },
          {
            "code": "350500_7",
            "name": "永春县",
            "center": [
              118.6757,
              24.8741
            ]
          },
          {
            "code": "350500_8",
            "name": "德化县",
            "center": [
              118.6757,
              24.8741
            ]
          },
          {
            "code": "350500_9",
            "name": "石狮市",
            "center": [
              118.6757,
              24.8741
            ]
          },
          {
            "code": "350500_10",
            "name": "晋江市",
            "center": [
              118.6757,
              24.8741
            ]
          },
          {
            "code": "350500_11",
            "name": "南安市",
            "center": [
              118.6757,
              24.8741
            ]
          }
        ]
      },
      {
        "code": "350600",
        "name": "漳州市",
        "center": [
          117.6618,
          24.5109
        ],
        "children": [
          {
            "code": "350600_ALL",
            "name": "全区全域",
            "center": [
              117.6618,
              24.5109
            ]
          },
          {
            "code": "350600_1",
            "name": "芗城区",
            "center": [
              117.6618,
              24.5109
            ]
          },
          {
            "code": "350600_2",
            "name": "龙文区",
            "center": [
              117.6618,
              24.5109
            ]
          },
          {
            "code": "350600_3",
            "name": "龙海区",
            "center": [
              117.6618,
              24.5109
            ]
          },
          {
            "code": "350600_4",
            "name": "长泰区",
            "center": [
              117.6618,
              24.5109
            ]
          },
          {
            "code": "350600_5",
            "name": "诏安县",
            "center": [
              117.6618,
              24.5109
            ]
          },
          {
            "code": "350600_6",
            "name": "平和县",
            "center": [
              117.6618,
              24.5109
            ]
          },
          {
            "code": "350600_7",
            "name": "华安县",
            "center": [
              117.6618,
              24.5109
            ]
          },
          {
            "code": "350600_8",
            "name": "浦南县",
            "center": [
              117.6618,
              24.5109
            ]
          },
          {
            "code": "350600_9",
            "name": "云霄县",
            "center": [
              117.6618,
              24.5109
            ]
          }
        ]
      },
      {
        "code": "350700",
        "name": "南平市",
        "center": [
          118.1784,
          26.6424
        ],
        "children": [
          {
            "code": "350700_ALL",
            "name": "全区全域",
            "center": [
              118.1784,
              26.6424
            ]
          },
          {
            "code": "350700_1",
            "name": "建阳区",
            "center": [
              118.1784,
              26.6424
            ]
          },
          {
            "code": "350700_2",
            "name": "延平区",
            "center": [
              118.1784,
              26.6424
            ]
          },
          {
            "code": "350700_3",
            "name": "顺昌县",
            "center": [
              118.1784,
              26.6424
            ]
          },
          {
            "code": "350700_4",
            "name": "浦城县",
            "center": [
              118.1784,
              26.6424
            ]
          },
          {
            "code": "350700_5",
            "name": "光泽县",
            "center": [
              118.1784,
              26.6424
            ]
          },
          {
            "code": "350700_6",
            "name": "松溪县",
            "center": [
              118.1784,
              26.6424
            ]
          },
          {
            "code": "350700_7",
            "name": "政和县",
            "center": [
              118.1784,
              26.6424
            ]
          },
          {
            "code": "350700_8",
            "name": "邵武市",
            "center": [
              118.1784,
              26.6424
            ]
          },
          {
            "code": "350700_9",
            "name": "武夷山市",
            "center": [
              118.1784,
              26.6424
            ]
          },
          {
            "code": "350700_10",
            "name": "建瓯市",
            "center": [
              118.1784,
              26.6424
            ]
          }
        ]
      },
      {
        "code": "350800",
        "name": "龙岩市",
        "center": [
          117.0298,
          25.0916
        ],
        "children": [
          {
            "code": "350800_ALL",
            "name": "全区全域",
            "center": [
              117.0298,
              25.0916
            ]
          },
          {
            "code": "350800_1",
            "name": "新罗区",
            "center": [
              117.0298,
              25.0916
            ]
          },
          {
            "code": "350800_2",
            "name": "永定区",
            "center": [
              117.0298,
              25.0916
            ]
          },
          {
            "code": "350800_3",
            "name": "长汀县",
            "center": [
              117.0298,
              25.0916
            ]
          },
          {
            "code": "350800_4",
            "name": "上杭县",
            "center": [
              117.0298,
              25.0916
            ]
          },
          {
            "code": "350800_5",
            "name": "武平县",
            "center": [
              117.0298,
              25.0916
            ]
          },
          {
            "code": "350800_6",
            "name": "连城县",
            "center": [
              117.0298,
              25.0916
            ]
          },
          {
            "code": "350800_7",
            "name": "漳平市",
            "center": [
              117.0298,
              25.0916
            ]
          }
        ]
      },
      {
        "code": "350900",
        "name": "宁德市",
        "center": [
          119.5271,
          26.6593
        ],
        "children": [
          {
            "code": "350900_ALL",
            "name": "全区全域",
            "center": [
              119.5271,
              26.6593
            ]
          },
          {
            "code": "350900_1",
            "name": "蕉城区",
            "center": [
              119.5271,
              26.6593
            ]
          },
          {
            "code": "350900_2",
            "name": "霞浦县",
            "center": [
              119.5271,
              26.6593
            ]
          },
          {
            "code": "350900_3",
            "name": "古田县",
            "center": [
              119.5271,
              26.6593
            ]
          },
          {
            "code": "350900_4",
            "name": "屏南县",
            "center": [
              119.5271,
              26.6593
            ]
          },
          {
            "code": "350900_5",
            "name": "寿宁县",
            "center": [
              119.5271,
              26.6593
            ]
          },
          {
            "code": "350900_6",
            "name": "周宁县",
            "center": [
              119.5271,
              26.6593
            ]
          },
          {
            "code": "350900_7",
            "name": "柘荣县",
            "center": [
              119.5271,
              26.6593
            ]
          },
          {
            "code": "350900_8",
            "name": "福安市",
            "center": [
              119.5271,
              26.6593
            ]
          },
          {
            "code": "350900_9",
            "name": "福鼎市",
            "center": [
              119.5271,
              26.6593
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "610000",
    "name": "陕西省",
    "center": [
      108.948,
      34.2632
    ],
    "children": [
      {
        "code": "610000_ALL",
        "name": "全省范围",
        "center": [
          108.948,
          34.2632
        ],
        "children": [
          {
            "code": "610000_ALL_DIST",
            "name": "全省全域范围",
            "center": [
              108.948,
              34.2632
            ]
          }
        ]
      },
      {
        "code": "610100",
        "name": "西安市",
        "center": [
          108.948,
          34.2632
        ],
        "children": [
          {
            "code": "610100_ALL",
            "name": "全区全域",
            "center": [
              108.948,
              34.2632
            ]
          },
          {
            "code": "610100_1",
            "name": "新城区",
            "center": [
              108.948,
              34.2632
            ]
          },
          {
            "code": "610100_2",
            "name": "碑林区",
            "center": [
              108.948,
              34.2632
            ]
          },
          {
            "code": "610100_3",
            "name": "莲湖区",
            "center": [
              108.948,
              34.2632
            ]
          },
          {
            "code": "610100_4",
            "name": "灞桥区",
            "center": [
              108.948,
              34.2632
            ]
          },
          {
            "code": "610100_5",
            "name": "未央区",
            "center": [
              108.948,
              34.2632
            ]
          },
          {
            "code": "610100_6",
            "name": "雁塔区",
            "center": [
              108.948,
              34.2632
            ]
          },
          {
            "code": "610100_7",
            "name": "阎良区",
            "center": [
              108.948,
              34.2632
            ]
          },
          {
            "code": "610100_8",
            "name": "临潼区",
            "center": [
              108.948,
              34.2632
            ]
          },
          {
            "code": "610100_9",
            "name": "长安区",
            "center": [
              108.948,
              34.2632
            ]
          },
          {
            "code": "610100_10",
            "name": "高陵区",
            "center": [
              108.948,
              34.2632
            ]
          },
          {
            "code": "610100_11",
            "name": "鄠邑区",
            "center": [
              108.948,
              34.2632
            ]
          },
          {
            "code": "610100_12",
            "name": "蓝田县",
            "center": [
              108.948,
              34.2632
            ]
          },
          {
            "code": "610100_13",
            "name": "周至县",
            "center": [
              108.948,
              34.2632
            ]
          }
        ]
      },
      {
        "code": "610200",
        "name": "铜川市",
        "center": [
          108.9451,
          34.8967
        ],
        "children": [
          {
            "code": "610200_ALL",
            "name": "全区全域",
            "center": [
              108.9451,
              34.8967
            ]
          },
          {
            "code": "610200_1",
            "name": "王益区",
            "center": [
              108.9451,
              34.8967
            ]
          },
          {
            "code": "610200_2",
            "name": "印台区",
            "center": [
              108.9451,
              34.8967
            ]
          },
          {
            "code": "610200_3",
            "name": "耀州区",
            "center": [
              108.9451,
              34.8967
            ]
          },
          {
            "code": "610200_4",
            "name": "宜君县",
            "center": [
              108.9451,
              34.8967
            ]
          }
        ]
      },
      {
        "code": "610300",
        "name": "宝鸡市",
        "center": [
          107.1449,
          34.3693
        ],
        "children": [
          {
            "code": "610300_ALL",
            "name": "全区全域",
            "center": [
              107.1449,
              34.3693
            ]
          },
          {
            "code": "610300_1",
            "name": "渭滨区",
            "center": [
              107.1449,
              34.3693
            ]
          },
          {
            "code": "610300_2",
            "name": "金台区",
            "center": [
              107.1449,
              34.3693
            ]
          },
          {
            "code": "610300_3",
            "name": "陈仓区",
            "center": [
              107.1449,
              34.3693
            ]
          },
          {
            "code": "610300_4",
            "name": "凤翔区",
            "center": [
              107.1449,
              34.3693
            ]
          },
          {
            "code": "610300_5",
            "name": "岐山县",
            "center": [
              107.1449,
              34.3693
            ]
          },
          {
            "code": "610300_6",
            "name": "扶风县",
            "center": [
              107.1449,
              34.3693
            ]
          },
          {
            "code": "610300_7",
            "name": "眉县",
            "center": [
              107.1449,
              34.3693
            ]
          },
          {
            "code": "610300_8",
            "name": "陇县",
            "center": [
              107.1449,
              34.3693
            ]
          },
          {
            "code": "610300_9",
            "name": "千阳县",
            "center": [
              107.1449,
              34.3693
            ]
          },
          {
            "code": "610300_10",
            "name": "麟游县",
            "center": [
              107.1449,
              34.3693
            ]
          },
          {
            "code": "610300_11",
            "name": "凤县",
            "center": [
              107.1449,
              34.3693
            ]
          },
          {
            "code": "610300_12",
            "name": "太白县",
            "center": [
              107.1449,
              34.3693
            ]
          }
        ]
      },
      {
        "code": "610400",
        "name": "咸阳市",
        "center": [
          108.7051,
          34.3334
        ],
        "children": [
          {
            "code": "610400_ALL",
            "name": "全区全域",
            "center": [
              108.7051,
              34.3334
            ]
          },
          {
            "code": "610400_1",
            "name": "秦都区",
            "center": [
              108.7051,
              34.3334
            ]
          },
          {
            "code": "610400_2",
            "name": "杨陵区",
            "center": [
              108.7051,
              34.3334
            ]
          },
          {
            "code": "610400_3",
            "name": "渭城区",
            "center": [
              108.7051,
              34.3334
            ]
          },
          {
            "code": "610400_4",
            "name": "三原县",
            "center": [
              108.7051,
              34.3334
            ]
          },
          {
            "code": "610400_5",
            "name": "泾阳县",
            "center": [
              108.7051,
              34.3334
            ]
          },
          {
            "code": "610400_6",
            "name": "乾县",
            "center": [
              108.7051,
              34.3334
            ]
          },
          {
            "code": "610400_7",
            "name": "礼泉县",
            "center": [
              108.7051,
              34.3334
            ]
          },
          {
            "code": "610400_8",
            "name": "永寿县",
            "center": [
              108.7051,
              34.3334
            ]
          },
          {
            "code": "610400_9",
            "name": "彬州市",
            "center": [
              108.7051,
              34.3334
            ]
          },
          {
            "code": "610400_10",
            "name": "长武县",
            "center": [
              108.7051,
              34.3334
            ]
          },
          {
            "code": "610400_11",
            "name": "旬邑县",
            "center": [
              108.7051,
              34.3334
            ]
          },
          {
            "code": "610400_12",
            "name": "淳化县",
            "center": [
              108.7051,
              34.3334
            ]
          },
          {
            "code": "610400_13",
            "name": "武功县",
            "center": [
              108.7051,
              34.3334
            ]
          },
          {
            "code": "610400_14",
            "name": "兴平市",
            "center": [
              108.7051,
              34.3334
            ]
          }
        ]
      },
      {
        "code": "610500",
        "name": "渭南市",
        "center": [
          109.5029,
          34.4994
        ],
        "children": [
          {
            "code": "610500_ALL",
            "name": "全区全域",
            "center": [
              109.5029,
              34.4994
            ]
          },
          {
            "code": "610500_1",
            "name": "临渭区",
            "center": [
              109.5029,
              34.4994
            ]
          },
          {
            "code": "610500_2",
            "name": "华州区",
            "center": [
              109.5029,
              34.4994
            ]
          },
          {
            "code": "610500_3",
            "name": "潼关县",
            "center": [
              109.5029,
              34.4994
            ]
          },
          {
            "code": "610500_4",
            "name": "大荔县",
            "center": [
              109.5029,
              34.4994
            ]
          },
          {
            "code": "610500_5",
            "name": "合阳县",
            "center": [
              109.5029,
              34.4994
            ]
          },
          {
            "code": "610500_6",
            "name": "澄城县",
            "center": [
              109.5029,
              34.4994
            ]
          },
          {
            "code": "610500_7",
            "name": "蒲城县",
            "center": [
              109.5029,
              34.4994
            ]
          },
          {
            "code": "610500_8",
            "name": "白水县",
            "center": [
              109.5029,
              34.4994
            ]
          },
          {
            "code": "610500_9",
            "name": "富平县",
            "center": [
              109.5029,
              34.4994
            ]
          },
          {
            "code": "610500_10",
            "name": "韩城市",
            "center": [
              109.5029,
              34.4994
            ]
          },
          {
            "code": "610500_11",
            "name": "华阴市",
            "center": [
              109.5029,
              34.4994
            ]
          }
        ]
      },
      {
        "code": "610600",
        "name": "延安市",
        "center": [
          109.4908,
          36.5965
        ],
        "children": [
          {
            "code": "610600_ALL",
            "name": "全区全域",
            "center": [
              109.4908,
              36.5965
            ]
          },
          {
            "code": "610600_1",
            "name": "宝塔区",
            "center": [
              109.4908,
              36.5965
            ]
          },
          {
            "code": "610600_2",
            "name": "安塞区",
            "center": [
              109.4908,
              36.5965
            ]
          },
          {
            "code": "610600_3",
            "name": "子长市",
            "center": [
              109.4908,
              36.5965
            ]
          },
          {
            "code": "610600_4",
            "name": "志丹县",
            "center": [
              109.4908,
              36.5965
            ]
          },
          {
            "code": "610600_5",
            "name": "吴起县",
            "center": [
              109.4908,
              36.5965
            ]
          },
          {
            "code": "610600_6",
            "name": "延川县",
            "center": [
              109.4908,
              36.5965
            ]
          },
          {
            "code": "610600_7",
            "name": "延长县",
            "center": [
              109.4908,
              36.5965
            ]
          },
          {
            "code": "610600_8",
            "name": "甘泉县",
            "center": [
              109.4908,
              36.5965
            ]
          },
          {
            "code": "610600_9",
            "name": "富县",
            "center": [
              109.4908,
              36.5965
            ]
          },
          {
            "code": "610600_10",
            "name": "洛川县",
            "center": [
              109.4908,
              36.5965
            ]
          },
          {
            "code": "610600_11",
            "name": "宜川县",
            "center": [
              109.4908,
              36.5965
            ]
          },
          {
            "code": "610600_12",
            "name": "黄龙县",
            "center": [
              109.4908,
              36.5965
            ]
          },
          {
            "code": "610600_13",
            "name": "黄陵县",
            "center": [
              109.4908,
              36.5965
            ]
          }
        ]
      },
      {
        "code": "610700",
        "name": "汉中市",
        "center": [
          107.0286,
          33.0777
        ],
        "children": [
          {
            "code": "610700_ALL",
            "name": "全区全域",
            "center": [
              107.0286,
              33.0777
            ]
          },
          {
            "code": "610700_1",
            "name": "汉台区",
            "center": [
              107.0286,
              33.0777
            ]
          },
          {
            "code": "610700_2",
            "name": "南郑区",
            "center": [
              107.0286,
              33.0777
            ]
          },
          {
            "code": "610700_3",
            "name": "城固县",
            "center": [
              107.0286,
              33.0777
            ]
          },
          {
            "code": "610700_4",
            "name": "洋县",
            "center": [
              107.0286,
              33.0777
            ]
          },
          {
            "code": "610700_5",
            "name": "西乡县",
            "center": [
              107.0286,
              33.0777
            ]
          },
          {
            "code": "610700_6",
            "name": "勉县",
            "center": [
              107.0286,
              33.0777
            ]
          },
          {
            "code": "610700_7",
            "name": "宁强县",
            "center": [
              107.0286,
              33.0777
            ]
          },
          {
            "code": "610700_8",
            "name": "略阳县",
            "center": [
              107.0286,
              33.0777
            ]
          },
          {
            "code": "610700_9",
            "name": "镇巴县",
            "center": [
              107.0286,
              33.0777
            ]
          },
          {
            "code": "610700_10",
            "name": "留坝县",
            "center": [
              107.0286,
              33.0777
            ]
          },
          {
            "code": "610700_11",
            "name": "佛坪县",
            "center": [
              107.0286,
              33.0777
            ]
          }
        ]
      },
      {
        "code": "610800",
        "name": "榆林市",
        "center": [
          109.7412,
          38.2901
        ],
        "children": [
          {
            "code": "610800_ALL",
            "name": "全区全域",
            "center": [
              109.7412,
              38.2901
            ]
          },
          {
            "code": "610800_1",
            "name": "榆阳区",
            "center": [
              109.7412,
              38.2901
            ]
          },
          {
            "code": "610800_2",
            "name": "横山区",
            "center": [
              109.7412,
              38.2901
            ]
          },
          {
            "code": "610800_3",
            "name": "神木市",
            "center": [
              109.7412,
              38.2901
            ]
          },
          {
            "code": "610800_4",
            "name": "府谷县",
            "center": [
              109.7412,
              38.2901
            ]
          },
          {
            "code": "610800_5",
            "name": "靖边县",
            "center": [
              109.7412,
              38.2901
            ]
          },
          {
            "code": "610800_6",
            "name": "定边县",
            "center": [
              109.7412,
              38.2901
            ]
          },
          {
            "code": "610800_7",
            "name": "绥德县",
            "center": [
              109.7412,
              38.2901
            ]
          },
          {
            "code": "610800_8",
            "name": "米脂县",
            "center": [
              109.7412,
              38.2901
            ]
          },
          {
            "code": "610800_9",
            "name": "佳县",
            "center": [
              109.7412,
              38.2901
            ]
          },
          {
            "code": "610800_10",
            "name": "吴堡县",
            "center": [
              109.7412,
              38.2901
            ]
          },
          {
            "code": "610800_11",
            "name": "清涧县",
            "center": [
              109.7412,
              38.2901
            ]
          },
          {
            "code": "610800_12",
            "name": "子洲县",
            "center": [
              109.7412,
              38.2901
            ]
          }
        ]
      },
      {
        "code": "610900",
        "name": "安康市",
        "center": [
          109.0293,
          32.6848
        ],
        "children": [
          {
            "code": "610900_ALL",
            "name": "全区全域",
            "center": [
              109.0293,
              32.6848
            ]
          },
          {
            "code": "610900_1",
            "name": "汉滨区",
            "center": [
              109.0293,
              32.6848
            ]
          },
          {
            "code": "610900_2",
            "name": "旬阳市",
            "center": [
              109.0293,
              32.6848
            ]
          },
          {
            "code": "610900_3",
            "name": "汉阴县",
            "center": [
              109.0293,
              32.6848
            ]
          },
          {
            "code": "610900_4",
            "name": "石泉县",
            "center": [
              109.0293,
              32.6848
            ]
          },
          {
            "code": "610900_5",
            "name": "宁陕县",
            "center": [
              109.0293,
              32.6848
            ]
          },
          {
            "code": "610900_6",
            "name": "紫阳县",
            "center": [
              109.0293,
              32.6848
            ]
          },
          {
            "code": "610900_7",
            "name": "岚皋县",
            "center": [
              109.0293,
              32.6848
            ]
          },
          {
            "code": "610900_8",
            "name": "平利县",
            "center": [
              109.0293,
              32.6848
            ]
          },
          {
            "code": "610900_9",
            "name": "镇坪县",
            "center": [
              109.0293,
              32.6848
            ]
          },
          {
            "code": "610900_10",
            "name": "白河县",
            "center": [
              109.0293,
              32.6848
            ]
          }
        ]
      },
      {
        "code": "611000",
        "name": "商洛市",
        "center": [
          109.9404,
          33.8683
        ],
        "children": [
          {
            "code": "611000_ALL",
            "name": "全区全域",
            "center": [
              109.9404,
              33.8683
            ]
          },
          {
            "code": "611000_1",
            "name": "商州区",
            "center": [
              109.9404,
              33.8683
            ]
          },
          {
            "code": "611000_2",
            "name": "洛南县",
            "center": [
              109.9404,
              33.8683
            ]
          },
          {
            "code": "611000_3",
            "name": "丹凤县",
            "center": [
              109.9404,
              33.8683
            ]
          },
          {
            "code": "611000_4",
            "name": "商南县",
            "center": [
              109.9404,
              33.8683
            ]
          },
          {
            "code": "611000_5",
            "name": "山阳县",
            "center": [
              109.9404,
              33.8683
            ]
          },
          {
            "code": "611000_6",
            "name": "镇安县",
            "center": [
              109.9404,
              33.8683
            ]
          },
          {
            "code": "611000_7",
            "name": "柞水县",
            "center": [
              109.9404,
              33.8683
            ]
          }
        ]
      }
    ]
  }
];

export interface RegionSearchResult {
  province: string;
  city: string;
  district: string;
  center?: [number, number];
}

export function searchChinaRegions(keyword: string): RegionSearchResult[] {
  if (!keyword || !keyword.trim()) return [];
  const q = keyword.trim().toLowerCase();
  const results: RegionSearchResult[] = [];

  for (const prov of CHINA_REGIONS) {
    if (prov.name === '全国') continue;
    const pMatch = prov.name.toLowerCase().includes(q);

    if (prov.children) {
      for (const city of prov.children) {
        const cMatch = city.name.toLowerCase().includes(q);

        if (city.children) {
          for (const dist of city.children) {
            const dMatch = dist.name.toLowerCase().includes(q);
            if (pMatch || cMatch || dMatch) {
              results.push({
                province: prov.name,
                city: city.name,
                district: dist.name,
                center: dist.center || city.center || prov.center,
              });
              if (results.length >= 25) return results;
            }
          }
        } else if (pMatch || cMatch) {
          results.push({
            province: prov.name,
            city: city.name,
            district: city.name,
            center: city.center || prov.center,
          });
          if (results.length >= 25) return results;
        }
      }
    } else if (pMatch) {
      results.push({
        province: prov.name,
        city: prov.name,
        district: prov.name,
        center: prov.center,
      });
      if (results.length >= 25) return results;
    }
  }

  return results;
}

export function getRegionCenter(pName: string, cName: string, dName: string): [number, number] {
  const prov = CHINA_REGIONS.find((p) => p.name === pName);
  if (!prov) return [104.1954, 35.8617];
  if (pName === '全国') return prov.center;

  const city = prov.children?.find((c) => c.name === cName) || prov.children?.[0];
  if (!city) return prov.center;

  const dist = city.children?.find((d) => d.name === dName) || city.children?.[0];
  if (dist && dist.center) return dist.center;
  if (city.center) return city.center;
  return prov.center;
}
